export const bookData = {
  pages: {
    1: {
      text: `Нещо не е наред...
        Да, нещо не е наред — усещаш го още преди да си се събудил напълно. Сякаш вместо върху познатия сламеник в горската си колиба сега лежиш някъде другаде. Но това е невъзможно, казваш си ти. Как бих могъл да се пренеса на друго място? По вълшебство ли?
  
        И отваряш очи.
        
        В следващия миг скачаш от разхвърляното легло и се оглеждаш смаяно. Този път предчувствието не те е излъгало. Наистина си попаднал другаде — в някаква непозната схлупена колиба с едно-единствено зацапано прозорче, през което едва се процеждат утринните лъчи.
        
        Що за дяволия? Как си се озовал тук?`,
      choices: [
        {
          text: "Почесваш се озадачено по тила, после излизаш от колибата и попадаш на 85. ",
          nextPage: 85,
        },
      ],
    },
    2: {
      text: `— Чакай сега да видим с какво разполагаме — промърморва Гадолини и започва да рови из торбата.`,
      choices: [
        {
          text: "Ако имаш стоножка в бурканче, мини на 113. ",
          nextPage: 113,
          requiresItem: { item: "centipede", quantity: 1 },
        },
        {
          text: "Ако имаш лула на мира, продължи на 159. ",
          nextPage: 159,
          requiresItem: { item: "pipe", quantity: 1 },
        },
        {
          text: "Ако имаш царевица, прехвърли се на 192. ",
          nextPage: 192,
          requiresItem: { item: "corn", quantity: 1 },
        },
        {
          text: "Ако нямаш нищо от изброеното, попадаш на 203. ",
          nextPage: 203,
        },
      ],
      moreText:
        "А ако имаш два или три от тези предмети, избери с кой си готов да се разделиш и премини на съответния епизод.",
    },
    3: {
      text: `— Абе, ще ни излапат с парцалите, като не се вслушвате в гласа на разума — мърмори Хухавел и с усилие гази напред.

        А наоколо главите на блатните таласъми идват все по-близо. Внезапно един от тях отваря уста и изрича с квакащ глас:
        
        — Какви сте вие, добри хора, и по каква работа минавате през нашето блато?
        
        Какво ще му отговориш? `,
      choices: [
        { text: "Че сте търговци — мини на 20.  ", nextPage: 20 },
        { text: "Че сте мирни пътници — продължи на 35. ", nextPage: 35 },
        {
          text: "Че сте отряд командоси, тръгнали на тайна акция срещу таласъмите на Дървеняк Първи — попадаш на 50. ",
          nextPage: 50,
        },
        { text: "Че не е тяхна работа — прехвърли се на 66. ", nextPage: 66 },
      ],
    },
    4: {
      text: `— Бях огнедишащ, обаче вече не съм — въздъхва змеят. — Остарях, изнемощях… На, гледай!
        
        Той разтваря широко грамадната си паст и почва да съска като кипнал чайник, но въпреки всички усилия от гърлото му излитат само две-три облачета пушек.
        
        — А пък бях страшен звяр — тъжно клати глава змеят. — Ако ме видят сега, за смях ще стана. Затуй съм се заврял под земята — да не ми гледат срама.
        
        — Това е защото не гледаш научно на нещата! — упреква го Хухавел и се обръща към теб. — Шефе, дай една царевица!`,
      choices: [
        {
          text: "Ако имаш царевица и се съгласиш да я дадеш на Хухавел, мини на 23. ",
          requiresItem: { item: "corn", quantity: 1 },
          removeFromInventory: { item: "corn", quantity: 1 },
          nextPage: 23,
        },
        { text: "В противен случай продължи на 45. ", nextPage: 45 },
      ],
    },
    5: {
      text: `— Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още утре потеглям към новия замък на таласъмите. Искам в ранни зори насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия.
        
        Чукундуртите изревават възторжено.
        
        — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо.
        
        Друг перва министър-предателя по главата.
        
        — Видя ли бе? Това се казва министър, а не предател като тебе. Ако не беше той, как щяхме да разкрием плановете на Дървеняк?
        
        През целия следобед настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Привечер предлагат да те настанят като скъп гост в най-хубавата колиба. Обещават дори да ти осигурят течаща вода и централно отопление.
        
        Силно си изненадан, че в това село има такива модерни удобства, но какво ли не може да се очаква от чукундуртите. Решавай сега каква колиба ще избереш.`,
      choices: [
        {
          text: "С течаща вода и централно отопление — мини на 26. ",
          nextPage: 26,
        },
        { text: "Само с течаща вода — продължи на 58. ", nextPage: 58 },
        { text: "Само с централно отопление — попадаш на 91. ", nextPage: 91 },
        { text: "Без такива глезотии — прехвърли се на 109. ", nextPage: 109 },
      ],
    },
    6: {
      text: `Имал ли си нещастието преди малко да бъдеш ранен с вилица в ръката?`,
      choices: [
        {
          text: "Да — мини на 230. ",
          nextPage: 230,
          requiresCondition: { condition: "injuredWithFork" },
        },
        {
          text: "Не — продължи на 284. ",
          nextPage: 284,
          requiresCondition: { condition: "healthy" },
        },
      ],
    },
    7: {
      text: `Минавал ли си вече по този път?`,
      choices: [
        { text: "Да — продължи на 33. ", nextPage: 33, visitedPages: 8 },
        { text: "Не — прехвърли се на 8. ", nextPage: 8 },
      ],
    },
    8: {
      text: `Без колебание повеждаш дружината си по лявото разклонение. Може и да са прави чукундуртите — все пак гъбената чорбица е хубаво нещо. Скоро пътят започва постепенно да завива надясно и навлиза в рядка горичка.
        
        — По такива места растат най-хубавите гъби — развълнувано обявява Бабаитко. — Пък и камъкът сигурно не лъжеше. Слушай, шефе, дай да потърсим. Тя работата, няма да избяга.`,
      choices: [
        {
          text: "Ако се съгласиш да потърсите гъби, мини на 24. ",
          nextPage: 24,
        },
        {
          text: "Ако не искаш да губиш време за подобни глупости, продължи на 49. ",
          nextPage: 49,
        },
      ],
    },
    9: {
      text: `— Аман от суха вода! — ядосва се таласъмът и запокитва шишенцето в кладенеца. — Вие подигравате ли ми се? Марш веднага оттук! Никаква вода за вас!
        
        — Дай да му опаля един, бе шефе! — моли се Бабаитко.`,
      choices: [
        { text: "Ако му разрешиш да го стори, мини на 208. ", nextPage: 208 },
        { text: "Ако се откажеш от водата и продължиш пътешествието, мини на 177. ", nextPage: 177},
      ],
    },
    10: {
      text: `О, любезний читателю! С това свое решение ти показа, че наистина в гърдите ти бие сърце на чукундурт. Не ще и дума, очаква те трудна, но славна съдба. Тепърва ще бъдеш оплюван всекидневно от целокупния чукундуртски народ. Ако издържиш на изпитанията достатъчно дълго, подир време току-виж си станал министър на простите работи. Но така или иначе това вече е съвсем друга история. Твоето приключение привършва дотук.`,
      choices: [],
      end: true,
    },
    11: {
      text: `Добре, но как да му помогнеш? Сега е моментът да провериш с какво разполагаш.`,
      choices: [
        {
          text: "Ако имаш чифт вехти панталони и искаш да ги дадеш на Мишемориус, мини на 34. ",
          nextPage: 34,
          requiresItem: "oldTrousers",
          removeFromInventory: { item: "oldTrousers", quantity: 1 },
        },
        {
          text: "Ако имаш шишенце с универсален разтворител и го използваш, за да отлепиш панталоните му от стола, продължи на 48. ",
          nextPage: 48,
          requiresItem: "bottleOfSolvent",
          removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
        },
        {
          text: "А ако нямаш нито едното, нито другото, прехвърли се на 87. ",
          nextPage: 87,
        },
      ],
    },
    12: {
      text: `Щом отхапваш парченце от жълтата гъба, по цялото ти тяло пробягва непоносим сърбеж и виждаш как короните на дърветата стремително падат насреща ти. Не! Дърветата са неподвижни, но самият ти си израснал невероятно, тъй че сега главата ти се подава над върхарите им.
        
        — Леле, шефе! — уплашено подвиква Фърчилан. — Какво стана? Ами че в тоя вид хич не ставаш за тайна мисия! Ще те зърнат отдалече.
        Уви, Фърчилан е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш? `,
      choices: [
        { text: "Синя — продължи на 57. ", nextPage: 57 },
        { text: "Червена — попадаш на 29. ", nextPage: 29 },
        { text: "Зелена — прехвърли се на 200. ", nextPage: 200 },
        { text: "Черна — отгърни на 53. ", nextPage: 53 },
      ],
    },
    13: {
      text: `— Хвърляй царевицата, шефе! — отчаяно се провиква Гадолини.
        Разбираш гениалната му идея и незабавно хвърляш царевицата на стъпалата, сетне продължаваш да бягаш надолу.
        Колко кочана царевица си хвърлил? `,
      choices: [
        {
          text: "Един — мини по свой избор на 217, 227 или 242.",
          nextPage: [217, 227, 242],
          requiresItem: { item: "corn", quantity: 1 },
          removeFromInventory: { item: "corn", quantity: 1 },
        },
        {
          text: "Два — продължи на 206 или 259.",
          nextPage: [206, 259],
          requiresItem: { item: "corn", quantity: 2 },
          removeFromInventory: { item: "corn", quantity: 2 },
        },
        {
          text: "Три — прехвърли се на 250.",
          nextPage: 250,
          requiresItem: { item: "corn", quantity: 3 },
          removeFromInventory: { item: "corn", quantity: 3 },
        },
      ],
    },
    14: {
      text: `Не, това блато никак не ти се нрави. Повеждаш обратно дружината си и един час по-късно наближавате… всъщност какво наближавате?`,
      choices: [
        { text: "Кръстопътя — мини на 75.", nextPage: 75 },
        { text: "Сливането на левия и средния път — продължи на 40.", nextPage: 40 },
      ],
    },
    15: {
      text: `Щом отваряш торбата, отвътре добродушно те поглежда патката на Хухавел.

        — Къш, птицо проклета! — крясваш ти, после се обръщаш към чукундуртите и свирепо питаш: — Какво търси тук това животно?

        — Не е животно, а птица, сам го каза преди малко — поправя те Хухавел. — Турнах я вътре, щото иначе е много неудобно. Нали разбираш, шефе, патката под мишница и торбата на другото рамо. Хич не върви, значи.

        Да, но се оказва, че патката не разбира от дисциплина. Изкълвала е двата домата и тъкмо се готви да начене царевицата.

        — И най-умният чукундурт пак си остава чукундурт — въздъхваш ти. — Стига толкова! Отсега нататък аз ще нося торбата.`,
      choices: [
        {
          text: "Отбележи си загубата на двата домата и премини на 138.",
          nextPage: 138,
          removeFromInventory: { item: "tomato", quantity: 2 },
        },
      ],
    },
    16: {
      text: `— Чакай сега да видим с какво разполагаме — промърморва Фърчилан и започва да рови из торбата.`,
      choices: [
        {
          text: "Ако имаш домат, мини на 78.",
          nextPage: 78,
          requiresItem: { item: "tomato", quantity: 1 },
          removeFromInventory: { item: "tomato", quantity: 1 },
        },
        {
          text: "Ако имаш диня, продължи на 126.",
          nextPage: 126,
          requiresItem: { item: "watermelon", quantity: 1 },
          removeFromInventory: { item: "watermelon", quantity: 1 },
        },
        {
          text: "Ако нямаш нищо от изброеното, попадаш на 203.",
          nextPage: 203,
        },
      ],
      moreText:
        "А ако имаш и двете, избери с кое си готов да се разделиш и премини на съответния епизод.",
    },
    17: {
      text: `Щом отхапваш от синята гъба, мигновено те побиват ледени тръпки и сякаш стремително пропадаш надолу. Не! Просто се смаляваш! За броени секунди изчезваш сред тревата.

        След упорито ровене чукундуртите най-сетне те откриват. Бабаитко те поема върху дланта си и укоризнено поклаща глава.

        — Е, каква стана тя, шефе? Май мисията отива към провал, щото в тоя вид не ми е ясно как ще се биеш с таласъмите.

        Уви, Бабаитко е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш?`,
      choices: [
        { text: "Жълта — продължи на 67.", nextPage: 67 },
        { text: "Червена — попадаш на 29.", nextPage: 29 },
        { text: "Зелена — прехвърли се на 82.", nextPage: 82 },
        { text: "Черна — отгърни на 53.", nextPage: 53 },
      ],
    },
    18: {
      text: `След доста усилия импровизираната манерка е готова.`,
      choices: [
        {
          text: "Отбележи си, че нямаш вече диня и премини на 194.",
          nextPage: 194,
          removeFromInventory: { item: "watermelon", quantity: 1 },
        },
      ],
    },
    19: {
      text: `Щом те виждат отново в колибата, министрите моментално падат на колене и започват да блъскат чела в земята.

        — Върна се, великодушни наш благодетелю!

        — Спасителю!

        — Бащице!

        — Значи ще станеш министър на външните работи, нали!`,
      choices: [{ text: "Продължи на 102.", nextPage: 102 }],
    },
    20: {
      text: `— Еха-а-а-а, търговци! — възторжено се провиква таласъмът. — Грабители на народа значи! Кърлежи! Кръвопийци! Напред, братя таласъми! Да ограбим награбеното от народа!

        И блатните таласъми се устремяват към вас. Предводителят им спира на няколко крачки от вас и пита:

        — Е, ще предадете ли доброволно цялото си имущество, или да ви принудим със сила?`,
      choices: [
        {
          text: "— Аз викам да им го дадем, шефе — обажда се Хухавел.",
          nextPage: 28,
        },
        { text: "— Не, да се бием — възразява Бабаитко.", nextPage: 41 },
        { text: "— По-добре да бягаме — предлага Фърчилан.", nextPage: 54 },
      ],
    },
    21: {
      text: `Когато се свестяваш, лежиш в тясна килия, а около теб седят унило четиримата чукундурти.`,
      choices: [
        {
          text: "Попадал ли си вече в затвора?",
          nextPage: 285,
          requiresCondition: "jailed",
        },
        { text: "Не — продължи на 132.", nextPage: 132 },
      ],
    },
    22: {
      text: `Бабаитко гордо се изпъчва и пристъпва към вехтошаря.
      
          — Слушай сега, старче. Обмислих нещата и гледай сега как ще уредим сделката. Ти, значи, ми даваш всичките тези вехтории.
      
          Настава тишина. Старчето изчаква малко, после пита:
      
          — А на мен каква ще ми е ползата?
      
          Бабаитко свива едрия си юмрук и го поднася към носа му.
      
          — Ползата ще ти е в това, че няма да те опердаша. Разбра ли?
      
          — О, такава ли била работата? — усмихва се старчето. — Ами тъй кажи, бе човек! Заповядай, заповядай! Чакай само да ти постеля това килимче, че да не стъпваш по прашната земя.
      
          И без да се бави, вехтошарят пъргаво разпъва пред себе си килимчето — кръгло и абсолютно черно. Бабаитко ви хвърля през рамо победоносен поглед, после пристъпва напред… и с ужасен писък пропада в земята.
      
          Няколко секунди стоиш вкаменен от изумление. Сетне осъзнаваш — това не е никакво килимче, а преносима дупка.
      
          — Помо-о-о-ощ! — долита от земните недра отчаяният рев на Бабаитко. — Измъкнете ме оттук!
      
          — Като много знаеш да се репчиш, там ще стоиш — подвиква отгоре старчето. — Ей сега пак ще навия дупката и ще си останеш завинаги под земята.
      
          С много молби и увещания най-сетне успявате да се споразумеете — срещу два кочана царевица старчето ви разрешава да измъкнете Бабаитко. Щом излиза отново на бял свят, едрият чукундурт се отдръпва засрамено настрани.
      
          Отбележи си загубата на двата кочана царевица и избери на кого ще повериш да води сделката.
      `,
      removeFromInventory: { item: "corn", quantity: 2 },
      choices: [
        { text: "Гадолини — продължи на 47.", nextPage: 47, },
        { text: "Хухавел — попадаш на 61.", nextPage: 61 },
        { text: "Фърчилан — прехвърли се на 94.", nextPage: 94 },
        { text: "Сам ще водиш сделката — отгърни на 119.", nextPage: 119 },
      ],
    },
    23: {
      text: `— Слушай сега — почва да обяснява Хухавел. — Можеш ли да лапнеш малко жарава от огъня?
      
          — Мога, как да не мога — кимва змеят и за доказателство налапва половината жарава.
      
          — Ха сега лапни и това — подава му царевицата Хухавел. — И чакай да видиш какво ще стане.
      
          В течение на една минута не се случва нищо. Сетне, по всички закони на науката, царевицата се превръща в пуканки с оглушителен трясък. Ошашавен, змеят отскача настрани и почва да клати глава като куче, лапнало пчела.
      
          — Сега е моментът! — провиква се Фърчилан. — Да бягаме!
      
          — Чакайте! — протестира Хухавел. — Недейте да бягате! Това е недоразумение. Всичко ще обясня.
      
          Кого ще послушаш?
`,
      choices: [
        { text: "Фърчилан — мини на 32.", nextPage: 32 },
        { text: "Хухавел — продължи на 56.", nextPage: 56 },
      ],
    },
    24: {
      text: `
          Или все пак камъкът ви е излъгал, или просто от вас не стават гъбари. След дълго лутане из гората най-сетне откривате само няколко гъби. При това странни — едри и шарени. Всяка в различен цвят — жълта, синя, зелена, червена и черна. 
          Бабаитко боязливо оглежда чудноватите гъби и прошепва: 
          — Не ми харесва тая работа, шефе. Гъбите май са вълшебни. 
          — Абе, стига си говорил глупости! — прекъсва го Фърчилан. — Дай сега бързичко да си ги опечем. 
          — И като станеш после на жаба, ще видиш едни гъби — мрачно заявява Гадолини. — Вие както щете, ама аз вълшебни гъби не ям. 
          Гадолини определено е прав. Дори и да не са вълшебни, гъбите може да са отровни. Затова категорично забраняваш всякакво ядене. 
          Имаш ли книжката „Вълшебните гъби по нашите земи“? 
          `,
      choices: [
        { text: "Да — мини на 63. ", nextPage: 63, requiresItem: { item: "book", quantity: 1 }, },
        { text: "Не — продължи на 98. ", nextPage: 98 },
      ],
    },
    25: {
      text: `
            Когато огледалцето му казва, че е най-красив на земята, таласъмът изпада във възторг. Без повече да ви обръща внимание, той се отдръпва настрани с безценната придобивка.  
            `,
      choices: [
        {
          text: "Напълваш съдинката си с вода и преминаваш на 177. ",
          addToInventory: [ {item: "bottleWater", quantity: 1 }],
          nextPage: 177,
        },
      ],
    },
    26: {
      text: `
            Още щом влизаш в колибата, разбираш какво са имали предвид, като говореха за централно отопление — огнището се намира точно в средата. Обаче колкото и да се оглеждаш, не виждаш никъде нито капка вода. 
— Къде ви е течащата вода? — обръщаш се ти към министъра на разните работи. 
Той размахва ръка нагоре. 
— Виждаш ли я онази дупка горе на тавана? Като завали, през нея ще ти тече колкото искаш. 
— Чукундуртска ви работа — заявяваш ти и се приготвяш за сън. 
Уви, нощта не е твърде приятна. Малко преди полунощ започва да вали като из ведро, а проклетата дупка се намира точно над огнището. Естествено, огънят изгасва и ти чак до сутринта зъзнеш, омотан като пашкул в парцаливите завивки. Когато се развиделява, дъждът спира, но злото вече е сторено — гърлото те боли и кихаш на поразия.
            `,
      choices: [
        {
          text: " Отбележи си, че си настинал и премини на 155.  ",
          nextPage: 155,
        },
      ],
    },
    27: {
      text: `
      — Я, пак идат нашите приятели! — радостно ви посрещат блатните таласъми. — Ама вие какво така само обикаляте насам-натам? 
      — Тя, работата на командосите, не е лесна — гордо заявява Бабаитко. 
      И вие спокойно прекосявате блатото. В коя посока отивате? 
            `,
      choices: [
        {
          text: " Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: " Обратно към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    28: {
      text: `
      Няма как, предаваш на старшия таласъм всичките си придобивки. 
— Ехе-е-е-е! — радостно възкликва той. — Я гледай колко богатства са натрупали експлоататорите на трудовия народ! А сега да ми се махате от главата! Вървете напред, оттук нататък става по-плитко. 
И наистина, скоро започвате да излизате от блатото. 
В коя посока вървите? 
            `,
            emptyInventory: true,
      choices: [
        {
          text: " Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: " Обратно към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    29: {
      text: `
      Щом отхапваш от червената гъба, за миг ти се завива свят, обзема те чувство на неописуема лекота… и после виждаш как чукундуртите стремително се отдалечават надолу. Но всъщност самият ти летиш нагоре в небето, където лекият ветрец те подема и те отнася надалеч. Уви, експериментите са завършили неуспешно — още дълги дни ще се носиш из облаците, докато магията престане и постепенно се спуснеш на земята. 
Така или иначе твоето приключение завършва дотук. 
            `,
      choices: [],
      end: true
    },
    30: {
      text: `
      Продължавате напред по коридора и след малко се озовавате в огромно подземие, пълно с бъчви. Наоколо се носи тежкият дъх на вино. 
— Винце, шефе, винце! — развълнувано възкликва Бабаитко. — Дай да си пийнем малко! 
— За кураж — подкрепя го Фърчилан. 
— И блясък в очите — допълва Хухавел. 
Поглеждаш ги строго. 
— Никакво пиянство не разрешавам при изпълнение на служебните задължения! 
— Е-е-е, що си такъв, бе шефе? — въздъхва Гадолини. — Ние само по мъничко. Обещавам ти да пием с мярка. 
            `,
      choices: [
        {
          text: "Ако разрешиш на чукундуртите да пийнат с мярка, мини на 253. ",
          nextPage: 253,
        },
        {
          text: "Ако забраниш категорично, продължи на 261. ",
          nextPage: 261,
        },
      ],
    },
    31: {
      text: `
      — Хубаво де, стига сте хленчили! — викваш ти с цяло гърло, за да надвикаш плача на уплашените чукундурти. — Ама обяснете все пак… 
— Министрите ще ти обяснят! — провиква се тълпата и с възторжени възгласи те грабва на ръце. 
Преди да се опомниш, вече седиш в някаква колиба, а насреща ти са застанали в почтителни пози двамата белобради чукундурти. Зад тях смутено се свива трети — по-дрипав и по-мръсен от всички останали. 
— Кои сте вие? — питаш ти с леко нетърпение. — Ще ми обясни ли най-сетне някой какво става? 
— О, спасителю наш, аз съм министърът на разните работи — отговаря първият старец. 
— А пък аз съм министърът на другите работи — покланя се до земята вторият, при което неволно си застъпва брадата и се захлупва по нос. 
Тъй като третият гузно мълчи, ти отново питаш: 
— Ами онзи зад вас? 
— А, остави го — небрежно махва с ръка министърът на разните работи. — Той е министър-предател. 
— Да не искаш да кажеш „министър-председател“? 
— А, не, точно министър-предател — обажда се министърът на другите работи, който вече е успял да се изправи. 
— Че за какво ви е министър-предател? — изненадваш се ти. 
— О, много е важен, благодетелю! — обяснява министърът на разните работи. — Тъй и тъй нещата не вървят. Ако си нямаме министър-предател, по кого ще плюе народът? 
— Е, ваша си работа — свиваш рамене ти. — А сега кой ще ми обясни от какво трябва да ви спасявам. 
— Обяснявай ти — обръща се към колегата си министърът на другите работи. — Обясненията спадат към разните работи. 
— А, не, ти обяснявай! — сопва се онзи. — Обясненията са към другите работи. 
— Слушайте, ако не получа незабавно обяснение, ставам и си тръгвам — заплашително изричаш ти. — Пък да видим дали после и тримата няма да ви направят министър-предатели. 
Заплахата явно е много страшна, защото тримата почват да обясняват един през друг: 
— Таласъмите! 
— Те, те! Пратиха ни дипломатическа нота! 
— Искат да ни оберат! 
— Данъци! 
— Дървеняк Първи! 
— Момент! — намесваш се ти. — Какъв е тоя Дървеняк Първи? Имаше навремето един Тиквеняк Първи, обаче той отдавна е на онзи свят. 
— А пък Дървеняк е негов син — плахо обяснява министърът на разните работи. — Обявил се е за цар на таласъмите. 
— И е изградил нов замък вместо онзи, дето ти го разруши — добавя министърът на другите работи. 
— Ама под земята, та никой не го знае къде се намира — обажда се министър-предателят. 
Разперваш ръце. 
— Е, хубаво. Ами аз с какво мога дави помогна? 
— Ще ни станеш министър на външните работи! — възкликват тримата в хор. — Като предприемеш дипломатически мерки, Дървеняк ще се уплаши от теб и няма да ни граби. 
            `,
      choices: [
        {
          text: "Ако си съгласен да станеш чукундуртски министър на външните работи, мини на 102. ",
          nextPage: 102,
        },
        {
          text: "Ако откажеш, продължи на 121. ",
          nextPage: 121,
        },
      ],
    },
    32: {
      text: `
      — Сега не е моментът за обяснения! — викваш ти. — Не виждаш ли, че щом се опомни, ще ни излапа? 
И всички хуквате… накъде впрочем? 
            `,
      choices: [
        {
          text: "Напред, където би трябвало да е замъкът на таласъмите — мини на 68. ",
          nextPage: 68,
        },
        {
          text: "Към кръстопътя — продължи на 89.  ",
          nextPage: 89,
        },
      ],
    },
    33: {
      text: `
      Скоро наближавате горичката, където Бабаитко предлагаше да берете гъби. Е, набрахте ли? 
            `,
      choices: [
        {
          text: "Да — мини на 46. ",
          nextPage: 46,
        },
        {
          text: "Не — продължи на 71. ",
          nextPage: 71,
        },
      ],
    },
    34: {
      text: `
      След по-малко от минута грейналият Мишемориус обува панталоните и радостно започва да подскача из стаята.              `,
      choices: [
        {
          text: "Отбележи си, че вече нямаш вехти панталони и продължи на 128.",
          removeFromInventory: { item: "oldTrousers", quantity: 1 },
          nextPage: 128,
        },
      ],
    },
    35: {
      text: `
      — Мирни ли? — оглежда те подозрително таласъмът. — Те, всички така разправят, пък после се оказват я разбойници, я някакви други злодеи. С какво ще докажеш, че сте мирни пътници? 
                  `,
      choices: [
        {
          text: "Ако имаш лула на мира, мини на 86. ",
          requiresItem: "pipe",
          nextPage: 86,
        },
        {
          text: "В противен случай премини по свой избор на 103 или 129. ",
          nextPage: [103, 129],
        },
      ],
    },
    36: {
      text: `
      Отваряш торбата и се хващаш за главата. Бабаитко е нахвърлял вътре провизиите по най-калпавия начин: първо доматите, върху тях царевицата, сетне сапуна, цвеклото, динята и най-отгоре се мъдри тежката лула на мира. Естествено, доматите са станали на пюре, а динята е цепната. Налага се спешно да изядете похабените провизии. 
      — Край! — заявяваш ти. — Отсега нататък сам ще нося торбата. 
            `,
      choices: [
        {
          text: "Отбележи си загубата на доматите и динята, а след това премини на 138. ",
          removeFromInventory: [{ item: "tomato", quantity: 2 }, { item: "watermelon", quantity: 1 }],
          nextPage: 138,
        },
      ],
    },
    37: {
      text: `
      Както вече бе казано, лулата на мира е издълбана от цял пън. Щом грабва тежкото дърво, Бабаитко започва да раздава свирепи удари наляво и надясно. 
      — Ха така! — пъхти едрият чукундурт. — На ти на тебе по куфалницата! А на теб по кубето! Ето ти и на теб, да не речеш, че ми се свиди. 
      Пред страховитата му ярост таласъмите безславно удрят на бяг. След минута от тях няма и следа — всички са се изпокрили в тинята. 
      — Да вървим! — нареждаш ти. — И по-бързо, че току-виж се върнали с подкрепления. 
      Продължавате напред. Постепенно блатото става по-плитко и скоро излизате на отсрещния бряг. 
      Накъде сте се отправили? 
                  `,
      choices: [
        {
          text: "Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: "Към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    38: {
      text: `
      — Дай сапуна, шефе! — отчаяно се провиква Гадолини. 
      — Баш сега ли реши да се миеш? — изръмжава Бабаитко. 
      — Ти си трай! — срязва го Гадолини. — Давай сапуна, шефе, ако ти е мил животът! 
      Не разбираш какво иска да прави, но изпълняваш молбата му. И след миг проумяваш. Гениалният Гадолини трескаво почва да маже стъпалата със сапун. 
      — А сега бързо надолу! — подканва ви той, когато привършва. 
      Отново побягвате. Изведнъж горе се раздава трясък и трополене. Успех! Таласъмът е попаднал на хлъзгавите стъпала! Прилепвате се към стената и след секунди грамадното му туловище прелита покрай вас с невъобразима скорост. Сетне нейде отдолу долита нов трясък и настава тишина. 
            `,
      choices: [
        {
          text: "Продължи на 263. ",
          nextPage: 263,
        },
      ],
    },
    39: {
      text: `
      Какво пък, тук ти избираш. Щом така си решил, попадаш право в края на приключението. А краят е следният: 
      Напускаш чукундуртите и след дълъг път се прибираш в своята колиба насред гората. През следващите дни не забелязваш нищо нередно. Но около една седмица по-късно листата на дърветата започват да пожълтяват. От изворите блика странна вода — блудкава, миризлива и съвсем суха. Разбираш, че Дървеняк Първи е осъществил зловещите планове на своя баща — да унищожи цялата гора. Уви, вече е късно да сториш каквото и да било. След още една седмица дърветата са голи като през късна есен. Гледката на загиващата гора е ужасна. С болка на сърце започваш да се приготвяш за път. Тук вече не може да се живее. Ще трябва да се преселиш другаде, а мъртвата гора ще остане завинаги царство на таласъмите. 
          `,
      end: true,
    },
    40: {
      text: `
      Спирате за кратка почивка на мястото, където се сливат левият и средният път. Накъде ще продължиш сега? 
       `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 157. 
          `,
          nextPage: 157,
        },
        {
          text: `
          Обратно по средния път — продължи на 141. 
          `,
          nextPage: 141,
        },
      ],
    },
    41: {
      text: `
      — Напред, отмъстители! — провикваш се ти. — Сега ще им дадем да разберат. 
      И всички, дори плашливият Хухавел, се хвърлят в схватката. Но врагът има числено превъзходство, а освен това се бие на собствена територия. Постепенно таласъмският обръч започва да се затяга около вас. 
      И в този момент Бабаитко надава загадъчен вик: 
      — Къде е лулата на мира? 
      Имаш ли все още лула на мира? И ще я дадеш ли на Бабаитко? 
             `,
      choices: [
        {
          text: `
          Да — мини на 37.  
          `,
          requiresItem: { item: "pipe", quantity: 1 },
          nextPage: 37,
        },
        {
          text: `
          Не — продължи на 62. 
          `,
          nextPage: 62,
        },
      ],
    },
    42: {
      text: `
      Щом хапваш парченце от зелената гъба, мигновено те обзема чувство на неописуема тежест и ти рухваш пред смаяните чукундурти. Бабаитко се опитва да те повдигне, после отчаяно махва с ръка. 
      — Е, шефе, май работата приключва дотук. Как ще се бориш срещу таласъмите, като не можеш да се държиш на краката си? 
      Уви, Бабаитко е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш? 
             `,
      choices: [
        {
          text: `
          Жълта — продължи на 101.
          `,
          nextPage: 101,
        },
        {
          text: `
          Червена — попадаш на 112.
          `,
          nextPage: 112,
        },
        {
          text: `
          Синя — прехвърли се на 125.
          `,
          nextPage: 125,
        },
        {
          text: `
          Черна — отгърни на 53. 
          `,
          nextPage: 53,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    43: {
      text: `
      Докато вървите напред през гората, мракът наоколо се сгъстява. Повява се хладен ветрец, нейде между дърветата се обажда бухал. 
      — Ама и ние накъде сме тръгнали? — плахо мърмори Хухавел. — Що ли не си стояхме у дома… 
      — Я да млъкваш! — скарва му се Бабаитко. — Че ако взема… 
      — Знам — прекъсва го Хухавел. — Ще ми опалиш един по кубето. 
      — Не позна! — ухилва се Бабаитко. — По кофата! 
      — Тихо! — прошепва изведнъж Гадолини. — Виждам светлина! 
      И наистина, отпред между дърветата потрепва червеникавата светлинка на пламъци. Отправяте се натам и след малко различавате трима таласъми, седнали край малък огън. Зад тях се тъмнее широкият вход на пещера. 
      — Това трябва да е подземният замък! — шепнешком възкликва Фърчилан. — Да ги нападнем ли? 
      За разлика от друг път Бабаитко не е настроен войнствено. 
      — Ще ги нападнеш, ама като ти опалят един — възразява той. — Я го виж онзи в средата какъв е як. 
      Вярно, средният таласъм е грамаден. Щом и Бабаитко не смее да го нападне, по-добре ще е да не влизате в сражение. 
      — Остави аз да ги забаламосам, шефе — предлага Гадолини. — Такъв номер ще им врътна, че свят да им се завие. 
      — То, ако е за баламосване, и аз мога — обажда се Фърчилан. — Нека аз, шефе! 
      — Аз пък викам да ги изчакаме да заспят и тогава да се промъкнем тихичко — предлага Хухавел. 
      Чие предложение ще приемеш? 
             `,
      choices: [
        {
          text: `
          На Гадолини — мини на 2. 
          `,
          nextPage: 2,
        },
        {
          text: `
          На Фърчилан — продължи на 16.  
          `,
          nextPage: 16,
        },
        {
          text: `
          На Хухавел — прехвърли се на 60.   
          `,
          nextPage: 60,
        },
      ],
    },
    44: {
      text: `
      Лесно е да се каже, но не е чак толкова просто да се осъществи. Нямаш представа накъде да тръгнеш. Поемаш напосоки и през целия ден се луташ из гори и пущинаци. Май съвсем си се заблудил, защото местата стават все по-непознати. 
      Пада мрак и се налага да пренощуваш в набързо струпана колиба от клони. Ала този път съдбата явно не е добре настроена към теб. Малко след полунощ от небето се посипва пороен дъжд. За сън и дума не може да става. Свит в мизерното си убежище, ти зъзнеш и напразно се мъчиш да намериш място, където да не капе вода. Призори гърлото те боли и кихаш на поразия. 
             `,
      choices: [
        {
          text: `
          Настинал си. Отбележи си това и премини на 99. 
          `,
          changeCondition: { sick: true,  healthy: false },
          nextPage: 99,
        },
      ],
    },
    45: {
      text: `
      — Добре бе, шефе — въздъхва Хухавел. — Ами поне лулата на мира няма ли да ми дадеш? 
             `,
      choices: [
        {
          text: `
          Ако имаш лула на мира и се съгласиш да я дадеш на Хухавел, мини на 76. 
          `,
          requiresItem: { item: "pipe", quantity: 1 },
          nextPage: 76,
        },
        {
          text: `
          В противен случай продължи на 95. 
          `,
          nextPage: 95,
        },
      ],
    },
    46: {
      text: `
      А познаваш ли свойствата на вълшебните гъби? 
                    `,
      choices: [
        {
          text: `
          Да — мини на 220. 
          `,
          requiresItem: { item: "book", quantity: 1 },
          nextPage: 220,
        },
        {
          text: `
          Не — продължи на 59.          `,
          nextPage: 59,
        },
      ],
    },
    47: {
      text: `
      Гадолини пристъпва напред, оглежда вехториите и уверено посочва: 
      — Взимам това, това и това. 
      И той грабва три от предметите. 
      — Чакай, чакай — хваща го старчето за наметалото. — Ами какво ще ми платиш? 
      — Ще ти платя бе, човек, няма страшно! — успокоява го Гадолини. — Все ще се спазарим някак. Ама знаеш ли какво? Нещо не ми харесват тия трите стоки. Я си ги вземи, пък ми дай ето онези три. 
      Речено-сторено. Гадолини пъргаво оставя трите предмета и грабва вместо тях нови три. Сетне понечва да си тръгне. Старчето отново се вкопчва в наметалото му. 
      — Стой! Първо трябва да ми платиш! 
      — Какво да ти платя? — изненадва се Гадолини. — Нали срещу тези трите неща ти дадох онези три. Натурална размяна, значи. Пито-платено, дето се вика. 
      — Ама ти и онези не си ми платил! — отчаяно виква старчето. 
      — Че как да ти ги платя, като не съм ги взел? — възразява Гадолини. 
      — Нещо не е наред тук, така да знаеш! — сърдито заявява старчето и почва да пресмята нещо на пръсти, като си шепне тихичко. 
      Гадолини го оставя да умува и гордо се приближава към теб, за да покаже спечеленото — чифт вехти панталони, стоножка в бурканче и книжката „Вълшебните гъби по нашите земи“. 
      Пред вас старчето продължава да шепне тихичко и да се чеше с всичка сила по главата, но накрая унило махва с ръка, после се обръща към теб. 
      — Че ме измамихте, измамихте ме, ама не мога да разбера как. Нейсе. Ела да направим още една сделка, обаче тоя път нищо не давам, преди да платиш. 
             `,
             addToInventory: [{ item: "book", quantity: 1 }, {item: "centipede", quantity: 1 }, {item: "oldTrousers", quantity: 1 }],
      choices: [
        {
          text: `
          Ако искаш да търгуваш с вехтошаря, мини на 119. 
          `,
          nextPage: 119,
        },
        {
          text: `
          Ако смяташ, че е крайно време да си тръгвате, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ],
    },
    48: {
      text: `
      Налага се да употребиш целия разтворител, но само след десет минути Мишемориус е отлепен от стола и радостно подскача из стаята. 
      `,
      choices: [
        {
          text: `
          Отбележи си, че вече нямаш разтворител. Ако искаш, можеш да запазиш празното шишенце. След това премини на 128. 
          `,
          removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
          addToInventory: [{ item: "bottleEmpty", quantity: 1 }],
          nextPage: 128,
        }
      ],
    },
    49: {
      text: `
      — Гъби, глупости! — скарваш се ти. — Я да вървим напред, че кой знае още колко път ни чака. 
      — Прав е шефът — подкрепя те Фърчилан. — Няма какво да се мотаем с разни гъби. 
             `,
      choices: [
        {
          text: `
          Премини на 172.           `,
          nextPage: 172,
        },
      ],
    },
    50: {
      text: `
      — Брях! — зяпва блатният таласъм. — Не думайте! 
      — Ще думаме колкото си щем, щото е вярно — гордо отговаря Бабаитко. 
      — Ами като е тъй, бъдете ни скъпи гости за малко — радостно предлага таласъмът. — Нашият цар много ще се радва да ви види. Никога не е виждал командоси. 
              `,
      choices: [
        {
          text: `
          Ако приемеш поканата, мини на 72. 
          `,
          nextPage: 72,
        },
        {
          text: `
          Ако предпочиташ да откажеш, продължи на 93.          `,
          nextPage: 93,
        },
      ],
    },
    51: {
      text: `
      Точно по пладне ти стоиш в края на ливадата край чукундуртското село. До тебе са се свили разтреперани тримата министри, но освен тях наоколо не се мярка жива душа. Всички чукундурти са се изпокрили вдън земя. Изглежда, че не ти вярват много въпреки всички ентусиазирани уверения от тази сутрин. 
      — Идат! — възкликва министър-предателят и пъргаво се укрива зад гърба ти. 
      Другите двама незабавно го избутват настрани и заемат безопасното място. Но ти не им обръщаш внимание, защото погледът ти е прикован към горичката отвъд ливадата. Измежду дърветата един след друг започват да излизат въоръжени до зъби таласъми. Тихичко подсвирваш от изненада. Трябва да са поне стотина на брой. И цялата тази сган заплашително се задава насреща ти. 
      Вече се чудиш дали да не си плюеш на петите, когато таласъмите спират на десет крачки от теб. Предводителят им се обръща с гръб към теб, размахва дебела сопа и всички други пропяват в хор: 
      — Со-о-о-о-ол! 
      Сетне настава тишина. 
      — Каква сол бе, каква сол? — уплашено подвиква министър-предателят. — Сол ли искате да ви дадем? 
      — Това е нота, тикво зелена! — обяснява водачът на таласъмите. — Дипломатическа нота, ако искаш да знаеш. 
      — И какво означава? — пита с изтънял глас министърът на другите работи. 
      — Означава, че ако до един час не ни предадете всичките си хранителни запаси, ще ви натъпчем в миша дупка. 
      — Не ща! — провиква се министърът на разните работи. — Страх ме е от мишките! 
      — Ти мълчи! — прекъсва го неговият колега и се обръща към таласъма. — Ама чакай сега, любезни, то не може така. Ако ни вземете всичко, какво ще ядем през зимата? 
      — Трънки! — изхилва се някой от ордата таласъми. 
      — И глогинки! — добавя друг. 
      — Печени! — уточнява трети. 
      Е, нещата май тръгват от зле по-зле. И за съжаление в момента всичко зависи от теб. Какво ще направиш сега? 
             `,
      choices: [
        {
          text: `
          Ще се съгласиш да предадеш на таласъмите всички хранителни запаси — мини на 96. 
          `,
          nextPage: 96,
        },
        {
          text: `
          Ще отхвърлиш претенциите им — продължи на 114.           `,
          nextPage: 114,
        },
      ],
    },
    52: {
      text: `
      Двамата почват да си разменят през прозорчето все по-обидни реплики. Накрая надзирателят не издържа, отключва килията, нахълтва с размахана тояга… и Бабаитко го просва още с първия удар. 
      — Да бягаме! — провикваш се ти. 
      Изтичвате по къс коридор, отваряте една врата и се озовавате в нов, по-широк коридор. В едната посока той се спуска полегато към земните дълбини. От другата страна забелязваш наблизо стълбище, което води нагоре — несъмнено това е изходът. А точно срещу себе си забелязваш врата в стената на коридора. Какво ще направиш сега? 
             `,
      choices: [
        {
          text: `
          Ще провериш какво има зад вратата отсреща — мини на 225. 
          `,
          nextPage: 225,
        },
        {
          text: `
          Ще се измъкнеш по стълбището нагоре и ще се откажеш от опасното приключение — продължи на 39. 
          `,
          nextPage: 39,
        },
        {
          text: `
          Ще тръгнеш по коридора към вътрешността на подземния замък — попадаш на 30. 
          `,
          nextPage: 30,
        }
      ],
    },
    53: {
      text: `
      Само това не биваше да правиш! Щом отхапваш от черната гъба, по тялото ти пробягват ледени тръпки и след броени секунди рухваш мъртъв пред ужасените погледи на чукундуртите. Това е краят на твоето приключение. 
      Лека ти пръст, доблестни храбрецо!  
             `,
      choices: [
        {
          text: `
          Но за да не започваш цялата история отначало, върни се на 136.`,
          nextPage: 136,
        }
      ],
    },
    54: {
      text: `
      — Да бягаме! — провикваш се ти и повеждаш чукундуртите в отстъпление. 
      — А, бягат! — изревава водачът на блатните таласъми. — Дръжте експлоататорите, братя! 
      И цялата тумба се хвърля подир вас. 
      Сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
             `,
      choices: [
        {
          text: `
          Mини на 130.
          `,
          nextPage: 130,
        },
        {
          text: `
          Mини на 151.
          `,
          nextPage: 151,
        },
      ],
    },
    55: {
      text: `
      — Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още тази сутрин потеглям към новия замък на таласъмите. Искам след половин час насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия. 
      Чукундуртите изревават възторжено. 
      — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо. 
      Друг перва министър-предателя по главата. 
      — Видя ли бе? Това се казва министър, а не предател като тебе. 
       
      През следващите десетина минути настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Но когато наближава часът за събиране на доброволците, тълпата почва да оредява. Ту един, ту друг се сеща за някаква спешна работа и изчезва между колибите. Накрая оставаш съвсем сам насред селото. И тъкмо се каниш да теглиш една ругатня по адрес на чукундуртската храброст, когато към теб се задават тримата министри, придружени от четирима млади чукундурти. 
             `,
      choices: [
        {
          text: `
          Продължи на 184. 
          `,
          nextPage: 184,
        },
      ],
    },
    56: {
      text: `
      Макар че сърцето ти се свива от тревога, правиш знак на останалите да изчакат. В това време Хухавел пристъпва напред. 
      — Ще те излапам, буболечка такава! — яростно изревава змеят. — Суров ще те излапам, та ако ще да се разболея! Да ми погодиш такъв номер! 
      — Ча-ча-чакай бе, н-н-няма такава работа — заеква Хухавел. — Не разбра ли к-к-какъв номер се получи? Може и да не си огнедишащ, но ще бъдеш единственият в света картечен змей. Вече видя как става. Трябва само да си намериш отнякъде царевица — и готово! 
      Змеят зяпва от почуда. 
      — Вярно бе! Брей, имало умни хора… пардон, умни чукундурти на тоя свят. Значи картечен змей, а? Да сте живи и здрави, скъпи приятели. Хайде, вървете си със здраве. Срамота ще е да ви ям след такава услуга. 
      И вие поемате… накъде впрочем? 
             `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 81. 
          `,
          nextPage: 81,
        },
        {
          text: `
          Към кръстопътя — продължи на 108. 
          `,
          nextPage: 108,
        },
      ],
    },
    57: {
      text: `
      Отхапваш от синята гъба със страх, но този път явно си имал късмет, защото след броени секунди си възвръщаш предишните размери. 
             `,
      choices: [
        {
          text: `
          Ако искаш да продължиш експериментите, върни се на 136.           `,
          nextPage: 136,
        },
        {
          text: `
          Ако предпочиташ да не рискуваш повече, мини на 154. 
          `,
          nextPage: 154,
        },
      ],
    },
    58: {
      text: `
      Влизаш в колибата и се оглеждаш, но не виждаш никъде нито капка вода. 
      — Къде ви е течащата вода? — обръщаш се ти към министъра на разните работи. 
      Той размахва ръка нагоре. 
      — Виждаш ли я онази дупка горе на тавана? Като завали, през нея ще ти тече колкото искаш. 
      — Чукундуртска ви работа — заявяваш ти и се приготвяш за сън. 
      Уви, нощта не е твърде приятна. Малко преди полунощ започва да вали като из ведро и през дупката се изсипва истински водопад. За щастие леглото е близо до огнището. Хвърляш в огъня няколко едри цепеници, омотаваш се в парцаливите завивки и криво-ляво изкарваш до сутринта, когато дъждът спира. 
             `,
      choices: [
        {
          text: `
          Продължи на 155. 
          `,
          nextPage: 155,
        },
      ],
    },
    59: {
      text: `
      Ако си успял да се снабдиш с книгата „Вълшебните гъби по нашите земи“, можеш да се консултираш с нея.  
             `,
      choices: [
        {
          text: `
          За целта премини на 83. `,
          requiresItem: { item: "book", quantity: 1 },
          nextPage: 83,
        },
        {
          text: `
          В противен случай продължи на 104. 
          `,
          nextPage: 104,
        },
      ],
    },
    60: {
      text: `
      Не се налага да чакате дълго. Половин час по-късно таласъмите звучно хъркат край огъня и вие започвате да се промъквате към входа на пещерата. 
      Настинал ли си? 
             `,
      choices: [
        {
          text: `
          Да — мини на 189. 
          `,
          requiresCondition: { condition: "sick" },
          nextPage: 189,
        },
        {
          text: `
          Не — продължи на 254.
          `,
          requiresCondition: { condition: "healthy" },
          nextPage: 254,
        },
      ],
    },
    61: {
      text: `
      — Сега ще видите какво е бизнес! — гордо заявява Хухавел, после пристъпва към старчето и се впуска в пазарлък. 
      Резултатът от бизнеса обаче се оказва плачевен. След пет минути всичките ви хранителни запаси (включително сапунът) преминават у старчето. Остават ви само лулата на мира и патката на Хухавел. 
      В замяна Хухавел получава усуканата джаджа. 
      — И за какво ти е туй желязо? — пита Фърчилан. 
      — Ами… де да знам… — запъва се Хухавел. — Ама я го виж само какво е интересно. Едно усукано такова… 
      — Диване! — перва го по главата Гадолини. — За нищо не те бива! Слушай, шефе, дай сега и аз да опитам в бизнеса. 
      След провала на Хухавел не изпитваш особено желание да се доверяваш на когото и да било от чукундуртите. Но пък кой знае, може Гадолини да излезе по-добър търговец. 
             `,
             emptyInventory: true,
             addToInventory: [{ item: "duck", quantity: 1 },{ item: "twistedTrinket", quantity: 1 }, { item: "pipe", quantity: 1 }],
      choices: [
        {
          text: `
          Ако му разрешиш да опита нова сделка, мини на 47. 
          `,
          nextPage: 47,
        },
        {
          text: `
          Ако опиташ сам да се пазариш със старчето, продължи на 119. 
          `,
          nextPage: 119,
        },
        {
          text: `
          Ако смяташ, че е крайно време да си тръгвате, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ],
    },
    62: {
      text: `
      Твоите командоси проявяват чудеса от храброст, но битката се развива все по-зле. Още миг и ще падне заветният хълм, както е казал поетът. 
— Да бягаме! — провикваш се ти и повеждаш чукундуртите в отстъпление. 
Но сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
      `,
      choices: [
        {
          text: "130",
          nextPage: 130,
        },
        {
          text: "151.",
          nextPage: 151,
        },
      ],
    },
    63: {
      text: `
      Чудесно е, когато имаш полезен наръчник. Разгръщаш книгата и от нея узнаваш, че гъбите наистина са вълшебни. А свойствата им са следните: 
      ЖЪЛТА ГЪБА — увеличава онзи, който хапне от нея. 
      СИНЯ ГЪБА — смалява многократно консуматора си. 
      ЧЕРВЕНА ГЪБА — силно намалява теглото. 
      ЗЕЛЕНА ГЪБА — увеличава теглото. 
      ЧЕРНА ГЪБА — невероятно отровна, убива жертвата за броени минути. 
      Запомни добре тези свойства, а след това продължи на 111. 
      `,
      mushroomProperties: true,
      choices: [
        {
          text: "111",
          nextPage: 111,
        },
      ],
    },
64: {
      text: `
      Преди да му обясниш за какво служи подаръкът, таласъмът изхрупва макарона и доволно кимва. 
— М-м-м! Вкусно! Швейцарски е, нали? Хайде, наливайте си вода и изчезвайте. 
Напълваш съдинката си с вода и преминаваш на 177.
      `,
      choices: [
        {
          text: "177",
          nextPage: 177,
        },
      ],
    },
65: {
      text: `
      С отчаяно усилие разблъскваш тълпата и хукваш да бягаш, следван по петите от стотици разплакани чукундурти. За щастие гората не е далече и след няколко минути намираш убежище в нея. Един по един преследвачите изостават, докато накрая откриваш, че вече си сам. Спираш и избърсваш потта от челото си. Ама че чукундуртска история! 
      Е, сега не ти остава нищо друго, освен да се прибереш у дома. За да го сториш, премини на 44. 
      `,
      choices: [
        {
          text: "44",
          nextPage: 44,
        },
      ],
    },
    66: {
      text: `
      — Какво? — възмутено се провиква таласъмът. — Не било наша работа, а? Братя, тия агресори оскърбяват нашата таласъмска гордост! Напред! Да отмъстим за поруганата си чест! 
И блатните таласъми се устремяват към вас. 
— Да бягаме, шефе! — уплашено подвиква Хухавел. — Да се спасяваме, додето сме цели! 
— Вярно — подкрепя го Фърчилан. — Дето е казал народът, бежанова майка не плаче. 
— Да се бием! — възразява Бабаитко. — Ще видят те, като им опаля един по китарите! 
Кого ще послушаш? 
      `,
      choices: [
        {
          text: `Бабаитко — прехвърли се на 41.`,
          nextPage: 41,
        },
        {
          text: `Хухавел и Фърчилан — продължи на 130 или 151.`,
          nextPage: [130, 151],
        },
      ],
    },
    67: {
      text: `
      Щом отхапваш парченце от жълтата гъба, по цялото ти тяло пробягва непоносим сърбеж и виждаш как короните на дърветата стремително падат насреща ти. Не! Дърветата са неподвижни, но самият ти си възвръщаш предишните размери. Въздъхваш от облекчение. Този път май имаше късмет.  
      `,
      choices: [
        {
          text: `Ако искаш да продължиш експериментите, върни се на 136.`,
          nextPage: 136,
        },
        {
          text: `Ако предпочиташ да не рискуваш повече, мини на 154.`,
          nextPage: 154,
        },
      ],
    },
    68: {
      text: `
      Свирепият рев на змея зад вас е толкова добър стимул за тичане, че вие спирате чак когато тунелът остава далече назад.  
      `,
      choices: [
        {
          text: ` Продължи на 81.`,
          nextPage: 81,
        },
      ],
    },
    69: {
      text: `
      Откриваш, че тревогата ти не е била напразна. Разсеяният Фърчилан е изръсил някъде един кочан царевица. 
— Край! — сърдито заявяваш ти. — Отсега нататък сам ще си нося торбата. Не ща повече чукундуртски истории! 
      `,
      choices: [
        {
          text: `Отбележи си загубата на царевицата и премини на 138. `,
          nextPage: 138,
          removeFromInventory: { item: "corn", quantity: 1 }
        },
      ],
    },
    70: {
      text: `
      — Не е моя работа, а? — обижда се таласъмът. — Махай ми се тогава от кухнята, додето не съм повикал стражата! 
Нямаш никакво желание да се срещаш със стражата, затова побързваш да напуснеш. 
      `,
      choices: [
        {
          text: `Мини на 255. `,
          nextPage: 255,
        },
      ],
    },
    71: {
      text: `
      — Шефе, аз пак ти викам, дай да наберем малко гъби — умолително се обажда Бабаитко. — Гъбата е хубаво нещо. Полезно, значи.  
 `,
      choices: [
        {
          text: `Ако този път се съгласиш да потърсите гъби, мини на 24.`,
          nextPage: 24,
        },
        {
          text: `Ако не искаш да губиш време за подобни глупости, продължи на 49.`,
          nextPage: 49,
        },
      ],
    },
    72: {
      text: `
      Поемате след блатните таласъми и скоро излизате на малко кално островче, където върху прогнил пън седи стар, съсухрен таласъм, наметнат с мухлясала мантия. Всички останали таласъми се просват по очи. 
— О, велики царю, доведохме тези хора… — започва предводителят им. 
— Чукундурти — поправя го Хухавел. 
— … тези чукундурти, защото са славни командоси, тръгнали на тайна мисия срещу Дървеняк Първи. 
— Брях! — смайва се царят на свой ред. — Значи командоси! И то тръгнали срещу Дървеняк! Добре сте ми дошли, скъпи гости! Враговете на моя враг са мои приятели. 
— Шефе! — прошепва Хухавел. — Дай да изпушим с това старче лулата на мира. Така ще закрепим добрите отношения. 
 `,
      choices: [
        {
          text: `Ако имаш лула на мира и искаш да я използваш, мини на 79. 
          `,
          nextPage: 79,
        },
        {
          text: `В противен случай продължи на 90.`,
          nextPage: 90,
        },
      ],
    },
    73: {
      text: `
— Е? — настоява министърът на разните работи. — Съгласен ли си? Кога поемаш новия пост? 
— Когато цъфнат налъмите — дипломатично отговаряш ти. 
— Добре де, ще почакаме — въздъхва министърът на другите работи и се обръща към колегата си. — Слушай, бягай да сложиш един налъм във вода, че да знаем кога ще стане… Чакай! Какво е това? 
Откъм гората долитат революционни песни и след малко чукундуртите се завръщат, мъкнейки между себе си нещастния министър-предател. 
— Дайте пинсети! — провиква се един от тях. 
— Ама чакайте! — пищи жертвата. — Нали подадох оставка! Вече не съм министър-предател! 
Аргументът му е солиден и чукундуртите се объркват. 
— Ами сега? 
— Как да му оскубем брадата, като вече не е предател? 
— Нищо бе, първо да я оскубем, пък после ще му мислим! 
— Не! Имам идея! Дайте пак да го назначим! 
— Не ща-а-а-а! — изревава министър-предателят. — Вече подадох оставка! Ако ще ме назначавате, искам да стана министър на тайните работи! 
Наоколо избухва смях. 
— Ти ли бе? Че какво разбираш ти от тайни работи? 
— Открих една голяма тайна! — доверително съобщава клетникът. — Научих плановете на Дървеняк! 
— Грънци си научил! — обажда се някой. — Баш на теб ли ще ти кажат такава тайна? 
Но личи, че тълпата е разколебана. Министър-предателят използва момента, за да се хвърли в нозете ти. 
— Чуй ме, повелителю! Чуй каква тайна научих и вярвам, че ще ме спасиш от страшната участ!  
 `,
      choices: [
        {
          text: `Мини на 142. `,
          nextPage: 142,
        },
      ],
    },
    74: {
      text: `
      Нагазвате в блатото, но щом от тинята изникват главите на блатните таласъми, твоите спътници категорично отказват да продължат напред. 
      — Ти както щеш, шефе, обаче аз се връщам обратно — заявява Хухавел. 
      — И аз — обажда се Бабаитко. 
      Е, щом дори Бабаитко не желае да рискува, ще трябва да се съобразиш с народното мнение.  
 `,
      choices: [
        {
          text: `Продължи на 205. `,
          nextPage: 205,
        },
      ],
    },
    75: {
      text: `
  Отново заставате на кръстопътя и оглеждате познатия надпис: 
НАЛЯВО АКО ТРЪГНЕШ — 
ЗА ГЪБИ ЩЕ ХОДИШ 
 
НАДЯСНО АКО ТРЪГНЕШ — 
НИКЪДЕ НЯМА ДА СТИГНЕШ 
 
НАПРАВО АКО ТРЪГНЕШ — 
ГЛАВАТА СИ ЩЕ ЗАГУБИШ 
Накъде ще тръгнеш сега?  
 `,
      choices: [
        {
          text: `Надясно — мини на 117.`,
          nextPage: 117,
        },
        {
          text: `Направо — продължи на 88.`,
          nextPage: 88,
        },
      ],
    },
    76: {
      text: `
      Хухавел грабва една главня от огъня, сръчно запалва грамадната лула и я връчва на змея. Чудовището любопитно оглежда странното творение. 
      — Това пък какво е? 
      — Ще видиш — уверява го Хухавел. — Само смукни яко. 
      — Много яко — обажда се Гадолини. — В петите да те удари. 
      Змеят засмуква и… 
      Избери продължението — 118 или 160. 
 `,
      choices: [
        {
          text: `118`,
          nextPage: 118,
        },
        {
          text: `160`,
          nextPage: 160,
        },
      ],
    },
    77: {
      text: `
      Става ти съвестно. Горките чукундурти са останали без хранителни запаси и през зимата наистина току-виж изпукали от глад. Очевидно това беше бедата, от която искаха да ги спасиш. И ти се струва, че ако беше останал при тях, таласъмите нямаше да ги ограбят. 
— Добре — кимваш ти. — Злодеянията на Дървеняк не бива да останат безнаказани. Тръгвам с вас. Но най-напред дайте да се запознаем. 
— Казвам се Гадолини и съм майстор на гадните трикове — покланя се мрачният чукундурт. — Такъв номер мога да врътна всекиму, че свят да му се завие. 
— Аз съм Бабаитко — пристъпва до него едрият чукундурт, който стърчи с две глави над останалите. — Може и да не ме бива по гадните номера, ама когото цапардосам, свитки ще му изхвръкнат от очите. 
— То не може така — обажда се до него хилав чукундурт, гушнал под мишница проскубана бяла патка. — Насилието не решава нещата. Ум трябва, ум! Аз, драги ни предводителю, се казвам Хухавел и съм най-умният чукундурт в цялото село. 
— Затова те пратиха да пасеш патките, нали? — ехидно се обажда Гадолини. 
— Че какво? — обижда се Хухавел. — То и за тая работа ум трябва. Какво като са патки, и те душа носят… 
— Добре де, не се препирайте — прекъсваш ги ти и се обръщаш към четвъртия чукундурт, който е строен и дългокрак. — А ти, младежо, с какво можеш да се похвалиш? 
— Аз съм Фърчилан — представя се той. — С ум и сила не мога да се похваля, ама умея да бягам. И това е важно, нали така? 
— Тъй, тъй — подкрепя го Гадолини. — Като стане напечено, той пръв ще си плюе на петите. 
— Тихо! — подвикваш ти. — Значи отсега нататък ние петимата сме група командоси под кодовото название „Чукундуртски отмъстители“. Обаче сигурно не сте се сетили, че за из пътя ще ни трябват провизии. 
— Абе, то… за сещане сетихме се — промърморва Фърчилан. — Ама нали таласъмите ометоха всичко. Ето с какво разполагаме. 
И той ти показва три кочана царевица. 
Бабаитко на свой ред измъква от грамадния си джоб едно цвекло. 
— Това е свещеният чукундур — шепнешком обяснява той. — Задигнах го от селския храм. Голям грях си турих на душата, ама какво да се прави — делото иска жертви. 
Кимваш и се обръщаш към другите, но Бабаитко те хваща за рамото. 
— Чакай, има и още нещо. Я гледай тук. 
 
С тия думи той измъква от другия си джоб нещо като издълбан пън, от който стърчи кух израстък. 
— Това пък какво е? — изненадваш се ти. 
— Лулата на мира — гордо отвръща той. — Знае ли човек накъде могат да избият работите? Ако решим да водим мирни преговори, ще ни трябва нещо такова. 
Сетне той се отдръпва, за да стори място на Гадолини, който измъква изпод плаща си два зрели домата. 
И накрая Хухавел триумфално ти показва вехта торба, в която е скътал едра, напращяла диня и калъп домашен сапун. 
— И сапуна ли броите към провизиите? — изненадваш се ти. 
— Като ни засвирят коремите от глад, няма къде да се дяваме. И сапун ще жвакаме — обажда се Бабаитко. 
— Не си прави майтап с хигиената! — скарва му се Хухавел. — Без сапун закъде сме? Нали трябва да си мием ръцете преди ядене. 
— Ако има какво да ядем — ухилва се Гадолини. 
— Ама и вие сте едни чукундурти! — скарваш им се ти. — Нямате никаква организация на работата. Съберете всички запаси в торбата и един да ги носи. 
Идеята обаче поражда първите разногласия в отряд „Чукундуртски отмъстители“. Всеки от четиримата ти спътници претендира за честта да носи торбата с провизиите. 
— Ум трябва за тая работа! — заявява категорично Хухавел. — Затова аз съм най-подходящ. 
— Не се ли виждаш, че си слаботелесен, бе нещастнико? — перва го по главата Бабаитко. — Аз трябва да нося торбата, защото съм най-як. 
Гадолини и Фърчилан също излагат солидни аргументи в своя полза. Чудиш се кого да избереш за тази важна задача. Дали пък сам да не носиш торбата? Но пък от друга страна… някак не върви да се превиваш под товара, а твоите подчинени да вървят с ръце в джобовете. 
Така или иначе, трябва да избереш. Отбележи кого си назначил да носи торбата, запиши подробно всички налични запаси и продължи на 244. 
— Кой ще носи торбата?
  `,
  addToInventory: [{ item: "bag", quantity: 1 },{ item: "duck", quantity: 1 }, {item: "corn", quantity: 3 }, { item: "watermelon", quantity: 1 }, {item: "tomato", quantity: 2 }, { item: "beetroot", quantity: 1 }, {item: "pipe", quantity: 1 }, {item: "soap", quantity: 1 }],
      choices: [
            { text: "Хухавел ", nextPage: 244,  bagCarrier: "Хухавел"},
            { text: "Бабаитко", nextPage: 244,   bagCarrier: "Бабаитко"},
            { text: "Фърчилан ", nextPage: 244,  bagCarrier: "Фърчилан"},
            { text: "Гадолини ", nextPage: 244,   bagCarrier: "Гадолини"},
            { text: "Самият ти ", nextPage: 244,   bagCarrier: "самият ти"},
      ],
    },
  
    78: {
      text: `
      Фърчилан поема домата и безстрашно се отправя към огъня. Щом го зърва в полумрака, едрият таласъм надава свиреп рев: 
      — Стой! Кой? 
      — Ще видиш ти кой! — отвръща Фърчилан и замахва. 
      Със сочен плясък доматът се размазва по физиономията на таласъма. Онзи скача на крака и изревава: 
      — Дръжте негодника! 
      Но Фърчилан вече тича презглава към закрилата на дърветата. Таласъмите хукват подир него и изчезват в мрака. 
      През следващите няколко минути от гората долитат само злобни крясъци и пукот на строшени вейки. Ала внезапно Фърчилан изниква пред вас и ви махва с ръка. 
      — По-бързо! Да влизаме! Заблудих ги, обаче няма да е задълго. 
  `,
      choices: [
        {
          text: `
          Премини на 139. 
          `,
          nextPage: 139,
        },
      ],
    },
    79: {
      text: `
      По твое нареждане Бабаитко пъргаво разпалва лулата на мира и я слага пред царя на блатните таласъми. Старчето любопитно оглежда димящия пън. 
— Каква е тая чудесия, драги командоси? 
— Смукни, смукни — подканва го Гадолини. — Ама яко смукни, че да те удари чак в петите. 
Царят смуква… и с оглушителна кашлица се катурва в блатото. Наоколо избухват диви крясъци: 
— Атентат! 
— Убиха ни царя! 
— Терористи! 
— Лумпени! 
— Дръжте ги! 
— Да отмъстим за негово величество! 
Сега има само един изход — да се спасявате с бягство обратно към брега. И вие хуквате през блатото, като зарязвате лулата на мира (отбележи си тази загуба). 
Но сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
 
  `,
      choices: [
        {
          text: `
          130
          `,
          nextPage: 130,
        },
        {
          text: `
          151
          `,
          nextPage: 151,
        },
      ],
    },
    80: {
      text: `
  
  `,
      choices: [
        {
          text: `
          Премини на 105. 
          `,
          nextPage: 105,
        },
      ],
    },
    81: {
      text: `
      Пътят отново върви през гора, но дърветата стават все по-редки. Половин час след като сте напуснали тунела, виждате на една поляна край пътя голяма къща от бял камък.  
  `,
      choices: [
        {
          text: `
          Ако искаш да я посетите, мини на 120.
          `,
          nextPage: 120,
        },
        {
          text: `
          В противен случай продължи на 134. `,
          nextPage: 134,
        },
      ],
    },
    82: {
      text: `
      Щом хапваш парченце от зелената гъба, мигновено те обзема чувство на неописуема тежест и ти се изръсваш от дланта на Бабаитко. Резултатът от дребните размери и огромното тегло е печален — пробиваш земята и хлътваш в някаква къртичина, където слисаните чукундурти така и не успяват да те намерят. След дълго и безплодно търсене те поемат обратно към своето село. Уви, експериментите са завършили неуспешно — още дълги дни ще бродиш сред тревите, докато магията престане и постепенно си възвърнеш предишните размери. 
      Така или иначе твоето приключение завършва дотук.   `,
      choices: [],
      end: true,
    },
    83: {
      text: `
      Чудесно е, когато имаш полезен наръчник. Разгръщаш книгата и от нея узнаваш, че вълшебните гъби, които сте набрали, имат следните свойства: 
      ЖЪЛТА ГЪБА — увеличава онзи, който хапне от нея. 
      СИНЯ ГЪБА — смалява многократно консуматора си. 
      ЧЕРВЕНА ГЪБА — силно намалява теглото. 
      ЗЕЛЕНА ГЪБА — увеличава теглото. 
      ЧЕРНА ГЪБА — невероятно отровна, убива жертвата за броени минути. 
        `,
      choices: [
        {
          text: `
          Запомни добре тези свойства, а след това продължи на 220. 
          `,
          nextPage: 220,
        },
      ],
    },
    84: {
      text: `
      — Стига глупости! — викваш ти. — Да се спасяваме! 
      Ала вече е късно. Докато тичаш надолу, изведнъж усещаш как те сграбчват две огромни лапи. Сетне върху главата ти се стоварва тежък юмрук и губиш съзнание. 
        `,
      choices: [
        {
          text: `
          Премини на 21. 
          `,
          nextPage: 21,
        },
      ],
    },
    85: {
      text: `
      В първия момент слънчевите лъчи те заслепяват, тъй че не успяваш да видиш нищо. Но още преди да си направил и една крачка извън колибата, в ушите ти нахлува възторжен рев: 
      — УРРРРРРРРАААААААААА! 
      Разтъркваш очи и когато ги разтваряш, различаваш пред себе си парцалива тълпа от чукундурти. Вятърът развява над главите им опърпани знамена, хоругви и лозунги. Обаче, преди да разчетеш какво е написано по тях, цялата тълпа се бухва на колене. Най-отпред двама старци с чорлави бели бради възторжено протягат ръце към теб. 
      — Благодетелю наш! — възкликва единият. 
      — Спасителю! — приглася му вторият с глас, който скърца като несмазана врата. — Бащице наш! Слънце на чукундуртския небосклон! 
      — Чакайте малко! — объркано възразяваш ти. — Никакво слънце не съм, особено пък на чукундуртския небосклон. Обяснете ми как попаднах тук. 
      — Ами че ние те отвлякохме! — възторжено обяснява първият старец. 
      — Не бе, на гости те поканихме — бързо се намесва другият, като го смушква с лакът в ребрата. — Тъй де, скъп гост… слънце на чукундуртския… 
      — Кога сте ме поканили? — питаш отново ти. — Нещо не помня да съм ви виждал. 
      — Е, ама бива ли чак такива формалности между приятели? — ухилва се старият чукундурт. — Ако толкоз държиш — ето, сега те каним. Бъди ни скъп гост… един вид радост ненагледна… 
      — Не ни изоставяй! — жално се проточва глас откъм тълпата. 
      Нищо не разбираш. Поне едно обаче изглежда ясно — чукундуртите нямат лоши намерения. Е, отмъкнали са те през нощта, но какво да ги правиш — чукундуртска им работа. Въпросът е друг: ще се съгласиш ли да им бъдеш гост? 
        `,
      choices: [
        {
          text: `
          Да — мини на 133. 
          `,
          nextPage: 133,
        },
        {
          text: `
          Не — продължи на 179. 
          `,
          nextPage: 179,
        },
      ],
    },
    86: {
      text: `
      Измъкваш лулата на мира и я размахваш пред очите му. 
      — Виждаш ли го това? Как няма да сме мирни пътници, като носим лула на мира? 
      — Което си е вярно, вярно си е — признава таласъмът. — Ама все пак трябваше да ви проверим що за стока сте. Нали знаеш, проверката е висш израз на доверие. Не помня кой го беше казал, ама е бил умен човек. Е, хайде, вървете си по пътя. Напред става по-плитко. 
      И наистина, скоро започвате да излизате от блатото. Накъде сте се отправили всъщност? 
        `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 144. 
          `,
          nextPage: 144,
        },
        {
          text: `
          Към кръстопътя — продължи на 171.           `,
          nextPage: 171,
        },
      ],
    },
    87: {
      text: `
      — Видя се то, че нищо не можем да направим, ами хайде да вървим — подканва те Фърчилан. 
      — Чакай бе! — възразява Хухавел. — Не можем да го зарежем току-тъй! За науката е страдал, дето се вика. Дайте поне да му оставим провизиите, че да не умре от глад. 
      — Всичките ли? — трепва Бабаитко. 
      — Всичките! — категорично отговаря Хухавел. — Ние все ще намерим нещо за ядене, ама този клетник… 
        `,
      choices: [
        {
          text: `
          Ако си съгласен да оставите всичките си провизии на Мишемориус, мини на 135. 
          `,
          nextPage: 135,
        },{
          text: `
          Ако не искаш да го сториш, продължи на 168. 
          `,
          nextPage: 168,
        },
      ],
    },
    88: {
      text: `
      След кратко колебание посочваш напред. 
— Ама недей така, бе шефе! — жално се обажда Хухавел. — Нали видя какво пише — главите си ще загубим. 
— За пораженческа пропаганда при военно положение се полага смърт чрез обесване — сплашва го Гадолини и Хухавел млъква. 
Около половин час вървите през вековна гора, но ненадейно пътят започва да слиза надолу. След малко пред вас се появява входът на мрачен тунел. Гората наоколо е непроходимо гъста, тъй че подземието е единственият път напред. 
Влизали ли сте вече в това подземие? 
        `,
      choices: [
        {
          text: `
          Да — мини на 116.  
          `,
          nextPage: 116,
          visitedPages: 116,
        },{
          text: `
          Не — продължи на 97. 
          `,
          nextPage: 97,
        },
      ],
    },
    89: {
      text: `
      Свирепият рев на змея зад вас е толкова добър стимул за тичане, че вие не спирате додето не стигате на кръстопътя. 
        `,
      choices: [
        {
          text: `
          Продължи на 131. 
          `,
          nextPage: 131,
        },
      ],
    },
    90: {
      text: `
      — Трай си! — прошепваш ти на Хухавел и се обръщаш към царя. — Изненадвате ме, ваше величество. Как тъй Дървеняк да ви е враг? Нали сте все таласъми, една кръв, дето се вика. 
      — Да, ама ние сме ВОДНИ таласъми! — натъртва старчето. — А пък Дървеняк ненавижда водата. Впрочем, забравих, че сте чужденци. Чуйте, драги командоси, страшната тайна на Дървеняковия род. Всички в този род са прокълнати да умрат от вода. И баща му така умря — като се захвана да спира горските извори. А на Дървеняк му е предречено, че ще издъхне моментално, ако го поръси и капка вода. Затова измисли всички тия глупости със сухата вода. Ама и Мишемориус е виновен, дето му се поведе по акъла. Уж е умен чародей, пък тръгнал да другарува с Дървеняк. 
        `,
      choices: [
        {
          text: `
          Добре е да запомниш тази страшна тайна. След това премини на 115. 
          `,
          changeSecret: { show: true},
          nextPage: 115,
        },
      ],
    },
    91: {
      text: `
      Още щом влизаш в колибата, разбираш какво са имали предвид, като говореха за централно отопление — огнището се намира точно в средата. Усмихваш се, свиваш рамене и се приготвяш за сън. 
      Леглото е кораво, а завивките вехти и парцаливи, но един юнак като теб не обръща внимание на подобни дреболии. Призори се събуждаш бодър и свеж. 
        `,
      choices: [
        {
          text: `
          Мини на 155. 
          `,
          nextPage: 155,
        },
      ],
    },
    92: {
      text: `
      — Какво можеш да сториш с това килимче, жалка твар? — хили се Дървеняк и връхлита насреща ти. — Сега ще те убия собственоръчно! 
      Светкавично хвърляш дупката пред него… и царят на таласъмите пропада през пода на залата. Изглежда, че отдолу е имало подземна река, защото от дълбините долита цамбуркане, отчаян писък… а сетне настава тишина. Сбъдна се древното предсказание (за което може да си чувал, а може и да не си) — че Дървеняк ще умре от вода. 
        `,
      choices: [
        {
          text: `
          Продължи на 295. 
          `,
          nextPage: 295,
        },
      ],
    },
    93: {
      text: `
      — Ей, язък! — тюхка се таласъмът. — Веднъж и ние да видим живи командоси, пък то… Ама вие сигурно бързате, щом имате толкова важна мисия. Е, здраве да е. Вървете напред, оттук нататък става по-плитко. 
      И наистина, скоро започвате да излизате от блатото. Но накъде сте се отправили всъщност? 
        `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 144. 
          `,
          nextPage: 144,
        },{
          text: `
          Към кръстопътя — продължи на 171. 
          `,
          nextPage: 171,
        },
      ],
    },
    94: {
      text: `
      Фърчилан урежда нещата напълно по чукундуртски. Пристъпва напред, грабва нещо от купчината и хуква да бяга с мълниеносна бързина, следван от възмутените крясъци на старчето. (Когато на връщане го откриете в клисурата, ще се окаже, че е задигнал кривия макарон.) 
      — Ама вие май сте крадци! — навъсва се старчето, след като спира да крещи. 
      — Не сме! — възразява Гадолини. — Онзи негодник вече не е наш. Заклеймяваме го, значи, за морално разложение и го изключваме от редовете си. 
      — Дано, дано — промърморва старчето, после се обръща към теб. — Хайде, ела да правим търговия като хората. И вече без номера, че ако се ядосам лошо ще стане. 
      — Слушай, шефе, нека аз да опитам — прошепва ти Гадолини. — Голям съм търговец, значи! Да видиш само каква далавера ще извъртя! 
        `,
        addToInventory: [{ item: "macaron", quantity: 1 }],
      choices: [
        {
          text: `
          Ако му разрешиш да води сделката, мини на 47. 
          `,
          nextPage: 47,
        },
        {
          text: `
          Ако предпочиташ сам да търгуваш, продължи на 119. 
          `,
          nextPage: 119,
        },{
          text: `
          А ако търговията повече не те интересува, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ],
    },
    95: {
      text: `
      Хухавел свива рамене. 
      — Е, щом е така, нищо не мога да направя. 
      Лоша работа! Ако не искате да бъдете изядени, някой трябва да се справи със змея. На кого ще се довериш? 
        `,
      choices: [
        {
          text: `
          На Бабаитко — мини на 166. 
          `,
          nextPage: 118,
        },{
          text: `
          На Гадолини — попадаш на 198. 
          `,
          nextPage: 118,
        },{
          text: `
          На Фърчилан — прехвърли се на 214. 
          `,
          nextPage: 118,
        },
      ],
    },
    96: {
      text: `
      — Бащице! — отчаяно изревава министърът на разните работи, когато чува решението ти. — Недей така, бе! Нали ще изпукаме от глад! 
      — Да мълчиш, че инак ще идеш при мишките! — заплашваш го ти и той покорно млъква. 
      Отсреща старшият таласъм се обръща към своите подчинени и надава пронизителен крясък: 
      — Рота-а-а-а, миррррррно! Слушай моята команда! За разграбване на чукундуртското село — бего-о-о-ом марш! 
      И ордата таласъми се втурва напред. 
      Един час по-късно селото е разграбено до последната трошица. Таласъмите се оттеглят, прегърбени под тежестта на кошове, кошници, бохчи, денкове, вързопи, делви, дамаджани и бъчонки. Постепенно чукундуртите почват да се измъкват от скривалищата си. Питаш се какво ли ще кажат за решението ти да ги изоставиш на таласъмския произвол. Но за твоя голяма изненада всички се зъбят и плюят не срещу теб, а срещу министър-предателя. 
      — Пу! Не те е срам! 
      — И това ми било министър! 
      — Предател на националните идеали! 
      — Ренегат! 
      — Ама чакайте! — изпищява министър-предателят, понеже вижда, че става напечено. — Аз… такова… 
      — Никакво такова! 
      — Дайте да му оскубем брадата! — предлага някой. — Косъм по косъм! 
      — Да я оскубем! — единодушно изревава тълпата. — Той е виновен! 
      Хубава работа! Ще се намесиш ли, за да отървеш нещастника от неприятната съдба, която му се готви? 
        `,
      choices: [
        {
          text: `
          Да — мини на 127. 
          `,
          nextPage: 127,
        },{
          text: `
          Не — продължи на 161. 
          `,
          nextPage: 161,
        },
      ],
    },
    97: {
      text: `
      Чукундуртите боязливо протягат шии и се взират напред в мрака. 
      — Казвах ви аз — промърморва Хухавел. — Тук ще ни изгният костите. 
        `,
      choices: [
        {
          text: `
          Ако поведеш чукундуртите напред по тунела, мини на 110. 
          `,
          nextPage: 110,
        },{
          text: `
          Ако предпочиташ да се върнеш назад, попадаш на 122. 
          `,
          nextPage: 122,
        },
      ],
    },
    98: {
      text: `
      Гъбите наистина изглеждат вълшебни. По принцип това е полезна находка, но за съжаление няма как да узнаеш качествата им. Освен ако… решиш да проведеш експеримент. 
      Възможностите са две — или да използваш за опитно животно патката на Хухавел (ако все още е с вас), или да изпробваш гъбите върху себе си. Колкото до чукундуртите, те категорично отказват да хапнат и парченце. 
      И тъй, какво ще решиш? 
        `,
      choices: [
        {
          text: `
          Експеримент с патката — мини на 123. 
          `,
          requiresItem: { item: "duck", quantity: 1 },
          nextPage: 123,
        },{
          text: `
          Експеримент върху себе си — продължи на 136. 
          `,
          nextPage: 136,
        },{
          text: `
          Не искаш да рискуваш — прехвърли се на 154. 
          `,
          nextPage: 154,
        },
      ],
    },
    99: {
      text: `
      Когато се разсъмва, ти отново поемаш през пущинака и изведнъж спираш поразен. Между дърветата пред теб се мержелее… селото на чукундуртите. Май вчера цял ден си обикалял в кръг. 
      Нямаш желание да се появяваш безславно в селото. Но за твой късмет откъм колибите се задават четирима млади чукундурти. Когато наближават, ти излизаш насреща им и размахваш ръка. 
      — Добра среща! 
      — Абе, не е много добра, ама щом си рекъл… — промърморва единият от тях, дребен чукундурт с мрачна физиономия и дрипаво черно наметало. 
      — Защо? — изненадваш се ти. — Да не е станало нещо? 
      — Много неща станаха — отвръща друг чукундурт, който стиска под мишница бяла патка. — След като ти си тръгна, дойдоха таласъмите и обраха де каквото имаше за ядене в селото. 
      — И сега ще изпукаме от глад — жално се обажда най-едрият в групата. 
      — Чакай, чакай — намесва се четвъртият, мършав и дългокрак. — То това не е най-важното. Друго има. Таласъмите рекоха, че техният цар Дървеняк Първи… 
      — Какъв Дървеняк? — трепваш ти. — Да не бъркаш нещо? Имаше навремето един Тиквеняк Първи, ама той отдавна замина в небитието. 
      — Не ме прекъсвай — сопва се чукундуртът. — Дървеняк е негов син и се е обявил за цар на таласъмите. Даже е изградил нов замък, обаче под земята, та да не се открива лесно. Чакай сега, докъде бях стигнал? Видя ли как ме обърка! А, да! Дървеняк Първи си е осигурил подкрепата на великия чародей Мишемориус. А Мишемориус е изобретил страшно нещо — суха вода. Даже направил голяма машина за нейното производство и сега я монтирали в замъка на Дървеняк Първи. Щом заработела тая машина, цялата гора щяла да изсъхне. 
      Гледай ти! Значи Дървеняк е решил да осъществи зловещите планове на баща си. Пустите му таласъми — не мирясват и това си е! 
      — А вие накъде сте тръгнали? — питаш ти. 
      — Ами… такова… — смутено отговаря едрият чукундурт. — Другите в селото само се вайкат, ама ние решихме да тръгнем по дирите на таласъмите. Ще открием замъка и ще му разкажем играта на Дървеняк. Ама ха! Суха вода щял да прави, сухарът му със сухар! 
      — Слушай, защо не ни станеш командир? — въодушевено предлага онзи с патката. — Ще станем боен отряд и ще се наречем „Чукундуртски отмъстители“. 
        `,
      choices: [
        {
          text: `
          Ако се съгласиш да тръгнеш на опасния поход срещу таласъмите, мини на 77. 
          `,
          nextPage: 77,
        },{
          text: `
          Ако откажеш, продължи на 39. 
          `,
          nextPage: 39,
        },
      ],
    },
    100: {
      text: `
      Таласъмът незабавно грабва царевицата и започва да я хрупа както е сурова. 
      — Ей, много кораво бе! — мръщи се той. — Ама хайде, от мен да мине. Наливайте си вода и изчезвайте. 
        `,
      choices: [
        {
          text: `
          Напълваш съдинката си с вода и преминаваш на 177. 
          `,
          nextPage: 177,
        },
      ],
    },
    101: {
      text: `
      С храбростта на отчаянието отхапваш от жълтата гъба. Тутакси по тялото ти пробягва сърбеж… и изведнъж се увеличаваш десетократно. 
      — Ама какви ги правиш, бе шефе? — вайка се Хухавел. — И преди не можехме да те помръднем, а пък сега — хич. 
      Не ти остава друг избор, освен да продължиш с експериментите. Каква гъба ще изпробваш сега? 
        `,
      choices: [
        {
          text: `
          Червена — попадаш на 146. 
          `,
          nextPage: 146,
        },{
          text: `
          Синя — прехвърли се на 167. 
          `,
          nextPage: 167,
        },{
          text: `
          Черна — отгърни на 53. 
          `,
          nextPage: 53,
        },
      ],
    },
    102: {
      text: `
      — Е, убедихте ме — уморено казваш ти. — А сега край на празните приказки! Обяснете как стоят нещата. Нали едно време бяхте съюзници с таласъмите. Защо сега се боите от тях? 
      — Че бяхме съюзници, бяхме — признава министърът на другите работи. — Обаче като рухна техният замък, решихме да развалим съюза. 
      — И да станем честни — обажда се министър-предателят. 
      — Ти трай, предател такъв! — прекъсва го министърът на разните работи. — Туй аз щях да го кажа, честността е от моята компетенция… Станахме честни, значи, и вече не крадем. 
      — Само от време на време, колкото да не е без хич — уточнява министърът на другите работи. — И лъжем само на нечетни дати. Щото „нечетни“ звучи почти като „нечестни“. Ама иначе станахме съвсем почтени чукундурти и не вървеше да другаруваме с таласъмите. 
      — А пък сега те ни заплашват — жално се обажда министър-предателят. — Искат да им предадем всичките си хранителни запаси. 
      — И като дойде зимата, ще изпукаме от глад — проплакват в хор другите двама министри. 
      Навъсваш се. Работата става сериозна. 
      — И кога трябва да им предадете всичките си запаси? 
      — Ами че днес — бързо отговаря министърът на разните работи. — Точно по пладне. Нали затуй те открад… такова де, поканихме на гости. 
      — Обаче ти ще ни спасиш, нали? — обажда се министър-предателят с глас на професионален подмазвач. — Ти си най-великият юнак по тия земи. Потомците песни ще пеят за теб! 
      Не знаеш дали ще пеят песни за теб. Ясно е само едно: днес по пладне чукундуртите ще си имат големи неприятности. А заедно с тях и ти, след като прие да им станеш министър. 
        `,
      choices: [
        {
          text: `
          Премини на 51. 
          `,
          nextPage: 51,
        },
      ],
    },
    103: {
      text: `
      — Нямам с какво да ти докажа, добри ми таласъме — отвръщаш ти. — Имаш само честната ми дума. 
      Таласъмът се колебае още малко, после махва с ръка. 
      — Хайде, от мен да мине. Пък друг път ако имате път насам, да си носите удостоверение, че сте мирни. Надлежно подписано и подпечатано от съответните власти. Нищо де, сега си вървете по пътя. Напред става по-плитко. 
      И наистина, скоро започвате да излизате от блатото. Но накъде сте се отправили всъщност? 
        `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 144. 
          `,
          nextPage: 144,
        },{
          text: `
          Към кръстопътя — продължи на 171. 
          `,
          nextPage: 171,
        },
      ],
    },
    104: {
      text: `
      Жалко, но така и няма да узнаеш какви свойства имат вълшебните гъби. Нищо де, здраве да е… 
        `,
      choices: [
        {
          text: `
          Продължи на 220. 
          `,
          nextPage: 220,
        },
      ],
    },
    105: {
      text: `
      Тревогата ти обаче се оказва напразна. С провизиите всичко е наред.   `,
      choices: [
        {
          text: `
          Можеш спокойно да продължиш на 138.          `,
          nextPage: 138,
        },
      ],
    },
    106: {
      text: `
      Докато се колебаеш какво да направиш, върху твоя отряд се нахвърлят десетки, може би стотици таласъми и въпреки отчаяната съпротива след броени минути се озовавате в тясна и мрачна килия. 
  `,
      choices: [
        {
          text: `
          Продължи на 285.  `,
          changeCondition: { jailed: true},
          nextPage: 285,
        },
      ],
    },
    107: {
      text: `
      Отчупваш малко парченце от жълтата гъба и го поднасяш пред човката на патката. Кротката птица с удоволствие поглъща угощението… и мигновено израства до грамадни размери. 
      — Въх! — възкликва Гадолини и отскача назад. — Чудовище! 
      — Пати-пати-пати — боязливо протяга ръка напред Хухавел. — Ела при батко да те погали. 
      Патката извива глава на една страна, оглежда го внимателно и изведнъж посяга да го клъвне. С писък на ужас Хухавел хуква да бяга, сподирен от останалите чукундурти. Побягваш и ти, защото нямаш никакво желание да се превърнеш в храна за патици. 
      Когато прекратявате бягството, патката е изчезнала нейде из гората. 
      — Отиде ми горкото хайванче! — вайка се Хухавел. 
      — Я да мълчиш, че ще ти опаля един по канчето! — сопва се Бабаитко. — Хайванче! То цяла годзила… 
      — Шефе, аз спасих гъбите — обажда се Гадолини. — С риск за живота си, значи. 
      Е гъбите са налице, обаче въпросът е дали ще посмееш да ги изпробваш върху себе си. Ако поемеш този риск, мини на 136. 
      Ако предпочиташ да не го правиш, продължи на 154. 
        `,
        removeFromInventory: { item: "duck", quantity: 1 },
      choices: [
        {
          text: `
          118
          `,
          nextPage: 118,
        },
      ],
    },
    108: {
      text: `
      Изпроводени от благодарния змей, вие бодро се отправяте към кръстопътя. 
        `,
      choices: [
        {
          text: `
          Продължи на 131. 
          `,
          nextPage: 131,
        },
      ],
    },
    109: {
      text: `
      Колибата се оказва мизерна и тясна. Леглото е кораво, а завивките вехти и парцаливи, но един юнак като теб не обръща внимание на подобни дреболии. Лягаш да спиш и призори се събуждаш бодър и свеж. 
              `,
      choices: [
        {
          text: `
          Мини на 155. 
          `,
          nextPage: 155,
        },
      ],
    },
    110: {
      text: `
      Събираш кураж и повеждаш дружината си напред в мрака. Впрочем, тъмнината не е съвсем пълна — тук-там в свода на тунела са пробити отдушници и през тях проникват бледи лъчи. Бавно и предпазливо крачите по неравния под, отрупан с паднали камъни. Ала ненадейно пред вас се надига грамаден силует, който почти запълва тунела. Две огнени очи просветват в мрака и прокънтява страховит рев: 
      — Не мърдайте! Сега ще ви изям! 
      — Да бягаме, шефе! — виква Хухавел. 
      — Как тъй ще бягаме? — възразява Бабаитко. — С какво право ще ме плаши това добиче? Като му опаля един по кофата, ще види то кого ще яде! 
      Чие мнение ще послушаш? 
        `,
      choices: [
        {
          text: `
          На Хухавел — мини на 124. 
          `,
          nextPage: 124,
        },{
          text: `
          На Бабаитко — продължи на 147. 
          `,
          nextPage: 147,
        },
      ],
    },
    111: {
      text: `
      Прибираш вълшебните гъби и махваш с ръка на чукундуртите. 
      — Хайде да тръгваме, че кой знае още колко път ни чака. 
        `,
      choices: [
        {
          text: `
          Премини на 172. 
          `,
          nextPage: 172,
        },
      ],
    },
    112: {
      text: `
      Отхапваш от червената гъба със страх, но този път явно си имал късмет, защото след броени секунди си възвръщаш предишната лекота. 
        `,
      choices: [
        {
          text: `
          Ако искаш да продължиш експериментите, върни се на 136.  
          `,
          nextPage: 136,
        },{
          text: `
          Ако предпочиташ да не рискуваш повече, мини на 154.       
          `,
          nextPage: 154,
        },
      ],
    },
    113: {
      text: `
      Гадолини поема бурканчето, после подава глава от храстите и надава заплашителен вик: 
      — Предайте се! Обкръжени сте! Ако до трийсет секунди не обявите капитулация, ще ви обстрелваме с лазерно оръжие! 
      — Лъжеш! — виква в отговор едрият таласъм. 
      — Тъй ли? — озъбва се Гадолини. — Я пратете някой да види с очите си! 
      След дълго препиране таласъмите избутват към вас най-дребния. Той боязливо пристъпва напред, присвива очи и се взира в бурканчето, което Гадолини му пъхва под носа. После уплашено виква: 
      — Абе, тука нещо лази! 
      — Знаех си аз! — изпищява едрият таласъм. — Ще ни обстрелват с лазери! Бягайте да бягаме! 
      След пет секунди от таласъмите няма и следа, само откъм горския мрак долита пукотът на строшени вейки. 
      — Видяхте ли какъв номер им врътнах? — гордо се ухилва Гадолини. — Хайде сега да влизаме. 
        `,
      choices: [
        {
          text: `
          Мини на 219. 
          `,
          nextPage: 219,
        },
      ],
    },
    114: {
      text: `
      — Тихо! — решително се провикваш ти. — Тая работа няма да стане! 
      Водачът на таласъмите заплашително се изпъчва пред теб. Обзема те страх, но знаеш много добре, че не бива да отстъпваш. Трябва да ги сплашиш, иначе работите ще тръгнат зле. 
      — Ти пък кой си? — пита таласъмът. 
      Въпреки тревогата, ти намираш сили да се разсмееш. 
      — Питаш кой съм, нещастнико! Аз съм онзи, който освободи горските извори! Онзи, който победи самия Тиквеняк и разруши гнусното ви свърталище! 
      — Въх! — възкликва някой от таласъмите. 
      — Ако не се откажете незабавно от нахалните си претенции, ще ви покажа къде зимуват раците! — приключваш ти и гордо скръстваш ръце. 
      Слисаният таласъм прави крачка назад и обръща глава към подчинените си. 
      — Някой да знае къде зимуват раците? 
      — Не питай, шефе, че по-лошо ще стане! — подвиква писклив глас от задните редици. — Чини ми се, че няма да е приятно място. Я по-добре да си ходим. 
      — Млък! — яростно изревава старшият таласъм. — Тук аз заповядвам. Мирррррно! Слушай моята команда! На когото му е мила кожата — към гората бегом ма-а-а-а-арш! 
      Личи си, че таласъмите са дисциплиниран отряд. Още преди да е заглъхнал викът на командира, всички се втурват презглава към гората. Изпровождаш ги с поглед и въздъхваш от облекчение. Ала нещо ти подсказва, че събитията не са приключили. 
      И наистина. След малко от храстите се подава един таласъм. Той размахва клечка, върху която е завързана мръсна кърпа, после боязливо тръгва през ливадата. 
      — Хей, аз съм парламентьор! — подвиква таласъмът отдалече. — Нали виждате бялото знаме? 
      — На мен ми прилича на сиво, но нейсе — отвръщаш ти. — Казвай каквото имаш за казване, че ми омръзна да се разправям с таласъми. 
      — Слушай сега — намига таласъмът и леко те побутва с лакът в ребрата. — Дай да уредим далаверата, а? Ти ни пускаш да разграбим селото, а пък ние все някак ще се отблагодарим. Твоето не се губи, брато! 
      — Я да ми се губиш от очите! — ядосано възкликваш ти и вдигаш ръка. 
      Таласъмът светкавично отскача на десетина крачки и се озъбва: 
      — Тъй, а! Ще биеш парламентьор! Ние с добро, пък той… Ама ще видиш ти! Само да знаеш какво е намислил негово величество Дървеняк Първи! От тая гора и един пън няма да остане. Да те видим после какво ще правиш! 
      И понеже замахваш отново, таласъмът захвърля парцала и побягва към гората. 
      — Благодетелю наш! — изревава министърът на разните работи и се втурва да целува едната ти ръка, докато колегата му е сграбчил другата. — Ама ти наистина ги прогони! Благословена да е десницата ти! 
      — И левицата! — обажда се министърът на другите работи. 
      — И целият организъм — обобщава министър-предателят, който по липса на друго се е захванал с краката ти. 
      Скарваш им се и ги буташ настрани, но не можеш да удържиш усмивката си. Първият тур от преговорите е завършил в твоя полза. 
         `,
      choices: [
        {
          text: `
          Мини на 149.
          `,
          nextPage: 149,
        },
      ],
    },
    115: {
      text: `
      След още малко любезни приказки със стария цар ти се сбогуваш и повеждаш дружината си към отсрещния бряг. Блатото постепенно става все по-плитко и най-сетне стъпвате на твърда земя. 
        `,
      choices: [
        {
          text: `
          Ако отивате напред, където би трябвало да е замъкът на таласъмите, мини на 144. 
          `,
          nextPage: 144,
        },{
          text: `
          Ако сте се отправили обратно към кръстопътя, продължи на 171. 
          `,
          nextPage: 171,
        },
      ],
    },
    116: {
      text: `
      А какви са отношенията ви със змея? 
        `,
      choices: [
        {
          text: `
          Добри — мини на 143. 
          `,
          nextPage: 143,
        },{
          text: `
          Не твърде добри — продължи на 162. 
          `,
          nextPage: 162,
        },
      ],
    },
    117: {
      text: `
      Минавал ли си вече по този път? 
      `,
      choices: [
        {
          text: `
          Да — продължи на 152.  
          `,
          nextPage: 152,
        },{
          text: `
          Не — прехвърли се на 174. 
          `,
          nextPage: 174,
        },
      ],
    },
    118: {
      text: `
      Змеят разтваря огромната си паст и пуска облак зловонен пушек. След това с недоумение поглежда Хухавел. 
      — И какво? 
      — Как какво, как какво! — вълнува се Хухавел. — Не разбра ли какъв номер се получи? Може и да не си огнедишащ, но гледай само каква пушилка вдигаш с тая чудесия. Като я видят, всички ще бягат презглава. 
      — Вярно бе! Брей, имало умни хора… пардон, умни чукундурти на тоя свят. Да сте живи и здрави, скъпи приятели. Хайде, вървете си със здраве. Срамота ще е да ви ям след такава услуга. 
      Отбележи си, че лулата остава при змея. А след това повеждаш своята дружина… накъде впрочем? 
            `,
            removeFromInventory: { item: "pipe", quantity: 1 },
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 81. 
          `,
          nextPage: 81,
        },{
          text: `
          Към кръстопътя — продължи на 108.
          `,
          nextPage: 108,
        },
      ],
    },
    119: {
      text: `
      — Виж сега как ще уредим нещата — казва старчето. — И ти нямаш пари, и аз нямам. Обаче, за да вървят нещата, всеки ще си определи цената на стоките, пък после ще ги разменяме. 
      И след дълъг пазарлък двамата се споразумявате за следния ценоразпис: 
      ТВОИ СТОКИ: 
      ДОМАТ — 1 грош 
      КОЧАН ЦАРЕВИЦА — 2 гроша 
      ЧУКУНДУР (ЦВЕКЛО) — 3 гроша 
      САПУН — 4 гроша 
      ДИНЯ — 5 гроша 
      ЛУЛА НА МИРА — 8 гроша 
      ПАТКА (макар че Хухавел отчаяно протестира срещу нейното включване в сделката) — 12 гроша 
      СТОКИ НА СТАРЧЕТО 
      КРАТУНКА — 1 грош. 
      ОГЛЕДАЛЦЕ — 3 гроша. 
      КРИВ МАКАРОН — 2 гроша. 
      ПРЕНОСИМА ДУПКА (защото всъщност навитото килимче се оказва точно това) — 5 гроша. 
      КНИЖКА „ВЪЛШЕБНИТЕ ГЪБИ ПО НАШИТЕ ЗЕМИ“ — 2 гроша. 
      СТОНОЖКА В БУРКАНЧЕ — 1 грош. 
      ШИШЕНЦЕ С УНИВЕРСАЛЕН РАЗТВОРИТЕЛ — 2 гроша. 
      ШИШЕНЦЕ СЪС СУХА ВОДА — 2 гроша. 
      ВЕХТИ ПАНТАЛОНИ — 1 грош. 
      УСУКАНА ДЖАДЖА — 4 гроша. 
      Естествено, в зависимост от предишните събития може някои стоки да не са налице. Това знаеш най-добре самият ти. А и не е задължително да продаваш всичко, с което разполагаш — може тепърва да ти потрябва. Така или иначе, сега остава да проведеш сделката, а след като запишеш какво си придобил, ще трябва да минеш на 158, за да поведеш отряда си обратно към кръстопътя.  `,
      choices: [
        {
          text: `
          158
          `,
          nextPage: 158,
        },
      ],
    },
  
  },
};
