export const bookData = {
  pages: {
    1: {
      text: `Нещо не е наред...
        Да, нещо не е наред — усещаш го още преди да си се събудил напълно. Сякаш вместо върху познатия сламеник в горската си колиба сега лежиш някъде другаде. Но това е невъзможно, казваш си ти. Как бих могъл да се пренеса на друго място? По вълшебство ли?
  
        И отваряш очи.
        
        В следващия миг скачаш от разхвърляното легло и се оглеждаш смаяно. Този път предчувствието не те е излъгало. Наистина си попаднал другаде — в някаква непозната схлупена колиба с едно-единствено зацапано прозорче, през което едва се процеждат утринните лъчи.
        
        Що за дяволия? Как си се озовал тук?`,
      choices: [
        {
          text: "Почесваш се озадачено по тила, после излизаш от колибата и попадаш на 85. ",
          addToInventory: [{ item: "bag", quantity: 1 }, {item: "corn", quantity: 3 }, { item: "watermelon", quantity: 1 }, {item: "tomato", quantity: 2 }, { item: "beetroot", quantity: 1 }, {item: "pipe", quantity: 1 }, {item: "soap", quantity: 1 }],
          nextPage: 85,
        },
      ],
    },
    2: {
      text: `— Чакай сега да видим с какво разполагаме — промърморва Гадолини и започва да рови из торбата.`,
      choices: [
        {
          text: "Ако имаш стоножка в бурканче, мини на 113. ",
          nextPage: 113,
          requiresItem: { item: "centipede", quantity: 1 },
        },
        {
          text: "Ако имаш лула на мира, продължи на 159. ",
          nextPage: 159,
          requiresItem: { item: "pipe", quantity: 1 },
        },
        {
          text: "Ако имаш царевица, прехвърли се на 192. ",
          nextPage: 192,
          requiresItem: { item: "corn", quantity: 1 },
        },
        {
          text: "Ако нямаш нищо от изброеното, попадаш на 203. ",
          nextPage: 203,
        },
      ].filter((choice) => choice.nextPage !== null),
      moreText:
        "А ако имаш два или три от тези предмети, избери с кой си готов да се разделиш и премини на съответния епизод.",
    },
    3: {
      text: `— Абе, ще ни излапат с парцалите, като не се вслушвате в гласа на разума — мърмори Хухавел и с усилие гази напред.

        А наоколо главите на блатните таласъми идват все по-близо. Внезапно един от тях отваря уста и изрича с квакащ глас:
        
        — Какви сте вие, добри хора, и по каква работа минавате през нашето блато?
        
        Какво ще му отговориш? `,
      choices: [
        { text: "Че сте търговци — мини на 20.  ", nextPage: 20 },
        { text: "Че сте мирни пътници — продължи на 35. ", nextPage: 35 },
        {
          text: "Че сте отряд командоси, тръгнали на тайна акция срещу таласъмите на Дървеняк Първи — попадаш на 50. ",
          nextPage: 50,
        },
        { text: "Че не е тяхна работа — прехвърли се на 66. ", nextPage: 66 },
      ],
    },
    4: {
      text: `— Бях огнедишащ, обаче вече не съм — въздъхва змеят. — Остарях, изнемощях… На, гледай!
        
        Той разтваря широко грамадната си паст и почва да съска като кипнал чайник, но въпреки всички усилия от гърлото му излитат само две-три облачета пушек.
        
        — А пък бях страшен звяр — тъжно клати глава змеят. — Ако ме видят сега, за смях ще стана. Затуй съм се заврял под земята — да не ми гледат срама.
        
        — Това е защото не гледаш научно на нещата! — упреква го Хухавел и се обръща към теб. — Шефе, дай една царевица!`,
      choices: [
        {
          text: "Ако имаш царевица и се съгласиш да я дадеш на Хухавел, мини на 23. ",
          requiresItem: { item: "corn", quantity: 1 },
          removeFromInventory: { item: "corn", quantity: 1 },
          nextPage: 23,
        },
        { text: "В противен случай продължи на 45. ", nextPage: 45 },
      ].filter((choice) => choice.nextPage !== null),
    },
    5: {
      text: `— Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още утре потеглям към новия замък на таласъмите. Искам в ранни зори насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия.
        
        Чукундуртите изревават възторжено.
        
        — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо.
        
        Друг перва министър-предателя по главата.
        
        — Видя ли бе? Това се казва министър, а не предател като тебе. Ако не беше той, как щяхме да разкрием плановете на Дървеняк?
        
        През целия следобед настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Привечер предлагат да те настанят като скъп гост в най-хубавата колиба. Обещават дори да ти осигурят течаща вода и централно отопление.
        
        Силно си изненадан, че в това село има такива модерни удобства, но какво ли не може да се очаква от чукундуртите. Решавай сега каква колиба ще избереш.`,
      choices: [
        {
          text: "С течаща вода и централно отопление — мини на 26. ",
          nextPage: 26,
        },
        { text: "Само с течаща вода — продължи на 58. ", nextPage: 58 },
        { text: "Само с централно отопление — попадаш на 91. ", nextPage: 91 },
        { text: "Без такива глезотии — прехвърли се на 109. ", nextPage: 109 },
      ],
    },
    6: {
      text: `Имал ли си нещастието преди малко да бъдеш ранен с вилица в ръката?`,
      choices: [
        {
          text: "Да — мини на 230. ",
          nextPage: 230,
          requiresCondition: { condition: "injuredWithFork" },
        },
        {
          text: "Не — продължи на 284. ",
          nextPage: 284,
          requiresCondition: { condition: "healthy" },
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    7: {
      text: `Минавал ли си вече по този път?`,
      choices: [
        { text: "Да — продължи на 33. ", nextPage: 33, visitedPages: 8 },
        { text: "Не — прехвърли се на 8. ", nextPage: 8 },
      ].filter((choice) => choice.nextPage !== null),
    },
    8: {
      text: `Без колебание повеждаш дружината си по лявото разклонение. Може и да са прави чукундуртите — все пак гъбената чорбица е хубаво нещо. Скоро пътят започва постепенно да завива надясно и навлиза в рядка горичка.
        
        — По такива места растат най-хубавите гъби — развълнувано обявява Бабаитко. — Пък и камъкът сигурно не лъжеше. Слушай, шефе, дай да потърсим. Тя работата, няма да избяга.`,
      choices: [
        {
          text: "Ако се съгласиш да потърсите гъби, мини на 24. ",
          nextPage: 24,
        },
        {
          text: "Ако не искаш да губиш време за подобни глупости, продължи на 49. ",
          nextPage: 49,
        },
      ],
    },
    9: {
      text: `— Аман от суха вода! — ядосва се таласъмът и запокитва шишенцето в кладенеца. — Вие подигравате ли ми се? Марш веднага оттук! Никаква вода за вас!
        
        — Дай да му опаля един, бе шефе! — моли се Бабаитко.`,
      choices: [
        { text: "Ако му разрешиш да го стори, мини на 208. ", nextPage: 208 },
        { text: "Ако се откажеш от водата и продължиш пътешествието, мини на 177. ", nextPage: 177},
      ],
    },
    10: {
      text: `О, любезний читателю! С това свое решение ти показа, че наистина в гърдите ти бие сърце на чукундурт. Не ще и дума, очаква те трудна, но славна съдба. Тепърва ще бъдеш оплюван всекидневно от целокупния чукундуртски народ. Ако издържиш на изпитанията достатъчно дълго, подир време току-виж си станал министър на простите работи. Но така или иначе това вече е съвсем друга история. Твоето приключение привършва дотук.`,
      choices: [],
      end: true,
    },
    11: {
      text: `Добре, но как да му помогнеш? Сега е моментът да провериш с какво разполагаш.`,
      choices: [
        {
          text: "Ако имаш чифт вехти панталони и искаш да ги дадеш на Мишемориус, мини на 34. ",
          nextPage: 34,
          requiresItem: "oldPants",
          removeFromInventory: { item: "oldPants", quantity: 1 },
        },
        {
          text: "Ако имаш шишенце с универсален разтворител и го използваш, за да отлепиш панталоните му от стола, продължи на 48. ",
          nextPage: 48,
          requiresItem: "bottleOfSolvent",
          removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
        },
        {
          text: "А ако нямаш нито едното, нито другото, прехвърли се на 87. ",
          nextPage: 87,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    12: {
      text: `Щом отхапваш парченце от жълтата гъба, по цялото ти тяло пробягва непоносим сърбеж и виждаш как короните на дърветата стремително падат насреща ти. Не! Дърветата са неподвижни, но самият ти си израснал невероятно, тъй че сега главата ти се подава над върхарите им.
        
        — Леле, шефе! — уплашено подвиква Фърчилан. — Какво стана? Ами че в тоя вид хич не ставаш за тайна мисия! Ще те зърнат отдалече.
        Уви, Фърчилан е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш? `,
      choices: [
        { text: "Синя — продължи на 57. ", nextPage: 57 },
        { text: "Червена — попадаш на 29. ", nextPage: 29 },
        { text: "Зелена — прехвърли се на 200. ", nextPage: 200 },
        { text: "Черна — отгърни на 53. ", nextPage: 53 },
      ],
    },


    // throw dice ???
    13: {
      text: `— Хвърляй царевицата, шефе! — отчаяно се провиква Гадолини.
        Разбираш гениалната му идея и незабавно хвърляш царевицата на стъпалата, сетне продължаваш да бягаш надолу.
        Колко кочана царевица си хвърлил? `,
      choices: [
        {
          text: "Един — мини по свой избор на 217, 227 или 242.",
          nextPage: [217, 227, 242],
          requiresItem: { item: "corn", quantity: 1 },
          removeFromInventory: { item: "corn", quantity: 1 },
        },
        {
          text: "Два — продължи на 206 или 259.",
          nextPage: [206, 259],
          requiresItem: { item: "corn", quantity: 2 },
          removeFromInventory: { item: "corn", quantity: 2 },
        },
        {
          text: "Три — прехвърли се на 250.",
          nextPage: 250,
          requiresItem: { item: "corn", quantity: 3 },
          removeFromInventory: { item: "corn", quantity: 3 },
        },
      ].filter((choice) => choice.nextPage !== null),
    },






    14: {
      text: `Не, това блато никак не ти се нрави. Повеждаш обратно дружината си и един час по-късно наближавате… всъщност какво наближавате?`,
      choices: [
        { text: "Кръстопътя — мини на 75.", nextPage: 75 },
        { text: "Сливането на левия и средния път — продължи на 40.", nextPage: 40 },
      ],
    },
    15: {
      text: `Щом отваряш торбата, отвътре добродушно те поглежда патката на Хухавел.

        — Къш, птицо проклета! — крясваш ти, после се обръщаш към чукундуртите и свирепо питаш: — Какво търси тук това животно?

        — Не е животно, а птица, сам го каза преди малко — поправя те Хухавел. — Турнах я вътре, щото иначе е много неудобно. Нали разбираш, шефе, патката под мишница и торбата на другото рамо. Хич не върви, значи.

        Да, но се оказва, че патката не разбира от дисциплина. Изкълвала е двата домата и тъкмо се готви да начене царевицата.

        — И най-умният чукундурт пак си остава чукундурт — въздъхваш ти. — Стига толкова! Отсега нататък аз ще нося торбата.`,
      choices: [
        {
          text: "Отбележи си загубата на двата домата и премини на 138.",
          nextPage: 138,
          removeFromInventory: { item: "tomato", quantity: 2 },
        },
      ],
    },
    16: {
      text: `— Чакай сега да видим с какво разполагаме — промърморва Фърчилан и започва да рови из торбата.`,
      choices: [
        {
          text: "Ако имаш домат, мини на 78.",
          nextPage: 78,
          requiresItem: { item: "tomato", quantity: 1 },
          removeFromInventory: { item: "tomato", quantity: 1 },
        },
        {
          text: "Ако имаш диня, продължи на 126.",
          nextPage: 126,
          requiresItem: { item: "watermelon", quantity: 1 },
          removeFromInventory: { item: "watermelon", quantity: 1 },
        },
        {
          text: "Ако нямаш нищо от изброеното, попадаш на 203.",
          nextPage: 203,
        },
      ],
      moreText:
        "А ако имаш и двете, избери с кое си готов да се разделиш и премини на съответния епизод.",
    },
    17: {
      text: `Щом отхапваш от синята гъба, мигновено те побиват ледени тръпки и сякаш стремително пропадаш надолу. Не! Просто се смаляваш! За броени секунди изчезваш сред тревата.

        След упорито ровене чукундуртите най-сетне те откриват. Бабаитко те поема върху дланта си и укоризнено поклаща глава.

        — Е, каква стана тя, шефе? Май мисията отива към провал, щото в тоя вид не ми е ясно как ще се биеш с таласъмите.

        Уви, Бабаитко е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш?`,
      choices: [
        { text: "Жълта — продължи на 67.", nextPage: 67 },
        { text: "Червена — попадаш на 29.", nextPage: 29 },
        { text: "Зелена — прехвърли се на 82.", nextPage: 82 },
        { text: "Черна — отгърни на 53.", nextPage: 53 },
      ],
    },
    18: {
      text: `След доста усилия импровизираната манерка е готова.`,
      choices: [
        {
          text: "Отбележи си, че нямаш вече диня и премини на 194.",
          nextPage: 194,
          removeFromInventory: { item: "watermelon", quantity: 1 },
        },
      ],
    },
    19: {
      text: `Щом те виждат отново в колибата, министрите моментално падат на колене и започват да блъскат чела в земята.

        — Върна се, великодушни наш благодетелю!

        — Спасителю!

        — Бащице!

        — Значи ще станеш министър на външните работи, нали!`,
      choices: [{ text: "Продължи на 102.", nextPage: 102 }],
    },
    20: {
      text: `— Еха-а-а-а, търговци! — възторжено се провиква таласъмът. — Грабители на народа значи! Кърлежи! Кръвопийци! Напред, братя таласъми! Да ограбим награбеното от народа!

        И блатните таласъми се устремяват към вас. Предводителят им спира на няколко крачки от вас и пита:

        — Е, ще предадете ли доброволно цялото си имущество, или да ви принудим със сила?`,
      choices: [
        {
          text: "— Аз викам да им го дадем, шефе — обажда се Хухавел.",
          nextPage: 28,
        },
        { text: "— Не, да се бием — възразява Бабаитко.", nextPage: 41 },
        { text: "— По-добре да бягаме — предлага Фърчилан.", nextPage: 54 },
      ],
    },
    21: {
      text: `Когато се свестяваш, лежиш в тясна килия, а около теб седят унило четиримата чукундурти.`,
      choices: [
        {
          text: "Попадал ли си вече в затвора?",
          nextPage: 285,
          requiresCondition: "jailed",
        },
        { text: "Не — продължи на 132.", nextPage: 132 },
      ],
    },
    22: {
      text: `Бабаитко гордо се изпъчва и пристъпва към вехтошаря.
      
          — Слушай сега, старче. Обмислих нещата и гледай сега как ще уредим сделката. Ти, значи, ми даваш всичките тези вехтории.
      
          Настава тишина. Старчето изчаква малко, после пита:
      
          — А на мен каква ще ми е ползата?
      
          Бабаитко свива едрия си юмрук и го поднася към носа му.
      
          — Ползата ще ти е в това, че няма да те опердаша. Разбра ли?
      
          — О, такава ли била работата? — усмихва се старчето. — Ами тъй кажи, бе човек! Заповядай, заповядай! Чакай само да ти постеля това килимче, че да не стъпваш по прашната земя.
      
          И без да се бави, вехтошарят пъргаво разпъва пред себе си килимчето — кръгло и абсолютно черно. Бабаитко ви хвърля през рамо победоносен поглед, после пристъпва напред… и с ужасен писък пропада в земята.
      
          Няколко секунди стоиш вкаменен от изумление. Сетне осъзнаваш — това не е никакво килимче, а преносима дупка.
      
          — Помо-о-о-ощ! — долита от земните недра отчаяният рев на Бабаитко. — Измъкнете ме оттук!
      
          — Като много знаеш да се репчиш, там ще стоиш — подвиква отгоре старчето. — Ей сега пак ще навия дупката и ще си останеш завинаги под земята.
      
          С много молби и увещания най-сетне успявате да се споразумеете — срещу два кочана царевица старчето ви разрешава да измъкнете Бабаитко. Щом излиза отново на бял свят, едрият чукундурт се отдръпва засрамено настрани.
      
          Отбележи си загубата на двата кочана царевица и избери на кого ще повериш да води сделката.
      `,
      choices: [
        { text: "Гадолини — продължи на 47.", nextPage: 47 },
        { text: "Хухавел — попадаш на 61.", nextPage: 61 },
        { text: "Фърчилан — прехвърли се на 94.", nextPage: 94 },
        { text: "Сам ще водиш сделката — отгърни на 119.", nextPage: 119 },
      ],
    },
    23: {
      text: `— Слушай сега — почва да обяснява Хухавел. — Можеш ли да лапнеш малко жарава от огъня?
      
          — Мога, как да не мога — кимва змеят и за доказателство налапва половината жарава.
      
          — Ха сега лапни и това — подава му царевицата Хухавел. — И чакай да видиш какво ще стане.
      
          В течение на една минута не се случва нищо. Сетне, по всички закони на науката, царевицата се превръща в пуканки с оглушителен трясък. Ошашавен, змеят отскача настрани и почва да клати глава като куче, лапнало пчела.
      
          — Сега е моментът! — провиква се Фърчилан. — Да бягаме!
      
          — Чакайте! — протестира Хухавел. — Недейте да бягате! Това е недоразумение. Всичко ще обясня.
      
          Кого ще послушаш?
`,
      choices: [
        { text: "Фърчилан — мини на 32.", nextPage: 32 },
        { text: "Хухавел — продължи на 56.", nextPage: 56 },
      ],
    },
    24: {
      text: `
          Или все пак камъкът ви е излъгал, или просто от вас не стават гъбари. След дълго лутане из гората най-сетне откривате само няколко гъби. При това странни — едри и шарени. Всяка в различен цвят — жълта, синя, зелена, червена и черна. 
          Бабаитко боязливо оглежда чудноватите гъби и прошепва: 
          — Не ми харесва тая работа, шефе. Гъбите май са вълшебни. 
          — Абе, стига си говорил глупости! — прекъсва го Фърчилан. — Дай сега бързичко да си ги опечем. 
          — И като станеш после на жаба, ще видиш едни гъби — мрачно заявява Гадолини. — Вие както щете, ама аз вълшебни гъби не ям. 
          Гадолини определено е прав. Дори и да не са вълшебни, гъбите може да са отровни. Затова категорично забраняваш всякакво ядене. 
          Имаш ли книжката „Вълшебните гъби по нашите земи“? 
          `,
      choices: [
        { text: "Да — мини на 63. ", nextPage: 63 },
        { text: "Не — продължи на 98. ", nextPage: 98 },
      ],
    },
    25: {
      text: `
            Когато огледалцето му казва, че е най-красив на земята, таласъмът изпада във възторг. Без повече да ви обръща внимание, той се отдръпва настрани с безценната придобивка.  
            `,
      choices: [
        {
          text: "Напълваш съдинката си с вода и преминаваш на 177. ",
          // addToInventory: каква съдинка от диня, от кратуна, шише?
          nextPage: 177,
        },
      ],
    },
    26: {
      text: `
            Още щом влизаш в колибата, разбираш какво са имали предвид, като говореха за централно отопление — огнището се намира точно в средата. Обаче колкото и да се оглеждаш, не виждаш никъде нито капка вода. 
— Къде ви е течащата вода? — обръщаш се ти към министъра на разните работи. 
Той размахва ръка нагоре. 
— Виждаш ли я онази дупка горе на тавана? Като завали, през нея ще ти тече колкото искаш. 
— Чукундуртска ви работа — заявяваш ти и се приготвяш за сън. 
Уви, нощта не е твърде приятна. Малко преди полунощ започва да вали като из ведро, а проклетата дупка се намира точно над огнището. Естествено, огънят изгасва и ти чак до сутринта зъзнеш, омотан като пашкул в парцаливите завивки. Когато се развиделява, дъждът спира, но злото вече е сторено — гърлото те боли и кихаш на поразия.
            `,
      choices: [
        {
          text: " Отбележи си, че си настинал и премини на 155.  ",
          nextPage: 155,
        },
      ],
    },
    27: {
      text: `
      — Я, пак идат нашите приятели! — радостно ви посрещат блатните таласъми. — Ама вие какво така само обикаляте насам-натам? 
      — Тя, работата на командосите, не е лесна — гордо заявява Бабаитко. 
      И вие спокойно прекосявате блатото. В коя посока отивате? 
            `,
      choices: [
        {
          text: " Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: " Обратно към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    28: {
      text: `
      Няма как, предаваш на старшия таласъм всичките си придобивки. 
— Ехе-е-е-е! — радостно възкликва той. — Я гледай колко богатства са натрупали експлоататорите на трудовия народ! А сега да ми се махате от главата! Вървете напред, оттук нататък става по-плитко. 
И наистина, скоро започвате да излизате от блатото. 
В коя посока вървите? 
            `,
      choices: [
        {
          text: " Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: " Обратно към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    29: {
      text: `
      Щом отхапваш от червената гъба, за миг ти се завива свят, обзема те чувство на неописуема лекота… и после виждаш как чукундуртите стремително се отдалечават надолу. Но всъщност самият ти летиш нагоре в небето, където лекият ветрец те подема и те отнася надалеч. Уви, експериментите са завършили неуспешно — още дълги дни ще се носиш из облаците, докато магията престане и постепенно се спуснеш на земята. 
Така или иначе твоето приключение завършва дотук. 
            `,
      choices: [],
      end: true
    },
    30: {
      text: `
      Продължавате напред по коридора и след малко се озовавате в огромно подземие, пълно с бъчви. Наоколо се носи тежкият дъх на вино. 
— Винце, шефе, винце! — развълнувано възкликва Бабаитко. — Дай да си пийнем малко! 
— За кураж — подкрепя го Фърчилан. 
— И блясък в очите — допълва Хухавел. 
Поглеждаш ги строго. 
— Никакво пиянство не разрешавам при изпълнение на служебните задължения! 
— Е-е-е, що си такъв, бе шефе? — въздъхва Гадолини. — Ние само по мъничко. Обещавам ти да пием с мярка. 
            `,
      choices: [
        {
          text: "Ако разрешиш на чукундуртите да пийнат с мярка, мини на 253. ",
          nextPage: 253,
        },
        {
          text: "Ако забраниш категорично, продължи на 261. ",
          nextPage: 261,
        },
      ],
    },
    31: {
      text: `
      — Хубаво де, стига сте хленчили! — викваш ти с цяло гърло, за да надвикаш плача на уплашените чукундурти. — Ама обяснете все пак… 
— Министрите ще ти обяснят! — провиква се тълпата и с възторжени възгласи те грабва на ръце. 
Преди да се опомниш, вече седиш в някаква колиба, а насреща ти са застанали в почтителни пози двамата белобради чукундурти. Зад тях смутено се свива трети — по-дрипав и по-мръсен от всички останали. 
— Кои сте вие? — питаш ти с леко нетърпение. — Ще ми обясни ли най-сетне някой какво става? 
— О, спасителю наш, аз съм министърът на разните работи — отговаря първият старец. 
— А пък аз съм министърът на другите работи — покланя се до земята вторият, при което неволно си застъпва брадата и се захлупва по нос. 
Тъй като третият гузно мълчи, ти отново питаш: 
— Ами онзи зад вас? 
— А, остави го — небрежно махва с ръка министърът на разните работи. — Той е министър-предател. 
— Да не искаш да кажеш „министър-председател“? 
— А, не, точно министър-предател — обажда се министърът на другите работи, който вече е успял да се изправи. 
— Че за какво ви е министър-предател? — изненадваш се ти. 
— О, много е важен, благодетелю! — обяснява министърът на разните работи. — Тъй и тъй нещата не вървят. Ако си нямаме министър-предател, по кого ще плюе народът? 
— Е, ваша си работа — свиваш рамене ти. — А сега кой ще ми обясни от какво трябва да ви спасявам. 
— Обяснявай ти — обръща се към колегата си министърът на другите работи. — Обясненията спадат към разните работи. 
— А, не, ти обяснявай! — сопва се онзи. — Обясненията са към другите работи. 
— Слушайте, ако не получа незабавно обяснение, ставам и си тръгвам — заплашително изричаш ти. — Пък да видим дали после и тримата няма да ви направят министър-предатели. 
Заплахата явно е много страшна, защото тримата почват да обясняват един през друг: 
— Таласъмите! 
— Те, те! Пратиха ни дипломатическа нота! 
— Искат да ни оберат! 
— Данъци! 
— Дървеняк Първи! 
— Момент! — намесваш се ти. — Какъв е тоя Дървеняк Първи? Имаше навремето един Тиквеняк Първи, обаче той отдавна е на онзи свят. 
— А пък Дървеняк е негов син — плахо обяснява министърът на разните работи. — Обявил се е за цар на таласъмите. 
— И е изградил нов замък вместо онзи, дето ти го разруши — добавя министърът на другите работи. 
— Ама под земята, та никой не го знае къде се намира — обажда се министър-предателят. 
Разперваш ръце. 
— Е, хубаво. Ами аз с какво мога дави помогна? 
— Ще ни станеш министър на външните работи! — възкликват тримата в хор. — Като предприемеш дипломатически мерки, Дървеняк ще се уплаши от теб и няма да ни граби. 
            `,
      choices: [
        {
          text: "Ако си съгласен да станеш чукундуртски министър на външните работи, мини на 102. ",
          nextPage: 102,
        },
        {
          text: "Ако откажеш, продължи на 121. ",
          nextPage: 121,
        },
      ],
    },
    32: {
      text: `
      — Сега не е моментът за обяснения! — викваш ти. — Не виждаш ли, че щом се опомни, ще ни излапа? 
И всички хуквате… накъде впрочем? 
            `,
      choices: [
        {
          text: "Напред, където би трябвало да е замъкът на таласъмите — мини на 68. ",
          nextPage: 68,
        },
        {
          text: "Към кръстопътя — продължи на 89.  ",
          nextPage: 89,
        },
      ],
    },
    33: {
      text: `
      Скоро наближавате горичката, където Бабаитко предлагаше да берете гъби. Е, набрахте ли? 
            `,
      choices: [
        {
          text: "Да — мини на 46. ",
          nextPage: 46,
        },
        {
          text: "Не — продължи на 71. ",
          nextPage: 71,
        },
      ],
    },
    34: {
      text: `
      След по-малко от минута грейналият Мишемориус обува панталоните и радостно започва да подскача из стаята.              `,
      choices: [
        {
          text: "Отбележи си, че вече нямаш вехти панталони и продължи на 128.",
          removeFromInventory: { item: "oldPants", quantity: 1 },
          nextPage: 128,
        },
      ],
    },
    35: {
      text: `
      — Мирни ли? — оглежда те подозрително таласъмът. — Те, всички така разправят, пък после се оказват я разбойници, я някакви други злодеи. С какво ще докажеш, че сте мирни пътници? 
                  `,
      choices: [
        {
          text: "Ако имаш лула на мира, мини на 86. ",
          requiresItem: "pipe",
          nextPage: 86,
        },
        {
          text: "В противен случай премини по свой избор на 103 или 129. ",
          nextPage: [103, 129],
        },
      ],
    },
    36: {
      text: `
      Отваряш торбата и се хващаш за главата. Бабаитко е нахвърлял вътре провизиите по най-калпавия начин: първо доматите, върху тях царевицата, сетне сапуна, цвеклото, динята и най-отгоре се мъдри тежката лула на мира. Естествено, доматите са станали на пюре, а динята е цепната. Налага се спешно да изядете похабените провизии. 
      — Край! — заявяваш ти. — Отсега нататък сам ще нося торбата. 
            `,
      choices: [
        {
          text: "Отбележи си загубата на доматите и динята, а след това премини на 138. ",
          removeFromInventory: [{ item: "tomato", quantity: 2 }, { item: "watermelon", quantity: 1 }],
          nextPage: 138,
        },
      ],
    },
    37: {
      text: `
      Както вече бе казано, лулата на мира е издълбана от цял пън. Щом грабва тежкото дърво, Бабаитко започва да раздава свирепи удари наляво и надясно. 
      — Ха така! — пъхти едрият чукундурт. — На ти на тебе по куфалницата! А на теб по кубето! Ето ти и на теб, да не речеш, че ми се свиди. 
      Пред страховитата му ярост таласъмите безславно удрят на бяг. След минута от тях няма и следа — всички са се изпокрили в тинята. 
      — Да вървим! — нареждаш ти. — И по-бързо, че току-виж се върнали с подкрепления. 
      Продължавате напред. Постепенно блатото става по-плитко и скоро излизате на отсрещния бряг. 
      Накъде сте се отправили? 
                  `,
      choices: [
        {
          text: "Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: "Към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    38: {
      text: `
      — Дай сапуна, шефе! — отчаяно се провиква Гадолини. 
      — Баш сега ли реши да се миеш? — изръмжава Бабаитко. 
      — Ти си трай! — срязва го Гадолини. — Давай сапуна, шефе, ако ти е мил животът! 
      Не разбираш какво иска да прави, но изпълняваш молбата му. И след миг проумяваш. Гениалният Гадолини трескаво почва да маже стъпалата със сапун. 
      — А сега бързо надолу! — подканва ви той, когато привършва. 
      Отново побягвате. Изведнъж горе се раздава трясък и трополене. Успех! Таласъмът е попаднал на хлъзгавите стъпала! Прилепвате се към стената и след секунди грамадното му туловище прелита покрай вас с невъобразима скорост. Сетне нейде отдолу долита нов трясък и настава тишина. 
            `,
      choices: [
        {
          text: "Продължи на 263. ",
          nextPage: 263,
        },
      ],
    },
    39: {
      text: `
      Какво пък, тук ти избираш. Щом така си решил, попадаш право в края на приключението. А краят е следният: 
      Напускаш чукундуртите и след дълъг път се прибираш в своята колиба насред гората. През следващите дни не забелязваш нищо нередно. Но около една седмица по-късно листата на дърветата започват да пожълтяват. От изворите блика странна вода — блудкава, миризлива и съвсем суха. Разбираш, че Дървеняк Първи е осъществил зловещите планове на своя баща — да унищожи цялата гора. Уви, вече е късно да сториш каквото и да било. След още една седмица дърветата са голи като през късна есен. Гледката на загиващата гора е ужасна. С болка на сърце започваш да се приготвяш за път. Тук вече не може да се живее. Ще трябва да се преселиш другаде, а мъртвата гора ще остане завинаги царство на таласъмите. 
          `,
      end: true,
    },
    40: {
      text: `
      Спирате за кратка почивка на мястото, където се сливат левият и средният път. Накъде ще продължиш сега? 
       `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 157. 
          `,
          nextPage: 157,
        },
        {
          text: `
          Обратно по средния път — продължи на 141. 
          `,
          nextPage: 141,
        },
      ],
    },
    41: {
      text: `
      — Напред, отмъстители! — провикваш се ти. — Сега ще им дадем да разберат. 
      И всички, дори плашливият Хухавел, се хвърлят в схватката. Но врагът има числено превъзходство, а освен това се бие на собствена територия. Постепенно таласъмският обръч започва да се затяга около вас. 
      И в този момент Бабаитко надава загадъчен вик: 
      — Къде е лулата на мира? 
      Имаш ли все още лула на мира? И ще я дадеш ли на Бабаитко? 
             `,
      choices: [
        {
          text: `
          Да — мини на 37.  
          `,
          requiresItem: { item: "pipe", quantity: 1 },
          nextPage: 37,
        },
        {
          text: `
          Не — продължи на 62. 
          `,
          nextPage: 62,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    42: {
      text: `
      Щом хапваш парченце от зелената гъба, мигновено те обзема чувство на неописуема тежест и ти рухваш пред смаяните чукундурти. Бабаитко се опитва да те повдигне, после отчаяно махва с ръка. 
      — Е, шефе, май работата приключва дотук. Как ще се бориш срещу таласъмите, като не можеш да се държиш на краката си? 
      Уви, Бабаитко е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш? 
             `,
      choices: [
        {
          text: `
          Жълта — продължи на 101.
          `,
          nextPage: 101,
        },
        {
          text: `
          Червена — попадаш на 112.
          `,
          nextPage: 112,
        },
        {
          text: `
          Синя — прехвърли се на 125.
          `,
          nextPage: 125,
        },
        {
          text: `
          Черна — отгърни на 53. 
          `,
          nextPage: 53,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    43: {
      text: `
      Докато вървите напред през гората, мракът наоколо се сгъстява. Повява се хладен ветрец, нейде между дърветата се обажда бухал. 
      — Ама и ние накъде сме тръгнали? — плахо мърмори Хухавел. — Що ли не си стояхме у дома… 
      — Я да млъкваш! — скарва му се Бабаитко. — Че ако взема… 
      — Знам — прекъсва го Хухавел. — Ще ми опалиш един по кубето. 
      — Не позна! — ухилва се Бабаитко. — По кофата! 
      — Тихо! — прошепва изведнъж Гадолини. — Виждам светлина! 
      И наистина, отпред между дърветата потрепва червеникавата светлинка на пламъци. Отправяте се натам и след малко различавате трима таласъми, седнали край малък огън. Зад тях се тъмнее широкият вход на пещера. 
      — Това трябва да е подземният замък! — шепнешком възкликва Фърчилан. — Да ги нападнем ли? 
      За разлика от друг път Бабаитко не е настроен войнствено. 
      — Ще ги нападнеш, ама като ти опалят един — възразява той. — Я го виж онзи в средата какъв е як. 
      Вярно, средният таласъм е грамаден. Щом и Бабаитко не смее да го нападне, по-добре ще е да не влизате в сражение. 
      — Остави аз да ги забаламосам, шефе — предлага Гадолини. — Такъв номер ще им врътна, че свят да им се завие. 
      — То, ако е за баламосване, и аз мога — обажда се Фърчилан. — Нека аз, шефе! 
      — Аз пък викам да ги изчакаме да заспят и тогава да се промъкнем тихичко — предлага Хухавел. 
      Чие предложение ще приемеш? 
             `,
      choices: [
        {
          text: `
          На Гадолини — мини на 2. 
          `,
          nextPage: 2,
        },
        {
          text: `
          На Фърчилан — продължи на 16.  
          `,
          nextPage: 16,
        },
        {
          text: `
          На Хухавел — прехвърли се на 60.   
          `,
          nextPage: 60,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    44: {
      text: `
      Лесно е да се каже, но не е чак толкова просто да се осъществи. Нямаш представа накъде да тръгнеш. Поемаш напосоки и през целия ден се луташ из гори и пущинаци. Май съвсем си се заблудил, защото местата стават все по-непознати. 
      Пада мрак и се налага да пренощуваш в набързо струпана колиба от клони. Ала този път съдбата явно не е добре настроена към теб. Малко след полунощ от небето се посипва пороен дъжд. За сън и дума не може да става. Свит в мизерното си убежище, ти зъзнеш и напразно се мъчиш да намериш място, където да не капе вода. Призори гърлото те боли и кихаш на поразия. 
             `,
      choices: [
        {
          text: `
          Настинал си. Отбележи си това и премини на 99. 
          `,
          changeCondition: { condition: "sick" },
          nextPage: 99,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    45: {
      text: `
      — Добре бе, шефе — въздъхва Хухавел. — Ами поне лулата на мира няма ли да ми дадеш? 
             `,
      choices: [
        {
          text: `
          Ако имаш лула на мира и се съгласиш да я дадеш на Хухавел, мини на 76. 
          `,
          requiresItem: { item: "pipe", quantity: 1 },
          nextPage: 76,
        },
        {
          text: `
          В противен случай продължи на 95. 
          `,
          nextPage: 95,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    46: {
      text: `
      А познаваш ли свойствата на вълшебните гъби? 
                    `,
      choices: [
        {
          text: `
          Да — мини на 220. 
          `,
          nextPage: 220,
        },
        {
          text: `
          Не — продължи на 59.          `,
          nextPage: 59,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    47: {
      text: `
      Гадолини пристъпва напред, оглежда вехториите и уверено посочва: 
      — Взимам това, това и това. 
      И той грабва три от предметите. 
      — Чакай, чакай — хваща го старчето за наметалото. — Ами какво ще ми платиш? 
      — Ще ти платя бе, човек, няма страшно! — успокоява го Гадолини. — Все ще се спазарим някак. Ама знаеш ли какво? Нещо не ми харесват тия трите стоки. Я си ги вземи, пък ми дай ето онези три. 
      Речено-сторено. Гадолини пъргаво оставя трите предмета и грабва вместо тях нови три. Сетне понечва да си тръгне. Старчето отново се вкопчва в наметалото му. 
      — Стой! Първо трябва да ми платиш! 
      — Какво да ти платя? — изненадва се Гадолини. — Нали срещу тези трите неща ти дадох онези три. Натурална размяна, значи. Пито-платено, дето се вика. 
      — Ама ти и онези не си ми платил! — отчаяно виква старчето. 
      — Че как да ти ги платя, като не съм ги взел? — възразява Гадолини. 
      — Нещо не е наред тук, така да знаеш! — сърдито заявява старчето и почва да пресмята нещо на пръсти, като си шепне тихичко. 
      Гадолини го оставя да умува и гордо се приближава към теб, за да покаже спечеленото — чифт вехти панталони, стоножка в бурканче и книжката „Вълшебните гъби по нашите земи“. 
      Пред вас старчето продължава да шепне тихичко и да се чеше с всичка сила по главата, но накрая унило махва с ръка, после се обръща към теб. 
      — Че ме измамихте, измамихте ме, ама не мога да разбера как. Нейсе. Ела да направим още една сделка, обаче тоя път нищо не давам, преди да платиш. 
             `,
      choices: [
        {
          text: `
          Ако искаш да търгуваш с вехтошаря, мини на 119. 
          `,
          nextPage: 119,
        },
        {
          text: `
          Ако смяташ, че е крайно време да си тръгвате, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    48: {
      text: `
      Налага се да употребиш целия разтворител, но само след десет минути Мишемориус е отлепен от стола и радостно подскача из стаята. 
      `,
      choices: [
        {
          text: `
          Отбележи си, че вече нямаш разтворител. Ако искаш, можеш да запазиш празното шишенце. След това премини на 128. 
          `,
          removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
          addToInventory: [{ item: "bottleEmpty", quantity: 1 }],
          nextPage: 128,
        }
      ].filter((choice) => choice.nextPage !== null),
    },
    49: {
      text: `
      — Гъби, глупости! — скарваш се ти. — Я да вървим напред, че кой знае още колко път ни чака. 
      — Прав е шефът — подкрепя те Фърчилан. — Няма какво да се мотаем с разни гъби. 
             `,
      choices: [
        {
          text: `
          Премини на 172.           `,
          nextPage: 172,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    50: {
      text: `
      — Брях! — зяпва блатният таласъм. — Не думайте! 
      — Ще думаме колкото си щем, щото е вярно — гордо отговаря Бабаитко. 
      — Ами като е тъй, бъдете ни скъпи гости за малко — радостно предлага таласъмът. — Нашият цар много ще се радва да ви види. Никога не е виждал командоси. 
              `,
      choices: [
        {
          text: `
          Ако приемеш поканата, мини на 72. 
          `,
          nextPage: 72,
        },
        {
          text: `
          Ако предпочиташ да откажеш, продължи на 93.          `,
          nextPage: 93,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    51: {
      text: `
      Точно по пладне ти стоиш в края на ливадата край чукундуртското село. До тебе са се свили разтреперани тримата министри, но освен тях наоколо не се мярка жива душа. Всички чукундурти са се изпокрили вдън земя. Изглежда, че не ти вярват много въпреки всички ентусиазирани уверения от тази сутрин. 
      — Идат! — възкликва министър-предателят и пъргаво се укрива зад гърба ти. 
      Другите двама незабавно го избутват настрани и заемат безопасното място. Но ти не им обръщаш внимание, защото погледът ти е прикован към горичката отвъд ливадата. Измежду дърветата един след друг започват да излизат въоръжени до зъби таласъми. Тихичко подсвирваш от изненада. Трябва да са поне стотина на брой. И цялата тази сган заплашително се задава насреща ти. 
      Вече се чудиш дали да не си плюеш на петите, когато таласъмите спират на десет крачки от теб. Предводителят им се обръща с гръб към теб, размахва дебела сопа и всички други пропяват в хор: 
      — Со-о-о-о-ол! 
      Сетне настава тишина. 
      — Каква сол бе, каква сол? — уплашено подвиква министър-предателят. — Сол ли искате да ви дадем? 
      — Това е нота, тикво зелена! — обяснява водачът на таласъмите. — Дипломатическа нота, ако искаш да знаеш. 
      — И какво означава? — пита с изтънял глас министърът на другите работи. 
      — Означава, че ако до един час не ни предадете всичките си хранителни запаси, ще ви натъпчем в миша дупка. 
      — Не ща! — провиква се министърът на разните работи. — Страх ме е от мишките! 
      — Ти мълчи! — прекъсва го неговият колега и се обръща към таласъма. — Ама чакай сега, любезни, то не може така. Ако ни вземете всичко, какво ще ядем през зимата? 
      — Трънки! — изхилва се някой от ордата таласъми. 
      — И глогинки! — добавя друг. 
      — Печени! — уточнява трети. 
      Е, нещата май тръгват от зле по-зле. И за съжаление в момента всичко зависи от теб. Какво ще направиш сега? 
             `,
      choices: [
        {
          text: `
          Ще се съгласиш да предадеш на таласъмите всички хранителни запаси — мини на 96. 
          `,
          nextPage: 96,
        },
        {
          text: `
          Ще отхвърлиш претенциите им — продължи на 114.           `,
          nextPage: 114,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    52: {
      text: `
      Двамата почват да си разменят през прозорчето все по-обидни реплики. Накрая надзирателят не издържа, отключва килията, нахълтва с размахана тояга… и Бабаитко го просва още с първия удар. 
      — Да бягаме! — провикваш се ти. 
      Изтичвате по къс коридор, отваряте една врата и се озовавате в нов, по-широк коридор. В едната посока той се спуска полегато към земните дълбини. От другата страна забелязваш наблизо стълбище, което води нагоре — несъмнено това е изходът. А точно срещу себе си забелязваш врата в стената на коридора. Какво ще направиш сега? 
             `,
      choices: [
        {
          text: `
          Ще провериш какво има зад вратата отсреща — мини на 225. 
          `,
          nextPage: 225,
        },
        {
          text: `
          Ще се измъкнеш по стълбището нагоре и ще се откажеш от опасното приключение — продължи на 39. 
          `,
          nextPage: 39,
        },
        {
          text: `
          Ще тръгнеш по коридора към вътрешността на подземния замък — попадаш на 30. 
          `,
          nextPage: 30,
        }
      ].filter((choice) => choice.nextPage !== null),
    },
    53: {
      text: `
      Само това не биваше да правиш! Щом отхапваш от черната гъба, по тялото ти пробягват ледени тръпки и след броени секунди рухваш мъртъв пред ужасените погледи на чукундуртите. Това е краят на твоето приключение. 
      Лека ти пръст, доблестни храбрецо!  
             `,
      choices: [
        {
          text: `
          Но за да не започваш цялата история отначало, върни се на 136.`,
          nextPage: 136,
        }
      ].filter((choice) => choice.nextPage !== null),
    },
    54: {
      text: `
      — Да бягаме! — провикваш се ти и повеждаш чукундуртите в отстъпление. 
      — А, бягат! — изревава водачът на блатните таласъми. — Дръжте експлоататорите, братя! 
      И цялата тумба се хвърля подир вас. 
      Сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
             `,
      choices: [
        {
          text: `
          Mини на 130.
          `,
          nextPage: 130,
        },
        {
          text: `
          Mини на 151.
          `,
          nextPage: 151,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    55: {
      text: `
      — Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още тази сутрин потеглям към новия замък на таласъмите. Искам след половин час насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия. 
      Чукундуртите изревават възторжено. 
      — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо. 
      Друг перва министър-предателя по главата. 
      — Видя ли бе? Това се казва министър, а не предател като тебе. 
       
      През следващите десетина минути настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Но когато наближава часът за събиране на доброволците, тълпата почва да оредява. Ту един, ту друг се сеща за някаква спешна работа и изчезва между колибите. Накрая оставаш съвсем сам насред селото. И тъкмо се каниш да теглиш една ругатня по адрес на чукундуртската храброст, когато към теб се задават тримата министри, придружени от четирима млади чукундурти. 
             `,
      choices: [
        {
          text: `
          Продължи на 184. 
          `,
          nextPage: 184,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    56: {
      text: `
      Макар че сърцето ти се свива от тревога, правиш знак на останалите да изчакат. В това време Хухавел пристъпва напред. 
      — Ще те излапам, буболечка такава! — яростно изревава змеят. — Суров ще те излапам, та ако ще да се разболея! Да ми погодиш такъв номер! 
      — Ча-ча-чакай бе, н-н-няма такава работа — заеква Хухавел. — Не разбра ли к-к-какъв номер се получи? Може и да не си огнедишащ, но ще бъдеш единственият в света картечен змей. Вече видя как става. Трябва само да си намериш отнякъде царевица — и готово! 
      Змеят зяпва от почуда. 
      — Вярно бе! Брей, имало умни хора… пардон, умни чукундурти на тоя свят. Значи картечен змей, а? Да сте живи и здрави, скъпи приятели. Хайде, вървете си със здраве. Срамота ще е да ви ям след такава услуга. 
      И вие поемате… накъде впрочем? 
             `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 81. 
          `,
          nextPage: 81,
        },
        {
          text: `
          Към кръстопътя — продължи на 108. 
          `,
          nextPage: 108,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    57: {
      text: `
      Отхапваш от синята гъба със страх, но този път явно си имал късмет, защото след броени секунди си възвръщаш предишните размери. 
             `,
      choices: [
        {
          text: `
          Ако искаш да продължиш експериментите, върни се на 136.           `,
          nextPage: 136,
        },
        {
          text: `
          Ако предпочиташ да не рискуваш повече, мини на 154. 
          `,
          nextPage: 154,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    58: {
      text: `
      Влизаш в колибата и се оглеждаш, но не виждаш никъде нито капка вода. 
      — Къде ви е течащата вода? — обръщаш се ти към министъра на разните работи. 
      Той размахва ръка нагоре. 
      — Виждаш ли я онази дупка горе на тавана? Като завали, през нея ще ти тече колкото искаш. 
      — Чукундуртска ви работа — заявяваш ти и се приготвяш за сън. 
      Уви, нощта не е твърде приятна. Малко преди полунощ започва да вали като из ведро и през дупката се изсипва истински водопад. За щастие леглото е близо до огнището. Хвърляш в огъня няколко едри цепеници, омотаваш се в парцаливите завивки и криво-ляво изкарваш до сутринта, когато дъждът спира. 
             `,
      choices: [
        {
          text: `
          Продължи на 155. 
          `,
          nextPage: 155,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    59: {
      text: `
      Ако си успял да се снабдиш с книгата „Вълшебните гъби по нашите земи“, можеш да се консултираш с нея.  
             `,
      choices: [
        {
          text: `
          За целта премини на 83. `,
          requiresItem: { item: "bookMushrooms", quantity: 1 },
          nextPage: 83,
        },
        {
          text: `
          В противен случай продължи на 104. 
          `,
          nextPage: 104,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    60: {
      text: `
      Не се налага да чакате дълго. Половин час по-късно таласъмите звучно хъркат край огъня и вие започвате да се промъквате към входа на пещерата. 
      Настинал ли си? 
             `,
      choices: [
        {
          text: `
          Да — мини на 189. 
          `,
          requiresCondition: { condition: "sick" },
          nextPage: 189,
        },
        {
          text: `
          Не — продължи на 254.
          `,
          requiresCondition: { condition: "healthy" },
          nextPage: 254,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    61: {
      text: `
      — Сега ще видите какво е бизнес! — гордо заявява Хухавел, после пристъпва към старчето и се впуска в пазарлък. 
      Резултатът от бизнеса обаче се оказва плачевен. След пет минути всичките ви хранителни запаси (включително сапунът) преминават у старчето. Остават ви само лулата на мира и патката на Хухавел. 
      В замяна Хухавел получава усуканата джаджа. 
      — И за какво ти е туй желязо? — пита Фърчилан. 
      — Ами… де да знам… — запъва се Хухавел. — Ама я го виж само какво е интересно. Едно усукано такова… 
      — Диване! — перва го по главата Гадолини. — За нищо не те бива! Слушай, шефе, дай сега и аз да опитам в бизнеса. 
      След провала на Хухавел не изпитваш особено желание да се доверяваш на когото и да било от чукундуртите. Но пък кой знае, може Гадолини да излезе по-добър търговец. 
             `,
             inventoryLeftovers: [{ item: "duck", quantity: 1 }, { item: "pipe", quantity: 1 }], // maybe another change in the inventory functions is needed? In choices only reqiresItem, and in main add and remove items?
      choices: [
        {
          text: `
          Ако му разрешиш да опита нова сделка, мини на 47. 
          `,
          nextPage: 47,
        },
        {
          text: `
          Ако опиташ сам да се пазариш със старчето, продължи на 119. 
          `,
          nextPage: 119,
        },
        {
          text: `
          Ако смяташ, че е крайно време да си тръгвате, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
  
  },
};
