export const bookData = {
  pages: {
    1: {
      text: `Нещо не е наред...
        Да, нещо не е наред — усещаш го още преди да си се събудил напълно. Сякаш вместо върху познатия сламеник в горската си колиба сега лежиш някъде другаде. Но това е невъзможно, казваш си ти. Как бих могъл да се пренеса на друго място? По вълшебство ли?
  
        И отваряш очи.
        
        В следващия миг скачаш от разхвърляното легло и се оглеждаш смаяно. Този път предчувствието не те е излъгало. Наистина си попаднал другаде — в някаква непозната схлупена колиба с едно-единствено зацапано прозорче, през което едва се процеждат утринните лъчи.
        
        Що за дяволия? Как си се озовал тук?`,
      choices: [
        {
          text: "Почесваш се озадачено по тила, после излизаш от колибата и попадаш на 85. ",
          nextPage: 85,
        },
      ],
    },
    2: {
      text: `— Чакай сега да видим с какво разполагаме — промърморва Гадолини и започва да рови из торбата.`,
      choices: [
        {
          text: "Ако имаш стоножка в бурканче, мини на 113. ",
          nextPage: 113,
          requiresItem: { item: "centipede", quantity: 1 },
        },
        {
          text: "Ако имаш лула на мира, продължи на 159. ",
          nextPage: 159,
          requiresItem: { item: "pipe", quantity: 1 },
        },
        {
          text: "Ако имаш царевица, прехвърли се на 192. ",
          nextPage: 192,
          requiresItem: { item: "corn", quantity: 1 },
        },
        {
          text: "Ако нямаш нищо от изброеното, попадаш на 203. ",
          nextPage: 203,
        },
      ],
      moreText:
        "А ако имаш два или три от тези предмети, избери с кой си готов да се разделиш и премини на съответния епизод.",
    },
    3: {
      text: `— Абе, ще ни излапат с парцалите, като не се вслушвате в гласа на разума — мърмори Хухавел и с усилие гази напред.

        А наоколо главите на блатните таласъми идват все по-близо. Внезапно един от тях отваря уста и изрича с квакащ глас:
        
        — Какви сте вие, добри хора, и по каква работа минавате през нашето блато?
        
        Какво ще му отговориш? `,
      choices: [
        { text: "Че сте търговци — мини на 20.  ", nextPage: 20 },
        { text: "Че сте мирни пътници — продължи на 35. ", nextPage: 35 },
        {
          text: "Че сте отряд командоси, тръгнали на тайна акция срещу таласъмите на Дървеняк Първи — попадаш на 50. ",
          nextPage: 50,
        },
        { text: "Че не е тяхна работа — прехвърли се на 66. ", nextPage: 66 },
      ],
    },
    4: {
      text: `— Бях огнедишащ, обаче вече не съм — въздъхва змеят. — Остарях, изнемощях… На, гледай!
        
        Той разтваря широко грамадната си паст и почва да съска като кипнал чайник, но въпреки всички усилия от гърлото му излитат само две-три облачета пушек.
        
        — А пък бях страшен звяр — тъжно клати глава змеят. — Ако ме видят сега, за смях ще стана. Затуй съм се заврял под земята — да не ми гледат срама.
        
        — Това е защото не гледаш научно на нещата! — упреква го Хухавел и се обръща към теб. — Шефе, дай една царевица!`,
      choices: [
        {
          text: "Ако имаш царевица и се съгласиш да я дадеш на Хухавел, мини на 23. ",
          requiresItem: { item: "corn", quantity: 1 },
          removeFromInventory: { item: "corn", quantity: 1 },
          nextPage: 23,
        },
        { text: "В противен случай продължи на 45. ", nextPage: 45 },
      ],
    },
    5: {
      text: `— Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още утре потеглям към новия замък на таласъмите. Искам в ранни зори насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия.
        
        Чукундуртите изревават възторжено.
        
        — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо.
        
        Друг перва министър-предателя по главата.
        
        — Видя ли бе? Това се казва министър, а не предател като тебе. Ако не беше той, как щяхме да разкрием плановете на Дървеняк?
        
        През целия следобед настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Привечер предлагат да те настанят като скъп гост в най-хубавата колиба. Обещават дори да ти осигурят течаща вода и централно отопление.
        
        Силно си изненадан, че в това село има такива модерни удобства, но какво ли не може да се очаква от чукундуртите. Решавай сега каква колиба ще избереш.`,
      choices: [
        {
          text: "С течаща вода и централно отопление — мини на 26. ",
          nextPage: 26,
        },
        { text: "Само с течаща вода — продължи на 58. ", nextPage: 58 },
        { text: "Само с централно отопление — попадаш на 91. ", nextPage: 91 },
        { text: "Без такива глезотии — прехвърли се на 109. ", nextPage: 109 },
      ],
    },
    6: {
      text: `Имал ли си нещастието преди малко да бъдеш ранен с вилица в ръката?`,
      choices: [
        {
          text: "Да — мини на 230. ",
          nextPage: 230,
          requiresCondition: { condition: "injuredWithFork" },
        },
        {
          text: "Не — продължи на 284. ",
          nextPage: 284,
          requiresCondition: { condition: "healthy" },
        },
      ],
    },
    7: {
      text: `Минавал ли си вече по този път?`,
      choices: [
        { text: "Да — продължи на 33. ", nextPage: 33, visitedPages: 8 },
        { text: "Не — прехвърли се на 8. ", nextPage: 8 },
      ],
    },
    8: {
      text: `Без колебание повеждаш дружината си по лявото разклонение. Може и да са прави чукундуртите — все пак гъбената чорбица е хубаво нещо. Скоро пътят започва постепенно да завива надясно и навлиза в рядка горичка.
        
        — По такива места растат най-хубавите гъби — развълнувано обявява Бабаитко. — Пък и камъкът сигурно не лъжеше. Слушай, шефе, дай да потърсим. Тя работата, няма да избяга.`,
      choices: [
        {
          text: "Ако се съгласиш да потърсите гъби, мини на 24. ",
          nextPage: 24,
        },
        {
          text: "Ако не искаш да губиш време за подобни глупости, продължи на 49. ",
          nextPage: 49,
        },
      ],
    },
    9: {
      text: `— Аман от суха вода! — ядосва се таласъмът и запокитва шишенцето в кладенеца. — Вие подигравате ли ми се? Марш веднага оттук! Никаква вода за вас!
        
        — Дай да му опаля един, бе шефе! — моли се Бабаитко.`,
      choices: [
        { text: "Ако му разрешиш да го стори, мини на 208. ", nextPage: 208 },
        { text: "Ако се откажеш от водата и продължиш пътешествието, мини на 177. ", nextPage: 177},
      ],
    },
    10: {
      text: `О, любезний читателю! С това свое решение ти показа, че наистина в гърдите ти бие сърце на чукундурт. Не ще и дума, очаква те трудна, но славна съдба. Тепърва ще бъдеш оплюван всекидневно от целокупния чукундуртски народ. Ако издържиш на изпитанията достатъчно дълго, подир време току-виж си станал министър на простите работи. Но така или иначе това вече е съвсем друга история. Твоето приключение привършва дотук.`,
      choices: [],
      end: true,
    },
    11: {
      text: `Добре, но как да му помогнеш? Сега е моментът да провериш с какво разполагаш.`,
      choices: [
        {
          text: "Ако имаш чифт вехти панталони и искаш да ги дадеш на Мишемориус, мини на 34. ",
          nextPage: 34,
          requiresItem: "oldTrousers",
          removeFromInventory: { item: "oldTrousers", quantity: 1 },
        },
        {
          text: "Ако имаш шишенце с универсален разтворител и го използваш, за да отлепиш панталоните му от стола, продължи на 48. ",
          nextPage: 48,
          requiresItem: "bottleOfSolvent",
          removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
        },
        {
          text: "А ако нямаш нито едното, нито другото, прехвърли се на 87. ",
          nextPage: 87,
        },
      ],
    },
    12: {
      text: `Щом отхапваш парченце от жълтата гъба, по цялото ти тяло пробягва непоносим сърбеж и виждаш как короните на дърветата стремително падат насреща ти. Не! Дърветата са неподвижни, но самият ти си израснал невероятно, тъй че сега главата ти се подава над върхарите им.
        
        — Леле, шефе! — уплашено подвиква Фърчилан. — Какво стана? Ами че в тоя вид хич не ставаш за тайна мисия! Ще те зърнат отдалече.
        Уви, Фърчилан е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш? `,
      choices: [
        { text: "Синя — продължи на 57. ", nextPage: 57 },
        { text: "Червена — попадаш на 29. ", nextPage: 29 },
        { text: "Зелена — прехвърли се на 200. ", nextPage: 200 },
        { text: "Черна — отгърни на 53. ", nextPage: 53 },
      ],
    },
    13: {
      text: `— Хвърляй царевицата, шефе! — отчаяно се провиква Гадолини.
        Разбираш гениалната му идея и незабавно хвърляш царевицата на стъпалата, сетне продължаваш да бягаш надолу.
        Колко кочана царевица си хвърлил? `,
      choices: [
        {
          text: "Един — мини по свой избор на 217, 227 или 242.",
          nextPage: [217, 227, 242],
          requiresItem: { item: "corn", quantity: 1 },
          removeFromInventory: { item: "corn", quantity: 1 },
        },
        {
          text: "Два — продължи на 206 или 259.",
          nextPage: [206, 259],
          requiresItem: { item: "corn", quantity: 2 },
          removeFromInventory: { item: "corn", quantity: 2 },
        },
        {
          text: "Три — прехвърли се на 250.",
          nextPage: 250,
          requiresItem: { item: "corn", quantity: 3 },
          removeFromInventory: { item: "corn", quantity: 3 },
        },
      ],
    },
    14: {
      text: `Не, това блато никак не ти се нрави. Повеждаш обратно дружината си и един час по-късно наближавате… всъщност какво наближавате?`,
      choices: [
        { text: "Кръстопътя — мини на 75.", nextPage: 75 },
        { text: "Сливането на левия и средния път — продължи на 40.", nextPage: 40 },
      ],
    },
    15: {
      text: `Щом отваряш торбата, отвътре добродушно те поглежда патката на Хухавел.

        — Къш, птицо проклета! — крясваш ти, после се обръщаш към чукундуртите и свирепо питаш: — Какво търси тук това животно?

        — Не е животно, а птица, сам го каза преди малко — поправя те Хухавел. — Турнах я вътре, щото иначе е много неудобно. Нали разбираш, шефе, патката под мишница и торбата на другото рамо. Хич не върви, значи.

        Да, но се оказва, че патката не разбира от дисциплина. Изкълвала е двата домата и тъкмо се готви да начене царевицата.

        — И най-умният чукундурт пак си остава чукундурт — въздъхваш ти. — Стига толкова! Отсега нататък аз ще нося торбата.`,
      choices: [
        {
          text: "Отбележи си загубата на двата домата и премини на 138.",
          nextPage: 138,
          removeFromInventory: { item: "tomato", quantity: 2 },
        },
      ],
    },
    16: {
      text: `— Чакай сега да видим с какво разполагаме — промърморва Фърчилан и започва да рови из торбата.`,
      choices: [
        {
          text: "Ако имаш домат, мини на 78.",
          nextPage: 78,
          requiresItem: { item: "tomato", quantity: 1 },
          removeFromInventory: { item: "tomato", quantity: 1 },
        },
        {
          text: "Ако имаш диня, продължи на 126.",
          nextPage: 126,
          requiresItem: { item: "watermelon", quantity: 1 },
          removeFromInventory: { item: "watermelon", quantity: 1 },
        },
        {
          text: "Ако нямаш нищо от изброеното, попадаш на 203.",
          nextPage: 203,
        },
      ],
      moreText:
        "А ако имаш и двете, избери с кое си готов да се разделиш и премини на съответния епизод.",
    },
    17: {
      text: `Щом отхапваш от синята гъба, мигновено те побиват ледени тръпки и сякаш стремително пропадаш надолу. Не! Просто се смаляваш! За броени секунди изчезваш сред тревата.

        След упорито ровене чукундуртите най-сетне те откриват. Бабаитко те поема върху дланта си и укоризнено поклаща глава.

        — Е, каква стана тя, шефе? Май мисията отива към провал, щото в тоя вид не ми е ясно как ще се биеш с таласъмите.

        Уви, Бабаитко е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш?`,
      choices: [
        { text: "Жълта — продължи на 67.", nextPage: 67 },
        { text: "Червена — попадаш на 29.", nextPage: 29 },
        { text: "Зелена — прехвърли се на 82.", nextPage: 82 },
        { text: "Черна — отгърни на 53.", nextPage: 53 },
      ],
    },
    18: {
      text: `След доста усилия импровизираната манерка е готова.`,
      choices: [
        {
          text: "Отбележи си, че нямаш вече диня и премини на 194.",
          nextPage: 194,
          removeFromInventory: { item: "watermelon", quantity: 1 },
        },
      ],
    },
    19: {
      text: `Щом те виждат отново в колибата, министрите моментално падат на колене и започват да блъскат чела в земята.

        — Върна се, великодушни наш благодетелю!

        — Спасителю!

        — Бащице!

        — Значи ще станеш министър на външните работи, нали!`,
      choices: [{ text: "Продължи на 102.", nextPage: 102 }],
    },
    20: {
      text: `— Еха-а-а-а, търговци! — възторжено се провиква таласъмът. — Грабители на народа значи! Кърлежи! Кръвопийци! Напред, братя таласъми! Да ограбим награбеното от народа!

        И блатните таласъми се устремяват към вас. Предводителят им спира на няколко крачки от вас и пита:

        — Е, ще предадете ли доброволно цялото си имущество, или да ви принудим със сила?`,
      choices: [
        {
          text: "— Аз викам да им го дадем, шефе — обажда се Хухавел.",
          nextPage: 28,
        },
        { text: "— Не, да се бием — възразява Бабаитко.", nextPage: 41 },
        { text: "— По-добре да бягаме — предлага Фърчилан.", nextPage: 54 },
      ],
    },
    21: {
      text: `Когато се свестяваш, лежиш в тясна килия, а около теб седят унило четиримата чукундурти.`,
      choices: [
        {
          text: "Попадал ли си вече в затвора?",
          nextPage: 285,
          requiresCondition: "jailed",
        },
        { text: "Не — продължи на 132.", nextPage: 132 },
      ],
    },
    22: {
      text: `Бабаитко гордо се изпъчва и пристъпва към вехтошаря.
      
          — Слушай сега, старче. Обмислих нещата и гледай сега как ще уредим сделката. Ти, значи, ми даваш всичките тези вехтории.
      
          Настава тишина. Старчето изчаква малко, после пита:
      
          — А на мен каква ще ми е ползата?
      
          Бабаитко свива едрия си юмрук и го поднася към носа му.
      
          — Ползата ще ти е в това, че няма да те опердаша. Разбра ли?
      
          — О, такава ли била работата? — усмихва се старчето. — Ами тъй кажи, бе човек! Заповядай, заповядай! Чакай само да ти постеля това килимче, че да не стъпваш по прашната земя.
      
          И без да се бави, вехтошарят пъргаво разпъва пред себе си килимчето — кръгло и абсолютно черно. Бабаитко ви хвърля през рамо победоносен поглед, после пристъпва напред… и с ужасен писък пропада в земята.
      
          Няколко секунди стоиш вкаменен от изумление. Сетне осъзнаваш — това не е никакво килимче, а преносима дупка.
      
          — Помо-о-о-ощ! — долита от земните недра отчаяният рев на Бабаитко. — Измъкнете ме оттук!
      
          — Като много знаеш да се репчиш, там ще стоиш — подвиква отгоре старчето. — Ей сега пак ще навия дупката и ще си останеш завинаги под земята.
      
          С много молби и увещания най-сетне успявате да се споразумеете — срещу два кочана царевица старчето ви разрешава да измъкнете Бабаитко. Щом излиза отново на бял свят, едрият чукундурт се отдръпва засрамено настрани.
      
          Отбележи си загубата на двата кочана царевица и избери на кого ще повериш да води сделката.
      `,
      removeFromInventory: { item: "corn", quantity: 2 },
      choices: [
        { text: "Гадолини — продължи на 47.", nextPage: 47, },
        { text: "Хухавел — попадаш на 61.", nextPage: 61 },
        { text: "Фърчилан — прехвърли се на 94.", nextPage: 94 },
        { text: "Сам ще водиш сделката — отгърни на 119.", nextPage: 119 },
      ],
    },
    23: {
      text: `— Слушай сега — почва да обяснява Хухавел. — Можеш ли да лапнеш малко жарава от огъня?
      
          — Мога, как да не мога — кимва змеят и за доказателство налапва половината жарава.
      
          — Ха сега лапни и това — подава му царевицата Хухавел. — И чакай да видиш какво ще стане.
      
          В течение на една минута не се случва нищо. Сетне, по всички закони на науката, царевицата се превръща в пуканки с оглушителен трясък. Ошашавен, змеят отскача настрани и почва да клати глава като куче, лапнало пчела.
      
          — Сега е моментът! — провиква се Фърчилан. — Да бягаме!
      
          — Чакайте! — протестира Хухавел. — Недейте да бягате! Това е недоразумение. Всичко ще обясня.
      
          Кого ще послушаш?
`,
      choices: [
        { text: "Фърчилан — мини на 32.", nextPage: 32 },
        { text: "Хухавел — продължи на 56.", nextPage: 56 },
      ],
    },
    24: {
      text: `
          Или все пак камъкът ви е излъгал, или просто от вас не стават гъбари. След дълго лутане из гората най-сетне откривате само няколко гъби. При това странни — едри и шарени. Всяка в различен цвят — жълта, синя, зелена, червена и черна. 
          Бабаитко боязливо оглежда чудноватите гъби и прошепва: 
          — Не ми харесва тая работа, шефе. Гъбите май са вълшебни. 
          — Абе, стига си говорил глупости! — прекъсва го Фърчилан. — Дай сега бързичко да си ги опечем. 
          — И като станеш после на жаба, ще видиш едни гъби — мрачно заявява Гадолини. — Вие както щете, ама аз вълшебни гъби не ям. 
          Гадолини определено е прав. Дори и да не са вълшебни, гъбите може да са отровни. Затова категорично забраняваш всякакво ядене. 
          Имаш ли книжката „Вълшебните гъби по нашите земи“? 
          `,
      choices: [
        { text: "Да — мини на 63. ", nextPage: 63, requiresItem: { item: "book", quantity: 1 }, },
        { text: "Не — продължи на 98. ", nextPage: 98 },
      ],
    },
    25: {
      text: `
            Когато огледалцето му казва, че е най-красив на земята, таласъмът изпада във възторг. Без повече да ви обръща внимание, той се отдръпва настрани с безценната придобивка.  
            `,
      choices: [
        {
          text: "Напълваш съдинката си с вода и преминаваш на 177. ",
          addToInventory: [ {item: "bottleWater", quantity: 1 }],
          nextPage: 177,
        },
      ],
    },
    26: {
      text: `
            Още щом влизаш в колибата, разбираш какво са имали предвид, като говореха за централно отопление — огнището се намира точно в средата. Обаче колкото и да се оглеждаш, не виждаш никъде нито капка вода. 
— Къде ви е течащата вода? — обръщаш се ти към министъра на разните работи. 
Той размахва ръка нагоре. 
— Виждаш ли я онази дупка горе на тавана? Като завали, през нея ще ти тече колкото искаш. 
— Чукундуртска ви работа — заявяваш ти и се приготвяш за сън. 
Уви, нощта не е твърде приятна. Малко преди полунощ започва да вали като из ведро, а проклетата дупка се намира точно над огнището. Естествено, огънят изгасва и ти чак до сутринта зъзнеш, омотан като пашкул в парцаливите завивки. Когато се развиделява, дъждът спира, но злото вече е сторено — гърлото те боли и кихаш на поразия.
            `,
      choices: [
        {
          text: " Отбележи си, че си настинал и премини на 155.  ",
          nextPage: 155,
        },
      ],
    },
    27: {
      text: `
      — Я, пак идат нашите приятели! — радостно ви посрещат блатните таласъми. — Ама вие какво така само обикаляте насам-натам? 
      — Тя, работата на командосите, не е лесна — гордо заявява Бабаитко. 
      И вие спокойно прекосявате блатото. В коя посока отивате? 
            `,
      choices: [
        {
          text: " Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: " Обратно към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    28: {
      text: `
      Няма как, предаваш на старшия таласъм всичките си придобивки. 
— Ехе-е-е-е! — радостно възкликва той. — Я гледай колко богатства са натрупали експлоататорите на трудовия народ! А сега да ми се махате от главата! Вървете напред, оттук нататък става по-плитко. 
И наистина, скоро започвате да излизате от блатото. 
В коя посока вървите? 
            `,
            emptyInventory: true,
      choices: [
        {
          text: " Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: " Обратно към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    29: {
      text: `
      Щом отхапваш от червената гъба, за миг ти се завива свят, обзема те чувство на неописуема лекота… и после виждаш как чукундуртите стремително се отдалечават надолу. Но всъщност самият ти летиш нагоре в небето, където лекият ветрец те подема и те отнася надалеч. Уви, експериментите са завършили неуспешно — още дълги дни ще се носиш из облаците, докато магията престане и постепенно се спуснеш на земята. 
Така или иначе твоето приключение завършва дотук. 
            `,
      choices: [],
      end: true
    },
    30: {
      text: `
      Продължавате напред по коридора и след малко се озовавате в огромно подземие, пълно с бъчви. Наоколо се носи тежкият дъх на вино. 
— Винце, шефе, винце! — развълнувано възкликва Бабаитко. — Дай да си пийнем малко! 
— За кураж — подкрепя го Фърчилан. 
— И блясък в очите — допълва Хухавел. 
Поглеждаш ги строго. 
— Никакво пиянство не разрешавам при изпълнение на служебните задължения! 
— Е-е-е, що си такъв, бе шефе? — въздъхва Гадолини. — Ние само по мъничко. Обещавам ти да пием с мярка. 
            `,
      choices: [
        {
          text: "Ако разрешиш на чукундуртите да пийнат с мярка, мини на 253. ",
          nextPage: 253,
        },
        {
          text: "Ако забраниш категорично, продължи на 261. ",
          nextPage: 261,
        },
      ],
    },
    31: {
      text: `
      — Хубаво де, стига сте хленчили! — викваш ти с цяло гърло, за да надвикаш плача на уплашените чукундурти. — Ама обяснете все пак… 
— Министрите ще ти обяснят! — провиква се тълпата и с възторжени възгласи те грабва на ръце. 
Преди да се опомниш, вече седиш в някаква колиба, а насреща ти са застанали в почтителни пози двамата белобради чукундурти. Зад тях смутено се свива трети — по-дрипав и по-мръсен от всички останали. 
— Кои сте вие? — питаш ти с леко нетърпение. — Ще ми обясни ли най-сетне някой какво става? 
— О, спасителю наш, аз съм министърът на разните работи — отговаря първият старец. 
— А пък аз съм министърът на другите работи — покланя се до земята вторият, при което неволно си застъпва брадата и се захлупва по нос. 
Тъй като третият гузно мълчи, ти отново питаш: 
— Ами онзи зад вас? 
— А, остави го — небрежно махва с ръка министърът на разните работи. — Той е министър-предател. 
— Да не искаш да кажеш „министър-председател“? 
— А, не, точно министър-предател — обажда се министърът на другите работи, който вече е успял да се изправи. 
— Че за какво ви е министър-предател? — изненадваш се ти. 
— О, много е важен, благодетелю! — обяснява министърът на разните работи. — Тъй и тъй нещата не вървят. Ако си нямаме министър-предател, по кого ще плюе народът? 
— Е, ваша си работа — свиваш рамене ти. — А сега кой ще ми обясни от какво трябва да ви спасявам. 
— Обяснявай ти — обръща се към колегата си министърът на другите работи. — Обясненията спадат към разните работи. 
— А, не, ти обяснявай! — сопва се онзи. — Обясненията са към другите работи. 
— Слушайте, ако не получа незабавно обяснение, ставам и си тръгвам — заплашително изричаш ти. — Пък да видим дали после и тримата няма да ви направят министър-предатели. 
Заплахата явно е много страшна, защото тримата почват да обясняват един през друг: 
— Таласъмите! 
— Те, те! Пратиха ни дипломатическа нота! 
— Искат да ни оберат! 
— Данъци! 
— Дървеняк Първи! 
— Момент! — намесваш се ти. — Какъв е тоя Дървеняк Първи? Имаше навремето един Тиквеняк Първи, обаче той отдавна е на онзи свят. 
— А пък Дървеняк е негов син — плахо обяснява министърът на разните работи. — Обявил се е за цар на таласъмите. 
— И е изградил нов замък вместо онзи, дето ти го разруши — добавя министърът на другите работи. 
— Ама под земята, та никой не го знае къде се намира — обажда се министър-предателят. 
Разперваш ръце. 
— Е, хубаво. Ами аз с какво мога дави помогна? 
— Ще ни станеш министър на външните работи! — възкликват тримата в хор. — Като предприемеш дипломатически мерки, Дървеняк ще се уплаши от теб и няма да ни граби. 
            `,
      choices: [
        {
          text: "Ако си съгласен да станеш чукундуртски министър на външните работи, мини на 102. ",
          nextPage: 102,
        },
        {
          text: "Ако откажеш, продължи на 121. ",
          nextPage: 121,
        },
      ],
    },
    32: {
      text: `
      — Сега не е моментът за обяснения! — викваш ти. — Не виждаш ли, че щом се опомни, ще ни излапа? 
И всички хуквате… накъде впрочем? 
            `,
      choices: [
        {
          text: "Напред, където би трябвало да е замъкът на таласъмите — мини на 68. ",
          nextPage: 68,
        },
        {
          text: "Към кръстопътя — продължи на 89.  ",
          nextPage: 89,
        },
      ],
    },
    33: {
      text: `
      Скоро наближавате горичката, където Бабаитко предлагаше да берете гъби. Е, набрахте ли? 
            `,
      choices: [
        {
          text: "Да — мини на 46. ",
          nextPage: 46,
        },
        {
          text: "Не — продължи на 71. ",
          nextPage: 71,
        },
      ],
    },
    34: {
      text: `
      След по-малко от минута грейналият Мишемориус обува панталоните и радостно започва да подскача из стаята.              `,
      choices: [
        {
          text: "Отбележи си, че вече нямаш вехти панталони и продължи на 128.",
          removeFromInventory: { item: "oldTrousers", quantity: 1 },
          nextPage: 128,
        },
      ],
    },
    35: {
      text: `
      — Мирни ли? — оглежда те подозрително таласъмът. — Те, всички така разправят, пък после се оказват я разбойници, я някакви други злодеи. С какво ще докажеш, че сте мирни пътници? 
                  `,
      choices: [
        {
          text: "Ако имаш лула на мира, мини на 86. ",
          requiresItem: "pipe",
          nextPage: 86,
        },
        {
          text: "В противен случай премини по свой избор на 103 или 129. ",
          nextPage: [103, 129],
        },
      ],
    },
    36: {
      text: `
      Отваряш торбата и се хващаш за главата. Бабаитко е нахвърлял вътре провизиите по най-калпавия начин: първо доматите, върху тях царевицата, сетне сапуна, цвеклото, динята и най-отгоре се мъдри тежката лула на мира. Естествено, доматите са станали на пюре, а динята е цепната. Налага се спешно да изядете похабените провизии. 
      — Край! — заявяваш ти. — Отсега нататък сам ще нося торбата. 
            `,
      choices: [
        {
          text: "Отбележи си загубата на доматите и динята, а след това премини на 138. ",
          removeFromInventory: [{ item: "tomato", quantity: 2 }, { item: "watermelon", quantity: 1 }],
          nextPage: 138,
        },
      ],
    },
    37: {
      text: `
      Както вече бе казано, лулата на мира е издълбана от цял пън. Щом грабва тежкото дърво, Бабаитко започва да раздава свирепи удари наляво и надясно. 
      — Ха така! — пъхти едрият чукундурт. — На ти на тебе по куфалницата! А на теб по кубето! Ето ти и на теб, да не речеш, че ми се свиди. 
      Пред страховитата му ярост таласъмите безславно удрят на бяг. След минута от тях няма и следа — всички са се изпокрили в тинята. 
      — Да вървим! — нареждаш ти. — И по-бързо, че току-виж се върнали с подкрепления. 
      Продължавате напред. Постепенно блатото става по-плитко и скоро излизате на отсрещния бряг. 
      Накъде сте се отправили? 
                  `,
      choices: [
        {
          text: "Напред, където би трябвало да е замъкът на таласъмите — мини на 144. ",
          nextPage: 144,
        },
        {
          text: "Към кръстопътя — продължи на 171. ",
          nextPage: 171,
        },
      ],
    },
    38: {
      text: `
      — Дай сапуна, шефе! — отчаяно се провиква Гадолини. 
      — Баш сега ли реши да се миеш? — изръмжава Бабаитко. 
      — Ти си трай! — срязва го Гадолини. — Давай сапуна, шефе, ако ти е мил животът! 
      Не разбираш какво иска да прави, но изпълняваш молбата му. И след миг проумяваш. Гениалният Гадолини трескаво почва да маже стъпалата със сапун. 
      — А сега бързо надолу! — подканва ви той, когато привършва. 
      Отново побягвате. Изведнъж горе се раздава трясък и трополене. Успех! Таласъмът е попаднал на хлъзгавите стъпала! Прилепвате се към стената и след секунди грамадното му туловище прелита покрай вас с невъобразима скорост. Сетне нейде отдолу долита нов трясък и настава тишина. 
            `,
      choices: [
        {
          text: "Продължи на 263. ",
          nextPage: 263,
        },
      ],
    },
    39: {
      text: `
      Какво пък, тук ти избираш. Щом така си решил, попадаш право в края на приключението. А краят е следният: 
      Напускаш чукундуртите и след дълъг път се прибираш в своята колиба насред гората. През следващите дни не забелязваш нищо нередно. Но около една седмица по-късно листата на дърветата започват да пожълтяват. От изворите блика странна вода — блудкава, миризлива и съвсем суха. Разбираш, че Дървеняк Първи е осъществил зловещите планове на своя баща — да унищожи цялата гора. Уви, вече е късно да сториш каквото и да било. След още една седмица дърветата са голи като през късна есен. Гледката на загиващата гора е ужасна. С болка на сърце започваш да се приготвяш за път. Тук вече не може да се живее. Ще трябва да се преселиш другаде, а мъртвата гора ще остане завинаги царство на таласъмите. 
          `,
      end: true,
    },
    40: {
      text: `
      Спирате за кратка почивка на мястото, където се сливат левият и средният път. Накъде ще продължиш сега? 
       `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 157. 
          `,
          nextPage: 157,
        },
        {
          text: `
          Обратно по средния път — продължи на 141. 
          `,
          nextPage: 141,
        },
      ],
    },
    41: {
      text: `
      — Напред, отмъстители! — провикваш се ти. — Сега ще им дадем да разберат. 
      И всички, дори плашливият Хухавел, се хвърлят в схватката. Но врагът има числено превъзходство, а освен това се бие на собствена територия. Постепенно таласъмският обръч започва да се затяга около вас. 
      И в този момент Бабаитко надава загадъчен вик: 
      — Къде е лулата на мира? 
      Имаш ли все още лула на мира? И ще я дадеш ли на Бабаитко? 
             `,
      choices: [
        {
          text: `
          Да — мини на 37.  
          `,
          requiresItem: { item: "pipe", quantity: 1 },
          nextPage: 37,
        },
        {
          text: `
          Не — продължи на 62. 
          `,
          nextPage: 62,
        },
      ],
    },
    42: {
      text: `
      Щом хапваш парченце от зелената гъба, мигновено те обзема чувство на неописуема тежест и ти рухваш пред смаяните чукундурти. Бабаитко се опитва да те повдигне, после отчаяно махва с ръка. 
      — Е, шефе, май работата приключва дотук. Как ще се бориш срещу таласъмите, като не можеш да се държиш на краката си? 
      Уви, Бабаитко е прав. Ще трябва да се откажеш от приключението… освен ако рискуваш още веднъж да опиташ някоя от вълшебните гъби. Друга възможност просто нямаш. Коя от гъбите ще избереш? 
             `,
      choices: [
        {
          text: `
          Жълта — продължи на 101.
          `,
          nextPage: 101,
        },
        {
          text: `
          Червена — попадаш на 112.
          `,
          nextPage: 112,
        },
        {
          text: `
          Синя — прехвърли се на 125.
          `,
          nextPage: 125,
        },
        {
          text: `
          Черна — отгърни на 53. 
          `,
          nextPage: 53,
        },
      ].filter((choice) => choice.nextPage !== null),
    },
    43: {
      text: `
      Докато вървите напред през гората, мракът наоколо се сгъстява. Повява се хладен ветрец, нейде между дърветата се обажда бухал. 
      — Ама и ние накъде сме тръгнали? — плахо мърмори Хухавел. — Що ли не си стояхме у дома… 
      — Я да млъкваш! — скарва му се Бабаитко. — Че ако взема… 
      — Знам — прекъсва го Хухавел. — Ще ми опалиш един по кубето. 
      — Не позна! — ухилва се Бабаитко. — По кофата! 
      — Тихо! — прошепва изведнъж Гадолини. — Виждам светлина! 
      И наистина, отпред между дърветата потрепва червеникавата светлинка на пламъци. Отправяте се натам и след малко различавате трима таласъми, седнали край малък огън. Зад тях се тъмнее широкият вход на пещера. 
      — Това трябва да е подземният замък! — шепнешком възкликва Фърчилан. — Да ги нападнем ли? 
      За разлика от друг път Бабаитко не е настроен войнствено. 
      — Ще ги нападнеш, ама като ти опалят един — възразява той. — Я го виж онзи в средата какъв е як. 
      Вярно, средният таласъм е грамаден. Щом и Бабаитко не смее да го нападне, по-добре ще е да не влизате в сражение. 
      — Остави аз да ги забаламосам, шефе — предлага Гадолини. — Такъв номер ще им врътна, че свят да им се завие. 
      — То, ако е за баламосване, и аз мога — обажда се Фърчилан. — Нека аз, шефе! 
      — Аз пък викам да ги изчакаме да заспят и тогава да се промъкнем тихичко — предлага Хухавел. 
      Чие предложение ще приемеш? 
             `,
      choices: [
        {
          text: `
          На Гадолини — мини на 2. 
          `,
          nextPage: 2,
        },
        {
          text: `
          На Фърчилан — продължи на 16.  
          `,
          nextPage: 16,
        },
        {
          text: `
          На Хухавел — прехвърли се на 60.   
          `,
          nextPage: 60,
        },
      ],
    },
    44: {
      text: `
      Лесно е да се каже, но не е чак толкова просто да се осъществи. Нямаш представа накъде да тръгнеш. Поемаш напосоки и през целия ден се луташ из гори и пущинаци. Май съвсем си се заблудил, защото местата стават все по-непознати. 
      Пада мрак и се налага да пренощуваш в набързо струпана колиба от клони. Ала този път съдбата явно не е добре настроена към теб. Малко след полунощ от небето се посипва пороен дъжд. За сън и дума не може да става. Свит в мизерното си убежище, ти зъзнеш и напразно се мъчиш да намериш място, където да не капе вода. Призори гърлото те боли и кихаш на поразия. 
             `,
      choices: [
        {
          text: `
          Настинал си. Отбележи си това и премини на 99. 
          `,
          changeCondition: { sick: true,  healthy: false },
          nextPage: 99,
        },
      ],
    },
    45: {
      text: `
      — Добре бе, шефе — въздъхва Хухавел. — Ами поне лулата на мира няма ли да ми дадеш? 
             `,
      choices: [
        {
          text: `
          Ако имаш лула на мира и се съгласиш да я дадеш на Хухавел, мини на 76. 
          `,
          requiresItem: { item: "pipe", quantity: 1 },
          nextPage: 76,
        },
        {
          text: `
          В противен случай продължи на 95. 
          `,
          nextPage: 95,
        },
      ],
    },
    46: {
      text: `
      А познаваш ли свойствата на вълшебните гъби? 
                    `,
      choices: [
        {
          text: `
          Да — мини на 220. 
          `,
          requiresItem: { item: "book", quantity: 1 },
          nextPage: 220,
        },
        {
          text: `
          Не — продължи на 59.          `,
          nextPage: 59,
        },
      ],
    },
    47: {
      text: `
      Гадолини пристъпва напред, оглежда вехториите и уверено посочва: 
      — Взимам това, това и това. 
      И той грабва три от предметите. 
      — Чакай, чакай — хваща го старчето за наметалото. — Ами какво ще ми платиш? 
      — Ще ти платя бе, човек, няма страшно! — успокоява го Гадолини. — Все ще се спазарим някак. Ама знаеш ли какво? Нещо не ми харесват тия трите стоки. Я си ги вземи, пък ми дай ето онези три. 
      Речено-сторено. Гадолини пъргаво оставя трите предмета и грабва вместо тях нови три. Сетне понечва да си тръгне. Старчето отново се вкопчва в наметалото му. 
      — Стой! Първо трябва да ми платиш! 
      — Какво да ти платя? — изненадва се Гадолини. — Нали срещу тези трите неща ти дадох онези три. Натурална размяна, значи. Пито-платено, дето се вика. 
      — Ама ти и онези не си ми платил! — отчаяно виква старчето. 
      — Че как да ти ги платя, като не съм ги взел? — възразява Гадолини. 
      — Нещо не е наред тук, така да знаеш! — сърдито заявява старчето и почва да пресмята нещо на пръсти, като си шепне тихичко. 
      Гадолини го оставя да умува и гордо се приближава към теб, за да покаже спечеленото — чифт вехти панталони, стоножка в бурканче и книжката „Вълшебните гъби по нашите земи“. 
      Пред вас старчето продължава да шепне тихичко и да се чеше с всичка сила по главата, но накрая унило махва с ръка, после се обръща към теб. 
      — Че ме измамихте, измамихте ме, ама не мога да разбера как. Нейсе. Ела да направим още една сделка, обаче тоя път нищо не давам, преди да платиш. 
             `,
             addToInventory: [{ item: "book", quantity: 1 }, {item: "centipede", quantity: 1 }, {item: "oldTrousers", quantity: 1 }],
      choices: [
        {
          text: `
          Ако искаш да търгуваш с вехтошаря, мини на 119. 
          `,
          nextPage: 119,
        },
        {
          text: `
          Ако смяташ, че е крайно време да си тръгвате, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ],
    },
    48: {
      text: `
      Налага се да употребиш целия разтворител, но само след десет минути Мишемориус е отлепен от стола и радостно подскача из стаята. 
      `,
      choices: [
        {
          text: `
          Отбележи си, че вече нямаш разтворител. Ако искаш, можеш да запазиш празното шишенце. След това премини на 128. 
          `,
          removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
          addToInventory: [{ item: "bottleEmpty", quantity: 1 }],
          nextPage: 128,
        }
      ],
    },
    49: {
      text: `
      — Гъби, глупости! — скарваш се ти. — Я да вървим напред, че кой знае още колко път ни чака. 
      — Прав е шефът — подкрепя те Фърчилан. — Няма какво да се мотаем с разни гъби. 
             `,
      choices: [
        {
          text: `
          Премини на 172.           `,
          nextPage: 172,
        },
      ],
    },
    50: {
      text: `
      — Брях! — зяпва блатният таласъм. — Не думайте! 
      — Ще думаме колкото си щем, щото е вярно — гордо отговаря Бабаитко. 
      — Ами като е тъй, бъдете ни скъпи гости за малко — радостно предлага таласъмът. — Нашият цар много ще се радва да ви види. Никога не е виждал командоси. 
              `,
      choices: [
        {
          text: `
          Ако приемеш поканата, мини на 72. 
          `,
          nextPage: 72,
        },
        {
          text: `
          Ако предпочиташ да откажеш, продължи на 93.          `,
          nextPage: 93,
        },
      ],
    },
    51: {
      text: `
      Точно по пладне ти стоиш в края на ливадата край чукундуртското село. До тебе са се свили разтреперани тримата министри, но освен тях наоколо не се мярка жива душа. Всички чукундурти са се изпокрили вдън земя. Изглежда, че не ти вярват много въпреки всички ентусиазирани уверения от тази сутрин. 
      — Идат! — възкликва министър-предателят и пъргаво се укрива зад гърба ти. 
      Другите двама незабавно го избутват настрани и заемат безопасното място. Но ти не им обръщаш внимание, защото погледът ти е прикован към горичката отвъд ливадата. Измежду дърветата един след друг започват да излизат въоръжени до зъби таласъми. Тихичко подсвирваш от изненада. Трябва да са поне стотина на брой. И цялата тази сган заплашително се задава насреща ти. 
      Вече се чудиш дали да не си плюеш на петите, когато таласъмите спират на десет крачки от теб. Предводителят им се обръща с гръб към теб, размахва дебела сопа и всички други пропяват в хор: 
      — Со-о-о-о-ол! 
      Сетне настава тишина. 
      — Каква сол бе, каква сол? — уплашено подвиква министър-предателят. — Сол ли искате да ви дадем? 
      — Това е нота, тикво зелена! — обяснява водачът на таласъмите. — Дипломатическа нота, ако искаш да знаеш. 
      — И какво означава? — пита с изтънял глас министърът на другите работи. 
      — Означава, че ако до един час не ни предадете всичките си хранителни запаси, ще ви натъпчем в миша дупка. 
      — Не ща! — провиква се министърът на разните работи. — Страх ме е от мишките! 
      — Ти мълчи! — прекъсва го неговият колега и се обръща към таласъма. — Ама чакай сега, любезни, то не може така. Ако ни вземете всичко, какво ще ядем през зимата? 
      — Трънки! — изхилва се някой от ордата таласъми. 
      — И глогинки! — добавя друг. 
      — Печени! — уточнява трети. 
      Е, нещата май тръгват от зле по-зле. И за съжаление в момента всичко зависи от теб. Какво ще направиш сега? 
             `,
      choices: [
        {
          text: `
          Ще се съгласиш да предадеш на таласъмите всички хранителни запаси — мини на 96. 
          `,
          nextPage: 96,
        },
        {
          text: `
          Ще отхвърлиш претенциите им — продължи на 114.           `,
          nextPage: 114,
        },
      ],
    },
    52: {
      text: `
      Двамата почват да си разменят през прозорчето все по-обидни реплики. Накрая надзирателят не издържа, отключва килията, нахълтва с размахана тояга… и Бабаитко го просва още с първия удар. 
      — Да бягаме! — провикваш се ти. 
      Изтичвате по къс коридор, отваряте една врата и се озовавате в нов, по-широк коридор. В едната посока той се спуска полегато към земните дълбини. От другата страна забелязваш наблизо стълбище, което води нагоре — несъмнено това е изходът. А точно срещу себе си забелязваш врата в стената на коридора. Какво ще направиш сега? 
             `,
      choices: [
        {
          text: `
          Ще провериш какво има зад вратата отсреща — мини на 225. 
          `,
          nextPage: 225,
        },
        {
          text: `
          Ще се измъкнеш по стълбището нагоре и ще се откажеш от опасното приключение — продължи на 39. 
          `,
          nextPage: 39,
        },
        {
          text: `
          Ще тръгнеш по коридора към вътрешността на подземния замък — попадаш на 30. 
          `,
          nextPage: 30,
        }
      ],
    },
    53: {
      text: `
      Само това не биваше да правиш! Щом отхапваш от черната гъба, по тялото ти пробягват ледени тръпки и след броени секунди рухваш мъртъв пред ужасените погледи на чукундуртите. Това е краят на твоето приключение. 
      Лека ти пръст, доблестни храбрецо!  
             `,
      choices: [
        {
          text: `
          Но за да не започваш цялата история отначало, върни се на 136.`,
          nextPage: 136,
        }
      ],
    },
    54: {
      text: `
      — Да бягаме! — провикваш се ти и повеждаш чукундуртите в отстъпление. 
      — А, бягат! — изревава водачът на блатните таласъми. — Дръжте експлоататорите, братя! 
      И цялата тумба се хвърля подир вас. 
      Сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
             `,
      choices: [
        {
          text: `
          Mини на 130.
          `,
          nextPage: 130,
        },
        {
          text: `
          Mини на 151.
          `,
          nextPage: 151,
        },
      ],
    },
    55: {
      text: `
      — Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още тази сутрин потеглям към новия замък на таласъмите. Искам след половин час насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия. 
      Чукундуртите изревават възторжено. 
      — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо. 
      Друг перва министър-предателя по главата. 
      — Видя ли бе? Това се казва министър, а не предател като тебе. 
       
      През следващите десетина минути настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Но когато наближава часът за събиране на доброволците, тълпата почва да оредява. Ту един, ту друг се сеща за някаква спешна работа и изчезва между колибите. Накрая оставаш съвсем сам насред селото. И тъкмо се каниш да теглиш една ругатня по адрес на чукундуртската храброст, когато към теб се задават тримата министри, придружени от четирима млади чукундурти. 
             `,
      choices: [
        {
          text: `
          Продължи на 184. 
          `,
          nextPage: 184,
        },
      ],
    },
    56: {
      text: `
      Макар че сърцето ти се свива от тревога, правиш знак на останалите да изчакат. В това време Хухавел пристъпва напред. 
      — Ще те излапам, буболечка такава! — яростно изревава змеят. — Суров ще те излапам, та ако ще да се разболея! Да ми погодиш такъв номер! 
      — Ча-ча-чакай бе, н-н-няма такава работа — заеква Хухавел. — Не разбра ли к-к-какъв номер се получи? Може и да не си огнедишащ, но ще бъдеш единственият в света картечен змей. Вече видя как става. Трябва само да си намериш отнякъде царевица — и готово! 
      Змеят зяпва от почуда. 
      — Вярно бе! Брей, имало умни хора… пардон, умни чукундурти на тоя свят. Значи картечен змей, а? Да сте живи и здрави, скъпи приятели. Хайде, вървете си със здраве. Срамота ще е да ви ям след такава услуга. 
      И вие поемате… накъде впрочем? 
             `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 81. 
          `,
          nextPage: 81,
        },
        {
          text: `
          Към кръстопътя — продължи на 108. 
          `,
          nextPage: 108,
        },
      ],
    },
    57: {
      text: `
      Отхапваш от синята гъба със страх, но този път явно си имал късмет, защото след броени секунди си възвръщаш предишните размери. 
             `,
      choices: [
        {
          text: `
          Ако искаш да продължиш експериментите, върни се на 136.           `,
          nextPage: 136,
        },
        {
          text: `
          Ако предпочиташ да не рискуваш повече, мини на 154. 
          `,
          nextPage: 154,
        },
      ],
    },
    58: {
      text: `
      Влизаш в колибата и се оглеждаш, но не виждаш никъде нито капка вода. 
      — Къде ви е течащата вода? — обръщаш се ти към министъра на разните работи. 
      Той размахва ръка нагоре. 
      — Виждаш ли я онази дупка горе на тавана? Като завали, през нея ще ти тече колкото искаш. 
      — Чукундуртска ви работа — заявяваш ти и се приготвяш за сън. 
      Уви, нощта не е твърде приятна. Малко преди полунощ започва да вали като из ведро и през дупката се изсипва истински водопад. За щастие леглото е близо до огнището. Хвърляш в огъня няколко едри цепеници, омотаваш се в парцаливите завивки и криво-ляво изкарваш до сутринта, когато дъждът спира. 
             `,
      choices: [
        {
          text: `
          Продължи на 155. 
          `,
          nextPage: 155,
        },
      ],
    },
    59: {
      text: `
      Ако си успял да се снабдиш с книгата „Вълшебните гъби по нашите земи“, можеш да се консултираш с нея.  
             `,
      choices: [
        {
          text: `
          За целта премини на 83. `,
          requiresItem: { item: "book", quantity: 1 },
          nextPage: 83,
        },
        {
          text: `
          В противен случай продължи на 104. 
          `,
          nextPage: 104,
        },
      ],
    },
    60: {
      text: `
      Не се налага да чакате дълго. Половин час по-късно таласъмите звучно хъркат край огъня и вие започвате да се промъквате към входа на пещерата. 
      Настинал ли си? 
             `,
      choices: [
        {
          text: `
          Да — мини на 189. 
          `,
          requiresCondition: { condition: "sick" },
          nextPage: 189,
        },
        {
          text: `
          Не — продължи на 254.
          `,
          requiresCondition: { condition: "healthy" },
          nextPage: 254,
        },
      ],
    },
    61: {
      text: `
      — Сега ще видите какво е бизнес! — гордо заявява Хухавел, после пристъпва към старчето и се впуска в пазарлък. 
      Резултатът от бизнеса обаче се оказва плачевен. След пет минути всичките ви хранителни запаси (включително сапунът) преминават у старчето. Остават ви само лулата на мира и патката на Хухавел. 
      В замяна Хухавел получава усуканата джаджа. 
      — И за какво ти е туй желязо? — пита Фърчилан. 
      — Ами… де да знам… — запъва се Хухавел. — Ама я го виж само какво е интересно. Едно усукано такова… 
      — Диване! — перва го по главата Гадолини. — За нищо не те бива! Слушай, шефе, дай сега и аз да опитам в бизнеса. 
      След провала на Хухавел не изпитваш особено желание да се доверяваш на когото и да било от чукундуртите. Но пък кой знае, може Гадолини да излезе по-добър търговец. 
             `,
             emptyInventory: true,
             addToInventory: [{ item: "duck", quantity: 1 },{ item: "twistedTrinket", quantity: 1 }, { item: "pipe", quantity: 1 }],
      choices: [
        {
          text: `
          Ако му разрешиш да опита нова сделка, мини на 47. 
          `,
          nextPage: 47,
        },
        {
          text: `
          Ако опиташ сам да се пазариш със старчето, продължи на 119. 
          `,
          nextPage: 119,
        },
        {
          text: `
          Ако смяташ, че е крайно време да си тръгвате, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ],
    },
    62: {
      text: `
      Твоите командоси проявяват чудеса от храброст, но битката се развива все по-зле. Още миг и ще падне заветният хълм, както е казал поетът. 
— Да бягаме! — провикваш се ти и повеждаш чукундуртите в отстъпление. 
Но сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
      `,
      choices: [
        {
          text: "130",
          nextPage: 130,
        },
        {
          text: "151.",
          nextPage: 151,
        },
      ],
    },
    63: {
      text: `
      Чудесно е, когато имаш полезен наръчник. Разгръщаш книгата и от нея узнаваш, че гъбите наистина са вълшебни. А свойствата им са следните: 
      ЖЪЛТА ГЪБА — увеличава онзи, който хапне от нея. 
      СИНЯ ГЪБА — смалява многократно консуматора си. 
      ЧЕРВЕНА ГЪБА — силно намалява теглото. 
      ЗЕЛЕНА ГЪБА — увеличава теглото. 
      ЧЕРНА ГЪБА — невероятно отровна, убива жертвата за броени минути. 
      Запомни добре тези свойства, а след това продължи на 111. 
      `,
      mushroomProperties: true,
      choices: [
        {
          text: "111",
          nextPage: 111,
        },
      ],
    },
64: {
      text: `
      Преди да му обясниш за какво служи подаръкът, таласъмът изхрупва макарона и доволно кимва. 
— М-м-м! Вкусно! Швейцарски е, нали? Хайде, наливайте си вода и изчезвайте. 
Напълваш съдинката си с вода и преминаваш на 177.
      `,
      choices: [
        {
          text: "177",
          nextPage: 177,
        },
      ],
    },
65: {
      text: `
      С отчаяно усилие разблъскваш тълпата и хукваш да бягаш, следван по петите от стотици разплакани чукундурти. За щастие гората не е далече и след няколко минути намираш убежище в нея. Един по един преследвачите изостават, докато накрая откриваш, че вече си сам. Спираш и избърсваш потта от челото си. Ама че чукундуртска история! 
      Е, сега не ти остава нищо друго, освен да се прибереш у дома. За да го сториш, премини на 44. 
      `,
      choices: [
        {
          text: "44",
          nextPage: 44,
        },
      ],
    },
    66: {
      text: `
      — Какво? — възмутено се провиква таласъмът. — Не било наша работа, а? Братя, тия агресори оскърбяват нашата таласъмска гордост! Напред! Да отмъстим за поруганата си чест! 
И блатните таласъми се устремяват към вас. 
— Да бягаме, шефе! — уплашено подвиква Хухавел. — Да се спасяваме, додето сме цели! 
— Вярно — подкрепя го Фърчилан. — Дето е казал народът, бежанова майка не плаче. 
— Да се бием! — възразява Бабаитко. — Ще видят те, като им опаля един по китарите! 
Кого ще послушаш? 
      `,
      choices: [
        {
          text: `Бабаитко — прехвърли се на 41.`,
          nextPage: 41,
        },
        {
          text: `Хухавел и Фърчилан — продължи на 130 или 151.`,
          nextPage: [130, 151],
        },
      ],
    },
    67: {
      text: `
      Щом отхапваш парченце от жълтата гъба, по цялото ти тяло пробягва непоносим сърбеж и виждаш как короните на дърветата стремително падат насреща ти. Не! Дърветата са неподвижни, но самият ти си възвръщаш предишните размери. Въздъхваш от облекчение. Този път май имаше късмет.  
      `,
      choices: [
        {
          text: `Ако искаш да продължиш експериментите, върни се на 136.`,
          nextPage: 136,
        },
        {
          text: `Ако предпочиташ да не рискуваш повече, мини на 154.`,
          nextPage: 154,
        },
      ],
    },
    68: {
      text: `
      Свирепият рев на змея зад вас е толкова добър стимул за тичане, че вие спирате чак когато тунелът остава далече назад.  
      `,
      choices: [
        {
          text: ` Продължи на 81.`,
          nextPage: 81,
        },
      ],
    },
    69: {
      text: `
      Откриваш, че тревогата ти не е била напразна. Разсеяният Фърчилан е изръсил някъде един кочан царевица. 
— Край! — сърдито заявяваш ти. — Отсега нататък сам ще си нося торбата. Не ща повече чукундуртски истории! 
      `,
      choices: [
        {
          text: `Отбележи си загубата на царевицата и премини на 138. `,
          nextPage: 138,
          removeFromInventory: { item: "corn", quantity: 1 }
        },
      ],
    },
    70: {
      text: `
      — Не е моя работа, а? — обижда се таласъмът. — Махай ми се тогава от кухнята, додето не съм повикал стражата! 
Нямаш никакво желание да се срещаш със стражата, затова побързваш да напуснеш. 
      `,
      choices: [
        {
          text: `Мини на 255. `,
          nextPage: 255,
        },
      ],
    },
    71: {
      text: `
      — Шефе, аз пак ти викам, дай да наберем малко гъби — умолително се обажда Бабаитко. — Гъбата е хубаво нещо. Полезно, значи.  
 `,
      choices: [
        {
          text: `Ако този път се съгласиш да потърсите гъби, мини на 24.`,
          nextPage: 24,
        },
        {
          text: `Ако не искаш да губиш време за подобни глупости, продължи на 49.`,
          nextPage: 49,
        },
      ],
    },
    72: {
      text: `
      Поемате след блатните таласъми и скоро излизате на малко кално островче, където върху прогнил пън седи стар, съсухрен таласъм, наметнат с мухлясала мантия. Всички останали таласъми се просват по очи. 
— О, велики царю, доведохме тези хора… — започва предводителят им. 
— Чукундурти — поправя го Хухавел. 
— … тези чукундурти, защото са славни командоси, тръгнали на тайна мисия срещу Дървеняк Първи. 
— Брях! — смайва се царят на свой ред. — Значи командоси! И то тръгнали срещу Дървеняк! Добре сте ми дошли, скъпи гости! Враговете на моя враг са мои приятели. 
— Шефе! — прошепва Хухавел. — Дай да изпушим с това старче лулата на мира. Така ще закрепим добрите отношения. 
 `,
      choices: [
        {
          text: `Ако имаш лула на мира и искаш да я използваш, мини на 79. 
          `,
          nextPage: 79,
        },
        {
          text: `В противен случай продължи на 90.`,
          nextPage: 90,
        },
      ],
    },
    73: {
      text: `
— Е? — настоява министърът на разните работи. — Съгласен ли си? Кога поемаш новия пост? 
— Когато цъфнат налъмите — дипломатично отговаряш ти. 
— Добре де, ще почакаме — въздъхва министърът на другите работи и се обръща към колегата си. — Слушай, бягай да сложиш един налъм във вода, че да знаем кога ще стане… Чакай! Какво е това? 
Откъм гората долитат революционни песни и след малко чукундуртите се завръщат, мъкнейки между себе си нещастния министър-предател. 
— Дайте пинсети! — провиква се един от тях. 
— Ама чакайте! — пищи жертвата. — Нали подадох оставка! Вече не съм министър-предател! 
Аргументът му е солиден и чукундуртите се объркват. 
— Ами сега? 
— Как да му оскубем брадата, като вече не е предател? 
— Нищо бе, първо да я оскубем, пък после ще му мислим! 
— Не! Имам идея! Дайте пак да го назначим! 
— Не ща-а-а-а! — изревава министър-предателят. — Вече подадох оставка! Ако ще ме назначавате, искам да стана министър на тайните работи! 
Наоколо избухва смях. 
— Ти ли бе? Че какво разбираш ти от тайни работи? 
— Открих една голяма тайна! — доверително съобщава клетникът. — Научих плановете на Дървеняк! 
— Грънци си научил! — обажда се някой. — Баш на теб ли ще ти кажат такава тайна? 
Но личи, че тълпата е разколебана. Министър-предателят използва момента, за да се хвърли в нозете ти. 
— Чуй ме, повелителю! Чуй каква тайна научих и вярвам, че ще ме спасиш от страшната участ!  
 `,
      choices: [
        {
          text: `Мини на 142. `,
          nextPage: 142,
        },
      ],
    },
    74: {
      text: `
      Нагазвате в блатото, но щом от тинята изникват главите на блатните таласъми, твоите спътници категорично отказват да продължат напред. 
      — Ти както щеш, шефе, обаче аз се връщам обратно — заявява Хухавел. 
      — И аз — обажда се Бабаитко. 
      Е, щом дори Бабаитко не желае да рискува, ще трябва да се съобразиш с народното мнение.  
 `,
      choices: [
        {
          text: `Продължи на 205. `,
          nextPage: 205,
        },
      ],
    },
    75: {
      text: `
  Отново заставате на кръстопътя и оглеждате познатия надпис: 
НАЛЯВО АКО ТРЪГНЕШ — 
ЗА ГЪБИ ЩЕ ХОДИШ 
 
НАДЯСНО АКО ТРЪГНЕШ — 
НИКЪДЕ НЯМА ДА СТИГНЕШ 
 
НАПРАВО АКО ТРЪГНЕШ — 
ГЛАВАТА СИ ЩЕ ЗАГУБИШ 
Накъде ще тръгнеш сега?  
 `,
      choices: [
        {
          text: `Надясно — мини на 117.`,
          nextPage: 117,
        },
        {
          text: `Направо — продължи на 88.`,
          nextPage: 88,
        },
      ],
    },
    76: {
      text: `
      Хухавел грабва една главня от огъня, сръчно запалва грамадната лула и я връчва на змея. Чудовището любопитно оглежда странното творение. 
      — Това пък какво е? 
      — Ще видиш — уверява го Хухавел. — Само смукни яко. 
      — Много яко — обажда се Гадолини. — В петите да те удари. 
      Змеят засмуква и… 
      Избери продължението — 118 или 160. 
 `,
      choices: [
        {
          text: `118`,
          nextPage: 118,
        },
        {
          text: `160`,
          nextPage: 160,
        },
      ],
    },
    77: {
      text: `
      Става ти съвестно. Горките чукундурти са останали без хранителни запаси и през зимата наистина току-виж изпукали от глад. Очевидно това беше бедата, от която искаха да ги спасиш. И ти се струва, че ако беше останал при тях, таласъмите нямаше да ги ограбят. 
— Добре — кимваш ти. — Злодеянията на Дървеняк не бива да останат безнаказани. Тръгвам с вас. Но най-напред дайте да се запознаем. 
— Казвам се Гадолини и съм майстор на гадните трикове — покланя се мрачният чукундурт. — Такъв номер мога да врътна всекиму, че свят да му се завие. 
— Аз съм Бабаитко — пристъпва до него едрият чукундурт, който стърчи с две глави над останалите. — Може и да не ме бива по гадните номера, ама когото цапардосам, свитки ще му изхвръкнат от очите. 
— То не може така — обажда се до него хилав чукундурт, гушнал под мишница проскубана бяла патка. — Насилието не решава нещата. Ум трябва, ум! Аз, драги ни предводителю, се казвам Хухавел и съм най-умният чукундурт в цялото село. 
— Затова те пратиха да пасеш патките, нали? — ехидно се обажда Гадолини. 
— Че какво? — обижда се Хухавел. — То и за тая работа ум трябва. Какво като са патки, и те душа носят… 
— Добре де, не се препирайте — прекъсваш ги ти и се обръщаш към четвъртия чукундурт, който е строен и дългокрак. — А ти, младежо, с какво можеш да се похвалиш? 
— Аз съм Фърчилан — представя се той. — С ум и сила не мога да се похваля, ама умея да бягам. И това е важно, нали така? 
— Тъй, тъй — подкрепя го Гадолини. — Като стане напечено, той пръв ще си плюе на петите. 
— Тихо! — подвикваш ти. — Значи отсега нататък ние петимата сме група командоси под кодовото название „Чукундуртски отмъстители“. Обаче сигурно не сте се сетили, че за из пътя ще ни трябват провизии. 
— Абе, то… за сещане сетихме се — промърморва Фърчилан. — Ама нали таласъмите ометоха всичко. Ето с какво разполагаме. 
И той ти показва три кочана царевица. 
Бабаитко на свой ред измъква от грамадния си джоб едно цвекло. 
— Това е свещеният чукундур — шепнешком обяснява той. — Задигнах го от селския храм. Голям грях си турих на душата, ама какво да се прави — делото иска жертви. 
Кимваш и се обръщаш към другите, но Бабаитко те хваща за рамото. 
— Чакай, има и още нещо. Я гледай тук. 
 
С тия думи той измъква от другия си джоб нещо като издълбан пън, от който стърчи кух израстък. 
— Това пък какво е? — изненадваш се ти. 
— Лулата на мира — гордо отвръща той. — Знае ли човек накъде могат да избият работите? Ако решим да водим мирни преговори, ще ни трябва нещо такова. 
Сетне той се отдръпва, за да стори място на Гадолини, който измъква изпод плаща си два зрели домата. 
И накрая Хухавел триумфално ти показва вехта торба, в която е скътал едра, напращяла диня и калъп домашен сапун. 
— И сапуна ли броите към провизиите? — изненадваш се ти. 
— Като ни засвирят коремите от глад, няма къде да се дяваме. И сапун ще жвакаме — обажда се Бабаитко. 
— Не си прави майтап с хигиената! — скарва му се Хухавел. — Без сапун закъде сме? Нали трябва да си мием ръцете преди ядене. 
— Ако има какво да ядем — ухилва се Гадолини. 
— Ама и вие сте едни чукундурти! — скарваш им се ти. — Нямате никаква организация на работата. Съберете всички запаси в торбата и един да ги носи. 
Идеята обаче поражда първите разногласия в отряд „Чукундуртски отмъстители“. Всеки от четиримата ти спътници претендира за честта да носи торбата с провизиите. 
— Ум трябва за тая работа! — заявява категорично Хухавел. — Затова аз съм най-подходящ. 
— Не се ли виждаш, че си слаботелесен, бе нещастнико? — перва го по главата Бабаитко. — Аз трябва да нося торбата, защото съм най-як. 
Гадолини и Фърчилан също излагат солидни аргументи в своя полза. Чудиш се кого да избереш за тази важна задача. Дали пък сам да не носиш торбата? Но пък от друга страна… някак не върви да се превиваш под товара, а твоите подчинени да вървят с ръце в джобовете. 
Така или иначе, трябва да избереш. Отбележи кого си назначил да носи торбата, запиши подробно всички налични запаси и продължи на 244. 
— Кой ще носи торбата?
  `,
  addToInventory: [{ item: "bag", quantity: 1 },{ item: "duck", quantity: 1 }, {item: "corn", quantity: 3 }, { item: "watermelon", quantity: 1 }, {item: "tomato", quantity: 2 }, { item: "beetroot", quantity: 1 }, {item: "pipe", quantity: 1 }, {item: "soap", quantity: 1 }],
      choices: [
            { text: "Хухавел ", nextPage: 244,  bagCarrier: "Хухавел"},
            { text: "Бабаитко", nextPage: 244,   bagCarrier: "Бабаитко"},
            { text: "Фърчилан ", nextPage: 244,  bagCarrier: "Фърчилан"},
            { text: "Гадолини ", nextPage: 244,   bagCarrier: "Гадолини"},
            { text: "Самият ти ", nextPage: 244,   bagCarrier: "самият ти"},
      ],
    },
  
    78: {
      text: `
      Фърчилан поема домата и безстрашно се отправя към огъня. Щом го зърва в полумрака, едрият таласъм надава свиреп рев: 
      — Стой! Кой? 
      — Ще видиш ти кой! — отвръща Фърчилан и замахва. 
      Със сочен плясък доматът се размазва по физиономията на таласъма. Онзи скача на крака и изревава: 
      — Дръжте негодника! 
      Но Фърчилан вече тича презглава към закрилата на дърветата. Таласъмите хукват подир него и изчезват в мрака. 
      През следващите няколко минути от гората долитат само злобни крясъци и пукот на строшени вейки. Ала внезапно Фърчилан изниква пред вас и ви махва с ръка. 
      — По-бързо! Да влизаме! Заблудих ги, обаче няма да е задълго. 
  `,
      choices: [
        {
          text: `
          Премини на 139. 
          `,
          nextPage: 139,
        },
      ],
    },
    79: {
      text: `
      По твое нареждане Бабаитко пъргаво разпалва лулата на мира и я слага пред царя на блатните таласъми. Старчето любопитно оглежда димящия пън. 
— Каква е тая чудесия, драги командоси? 
— Смукни, смукни — подканва го Гадолини. — Ама яко смукни, че да те удари чак в петите. 
Царят смуква… и с оглушителна кашлица се катурва в блатото. Наоколо избухват диви крясъци: 
— Атентат! 
— Убиха ни царя! 
— Терористи! 
— Лумпени! 
— Дръжте ги! 
— Да отмъстим за негово величество! 
Сега има само един изход — да се спасявате с бягство обратно към брега. И вие хуквате през блатото, като зарязвате лулата на мира (отбележи си тази загуба). 
Но сега всичко зависи от съдбата. Избери продължението — 130 или 151. 
 
  `,
      choices: [
        {
          text: `
          130
          `,
          nextPage: 130,
        },
        {
          text: `
          151
          `,
          nextPage: 151,
        },
      ],
    },
    80: {
      text: `
  
  `,
      choices: [
        {
          text: `
          Премини на 105. 
          `,
          nextPage: 105,
        },
      ],
    },
    81: {
      text: `
      Пътят отново върви през гора, но дърветата стават все по-редки. Половин час след като сте напуснали тунела, виждате на една поляна край пътя голяма къща от бял камък.  
  `,
      choices: [
        {
          text: `
          Ако искаш да я посетите, мини на 120.
          `,
          nextPage: 120,
        },
        {
          text: `
          В противен случай продължи на 134. `,
          nextPage: 134,
        },
      ],
    },
    82: {
      text: `
      Щом хапваш парченце от зелената гъба, мигновено те обзема чувство на неописуема тежест и ти се изръсваш от дланта на Бабаитко. Резултатът от дребните размери и огромното тегло е печален — пробиваш земята и хлътваш в някаква къртичина, където слисаните чукундурти така и не успяват да те намерят. След дълго и безплодно търсене те поемат обратно към своето село. Уви, експериментите са завършили неуспешно — още дълги дни ще бродиш сред тревите, докато магията престане и постепенно си възвърнеш предишните размери. 
      Така или иначе твоето приключение завършва дотук.   `,
      choices: [],
      end: true,
    },
    83: {
      text: `
      Чудесно е, когато имаш полезен наръчник. Разгръщаш книгата и от нея узнаваш, че вълшебните гъби, които сте набрали, имат следните свойства: 
      ЖЪЛТА ГЪБА — увеличава онзи, който хапне от нея. 
      СИНЯ ГЪБА — смалява многократно консуматора си. 
      ЧЕРВЕНА ГЪБА — силно намалява теглото. 
      ЗЕЛЕНА ГЪБА — увеличава теглото. 
      ЧЕРНА ГЪБА — невероятно отровна, убива жертвата за броени минути. 
        `,
      choices: [
        {
          text: `
          Запомни добре тези свойства, а след това продължи на 220. 
          `,
          nextPage: 220,
        },
      ],
    },
    84: {
      text: `
      — Стига глупости! — викваш ти. — Да се спасяваме! 
      Ала вече е късно. Докато тичаш надолу, изведнъж усещаш как те сграбчват две огромни лапи. Сетне върху главата ти се стоварва тежък юмрук и губиш съзнание. 
        `,
      choices: [
        {
          text: `
          Премини на 21. 
          `,
          nextPage: 21,
        },
      ],
    },
    85: {
      text: `
      В първия момент слънчевите лъчи те заслепяват, тъй че не успяваш да видиш нищо. Но още преди да си направил и една крачка извън колибата, в ушите ти нахлува възторжен рев: 
      — УРРРРРРРРАААААААААА! 
      Разтъркваш очи и когато ги разтваряш, различаваш пред себе си парцалива тълпа от чукундурти. Вятърът развява над главите им опърпани знамена, хоругви и лозунги. Обаче, преди да разчетеш какво е написано по тях, цялата тълпа се бухва на колене. Най-отпред двама старци с чорлави бели бради възторжено протягат ръце към теб. 
      — Благодетелю наш! — възкликва единият. 
      — Спасителю! — приглася му вторият с глас, който скърца като несмазана врата. — Бащице наш! Слънце на чукундуртския небосклон! 
      — Чакайте малко! — объркано възразяваш ти. — Никакво слънце не съм, особено пък на чукундуртския небосклон. Обяснете ми как попаднах тук. 
      — Ами че ние те отвлякохме! — възторжено обяснява първият старец. 
      — Не бе, на гости те поканихме — бързо се намесва другият, като го смушква с лакът в ребрата. — Тъй де, скъп гост… слънце на чукундуртския… 
      — Кога сте ме поканили? — питаш отново ти. — Нещо не помня да съм ви виждал. 
      — Е, ама бива ли чак такива формалности между приятели? — ухилва се старият чукундурт. — Ако толкоз държиш — ето, сега те каним. Бъди ни скъп гост… един вид радост ненагледна… 
      — Не ни изоставяй! — жално се проточва глас откъм тълпата. 
      Нищо не разбираш. Поне едно обаче изглежда ясно — чукундуртите нямат лоши намерения. Е, отмъкнали са те през нощта, но какво да ги правиш — чукундуртска им работа. Въпросът е друг: ще се съгласиш ли да им бъдеш гост? 
        `,
      choices: [
        {
          text: `
          Да — мини на 133. 
          `,
          nextPage: 133,
        },
        {
          text: `
          Не — продължи на 179. 
          `,
          nextPage: 179,
        },
      ],
    },
    86: {
      text: `
      Измъкваш лулата на мира и я размахваш пред очите му. 
      — Виждаш ли го това? Как няма да сме мирни пътници, като носим лула на мира? 
      — Което си е вярно, вярно си е — признава таласъмът. — Ама все пак трябваше да ви проверим що за стока сте. Нали знаеш, проверката е висш израз на доверие. Не помня кой го беше казал, ама е бил умен човек. Е, хайде, вървете си по пътя. Напред става по-плитко. 
      И наистина, скоро започвате да излизате от блатото. Накъде сте се отправили всъщност? 
        `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 144. 
          `,
          nextPage: 144,
        },
        {
          text: `
          Към кръстопътя — продължи на 171.           `,
          nextPage: 171,
        },
      ],
    },
    87: {
      text: `
      — Видя се то, че нищо не можем да направим, ами хайде да вървим — подканва те Фърчилан. 
      — Чакай бе! — възразява Хухавел. — Не можем да го зарежем току-тъй! За науката е страдал, дето се вика. Дайте поне да му оставим провизиите, че да не умре от глад. 
      — Всичките ли? — трепва Бабаитко. 
      — Всичките! — категорично отговаря Хухавел. — Ние все ще намерим нещо за ядене, ама този клетник… 
        `,
      choices: [
        {
          text: `
          Ако си съгласен да оставите всичките си провизии на Мишемориус, мини на 135. 
          `,
          nextPage: 135,
        },{
          text: `
          Ако не искаш да го сториш, продължи на 168. 
          `,
          nextPage: 168,
        },
      ],
    },
    88: {
      text: `
      След кратко колебание посочваш напред. 
— Ама недей така, бе шефе! — жално се обажда Хухавел. — Нали видя какво пише — главите си ще загубим. 
— За пораженческа пропаганда при военно положение се полага смърт чрез обесване — сплашва го Гадолини и Хухавел млъква. 
Около половин час вървите през вековна гора, но ненадейно пътят започва да слиза надолу. След малко пред вас се появява входът на мрачен тунел. Гората наоколо е непроходимо гъста, тъй че подземието е единственият път напред. 
Влизали ли сте вече в това подземие? 
        `,
      choices: [
        {
          text: `
          Да — мини на 116.  
          `,
          nextPage: 116,
          visitedPages: 116,
        },{
          text: `
          Не — продължи на 97. 
          `,
          nextPage: 97,
        },
      ],
    },
    89: {
      text: `
      Свирепият рев на змея зад вас е толкова добър стимул за тичане, че вие не спирате додето не стигате на кръстопътя. 
        `,
      choices: [
        {
          text: `
          Продължи на 131. 
          `,
          nextPage: 131,
        },
      ],
    },
    90: {
      text: `
      — Трай си! — прошепваш ти на Хухавел и се обръщаш към царя. — Изненадвате ме, ваше величество. Как тъй Дървеняк да ви е враг? Нали сте все таласъми, една кръв, дето се вика. 
      — Да, ама ние сме ВОДНИ таласъми! — натъртва старчето. — А пък Дървеняк ненавижда водата. Впрочем, забравих, че сте чужденци. Чуйте, драги командоси, страшната тайна на Дървеняковия род. Всички в този род са прокълнати да умрат от вода. И баща му така умря — като се захвана да спира горските извори. А на Дървеняк му е предречено, че ще издъхне моментално, ако го поръси и капка вода. Затова измисли всички тия глупости със сухата вода. Ама и Мишемориус е виновен, дето му се поведе по акъла. Уж е умен чародей, пък тръгнал да другарува с Дървеняк. 
        `,
      choices: [
        {
          text: `
          Добре е да запомниш тази страшна тайна. След това премини на 115. 
          `,
          changeSecret: { show: true},
          nextPage: 115,
        },
      ],
    },
    91: {
      text: `
      Още щом влизаш в колибата, разбираш какво са имали предвид, като говореха за централно отопление — огнището се намира точно в средата. Усмихваш се, свиваш рамене и се приготвяш за сън. 
      Леглото е кораво, а завивките вехти и парцаливи, но един юнак като теб не обръща внимание на подобни дреболии. Призори се събуждаш бодър и свеж. 
        `,
      choices: [
        {
          text: `
          Мини на 155. 
          `,
          nextPage: 155,
        },
      ],
    },
    92: {
      text: `
      — Какво можеш да сториш с това килимче, жалка твар? — хили се Дървеняк и връхлита насреща ти. — Сега ще те убия собственоръчно! 
      Светкавично хвърляш дупката пред него… и царят на таласъмите пропада през пода на залата. Изглежда, че отдолу е имало подземна река, защото от дълбините долита цамбуркане, отчаян писък… а сетне настава тишина. Сбъдна се древното предсказание (за което може да си чувал, а може и да не си) — че Дървеняк ще умре от вода. 
        `,
      choices: [
        {
          text: `
          Продължи на 295. 
          `,
          nextPage: 295,
        },
      ],
    },
    93: {
      text: `
      — Ей, язък! — тюхка се таласъмът. — Веднъж и ние да видим живи командоси, пък то… Ама вие сигурно бързате, щом имате толкова важна мисия. Е, здраве да е. Вървете напред, оттук нататък става по-плитко. 
      И наистина, скоро започвате да излизате от блатото. Но накъде сте се отправили всъщност? 
        `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 144. 
          `,
          nextPage: 144,
        },{
          text: `
          Към кръстопътя — продължи на 171. 
          `,
          nextPage: 171,
        },
      ],
    },
    94: {
      text: `
      Фърчилан урежда нещата напълно по чукундуртски. Пристъпва напред, грабва нещо от купчината и хуква да бяга с мълниеносна бързина, следван от възмутените крясъци на старчето. (Когато на връщане го откриете в клисурата, ще се окаже, че е задигнал кривия макарон.) 
      — Ама вие май сте крадци! — навъсва се старчето, след като спира да крещи. 
      — Не сме! — възразява Гадолини. — Онзи негодник вече не е наш. Заклеймяваме го, значи, за морално разложение и го изключваме от редовете си. 
      — Дано, дано — промърморва старчето, после се обръща към теб. — Хайде, ела да правим търговия като хората. И вече без номера, че ако се ядосам лошо ще стане. 
      — Слушай, шефе, нека аз да опитам — прошепва ти Гадолини. — Голям съм търговец, значи! Да видиш само каква далавера ще извъртя! 
        `,
        addToInventory: [{ item: "macaron", quantity: 1 }],
      choices: [
        {
          text: `
          Ако му разрешиш да води сделката, мини на 47. 
          `,
          nextPage: 47,
        },
        {
          text: `
          Ако предпочиташ сам да търгуваш, продължи на 119. 
          `,
          nextPage: 119,
        },{
          text: `
          А ако търговията повече не те интересува, прехвърли се на 158. 
          `,
          nextPage: 158,
        },
      ],
    },
    95: {
      text: `
      Хухавел свива рамене. 
      — Е, щом е така, нищо не мога да направя. 
      Лоша работа! Ако не искате да бъдете изядени, някой трябва да се справи със змея. На кого ще се довериш? 
        `,
      choices: [
        {
          text: `
          На Бабаитко — мини на 166. 
          `,
          nextPage: 118,
        },{
          text: `
          На Гадолини — попадаш на 198. 
          `,
          nextPage: 118,
        },{
          text: `
          На Фърчилан — прехвърли се на 214. 
          `,
          nextPage: 118,
        },
      ],
    },
    96: {
      text: `
      — Бащице! — отчаяно изревава министърът на разните работи, когато чува решението ти. — Недей така, бе! Нали ще изпукаме от глад! 
      — Да мълчиш, че инак ще идеш при мишките! — заплашваш го ти и той покорно млъква. 
      Отсреща старшият таласъм се обръща към своите подчинени и надава пронизителен крясък: 
      — Рота-а-а-а, миррррррно! Слушай моята команда! За разграбване на чукундуртското село — бего-о-о-ом марш! 
      И ордата таласъми се втурва напред. 
      Един час по-късно селото е разграбено до последната трошица. Таласъмите се оттеглят, прегърбени под тежестта на кошове, кошници, бохчи, денкове, вързопи, делви, дамаджани и бъчонки. Постепенно чукундуртите почват да се измъкват от скривалищата си. Питаш се какво ли ще кажат за решението ти да ги изоставиш на таласъмския произвол. Но за твоя голяма изненада всички се зъбят и плюят не срещу теб, а срещу министър-предателя. 
      — Пу! Не те е срам! 
      — И това ми било министър! 
      — Предател на националните идеали! 
      — Ренегат! 
      — Ама чакайте! — изпищява министър-предателят, понеже вижда, че става напечено. — Аз… такова… 
      — Никакво такова! 
      — Дайте да му оскубем брадата! — предлага някой. — Косъм по косъм! 
      — Да я оскубем! — единодушно изревава тълпата. — Той е виновен! 
      Хубава работа! Ще се намесиш ли, за да отървеш нещастника от неприятната съдба, която му се готви? 
        `,
      choices: [
        {
          text: `
          Да — мини на 127. 
          `,
          nextPage: 127,
        },{
          text: `
          Не — продължи на 161. 
          `,
          nextPage: 161,
        },
      ],
    },
    97: {
      text: `
      Чукундуртите боязливо протягат шии и се взират напред в мрака. 
      — Казвах ви аз — промърморва Хухавел. — Тук ще ни изгният костите. 
        `,
      choices: [
        {
          text: `
          Ако поведеш чукундуртите напред по тунела, мини на 110. 
          `,
          nextPage: 110,
        },{
          text: `
          Ако предпочиташ да се върнеш назад, попадаш на 122. 
          `,
          nextPage: 122,
        },
      ],
    },
    98: {
      text: `
      Гъбите наистина изглеждат вълшебни. По принцип това е полезна находка, но за съжаление няма как да узнаеш качествата им. Освен ако… решиш да проведеш експеримент. 
      Възможностите са две — или да използваш за опитно животно патката на Хухавел (ако все още е с вас), или да изпробваш гъбите върху себе си. Колкото до чукундуртите, те категорично отказват да хапнат и парченце. 
      И тъй, какво ще решиш? 
        `,
      choices: [
        {
          text: `
          Експеримент с патката — мини на 123. 
          `,
          requiresItem: { item: "duck", quantity: 1 },
          nextPage: 123,
        },{
          text: `
          Експеримент върху себе си — продължи на 136. 
          `,
          nextPage: 136,
        },{
          text: `
          Не искаш да рискуваш — прехвърли се на 154. 
          `,
          nextPage: 154,
        },
      ],
    },
    99: {
      text: `
      Когато се разсъмва, ти отново поемаш през пущинака и изведнъж спираш поразен. Между дърветата пред теб се мержелее… селото на чукундуртите. Май вчера цял ден си обикалял в кръг. 
      Нямаш желание да се появяваш безславно в селото. Но за твой късмет откъм колибите се задават четирима млади чукундурти. Когато наближават, ти излизаш насреща им и размахваш ръка. 
      — Добра среща! 
      — Абе, не е много добра, ама щом си рекъл… — промърморва единият от тях, дребен чукундурт с мрачна физиономия и дрипаво черно наметало. 
      — Защо? — изненадваш се ти. — Да не е станало нещо? 
      — Много неща станаха — отвръща друг чукундурт, който стиска под мишница бяла патка. — След като ти си тръгна, дойдоха таласъмите и обраха де каквото имаше за ядене в селото. 
      — И сега ще изпукаме от глад — жално се обажда най-едрият в групата. 
      — Чакай, чакай — намесва се четвъртият, мършав и дългокрак. — То това не е най-важното. Друго има. Таласъмите рекоха, че техният цар Дървеняк Първи… 
      — Какъв Дървеняк? — трепваш ти. — Да не бъркаш нещо? Имаше навремето един Тиквеняк Първи, ама той отдавна замина в небитието. 
      — Не ме прекъсвай — сопва се чукундуртът. — Дървеняк е негов син и се е обявил за цар на таласъмите. Даже е изградил нов замък, обаче под земята, та да не се открива лесно. Чакай сега, докъде бях стигнал? Видя ли как ме обърка! А, да! Дървеняк Първи си е осигурил подкрепата на великия чародей Мишемориус. А Мишемориус е изобретил страшно нещо — суха вода. Даже направил голяма машина за нейното производство и сега я монтирали в замъка на Дървеняк Първи. Щом заработела тая машина, цялата гора щяла да изсъхне. 
      Гледай ти! Значи Дървеняк е решил да осъществи зловещите планове на баща си. Пустите му таласъми — не мирясват и това си е! 
      — А вие накъде сте тръгнали? — питаш ти. 
      — Ами… такова… — смутено отговаря едрият чукундурт. — Другите в селото само се вайкат, ама ние решихме да тръгнем по дирите на таласъмите. Ще открием замъка и ще му разкажем играта на Дървеняк. Ама ха! Суха вода щял да прави, сухарът му със сухар! 
      — Слушай, защо не ни станеш командир? — въодушевено предлага онзи с патката. — Ще станем боен отряд и ще се наречем „Чукундуртски отмъстители“. 
        `,
      choices: [
        {
          text: `
          Ако се съгласиш да тръгнеш на опасния поход срещу таласъмите, мини на 77. 
          `,
          nextPage: 77,
        },{
          text: `
          Ако откажеш, продължи на 39. 
          `,
          nextPage: 39,
        },
      ],
    },
    100: {
      text: `
      Таласъмът незабавно грабва царевицата и започва да я хрупа както е сурова. 
      — Ей, много кораво бе! — мръщи се той. — Ама хайде, от мен да мине. Наливайте си вода и изчезвайте. 
        `,
      choices: [
        {
          text: `
          Напълваш съдинката си с вода и преминаваш на 177. 
          `,
          nextPage: 177,
        },
      ],
    },
    101: {
      text: `
      С храбростта на отчаянието отхапваш от жълтата гъба. Тутакси по тялото ти пробягва сърбеж… и изведнъж се увеличаваш десетократно. 
      — Ама какви ги правиш, бе шефе? — вайка се Хухавел. — И преди не можехме да те помръднем, а пък сега — хич. 
      Не ти остава друг избор, освен да продължиш с експериментите. Каква гъба ще изпробваш сега? 
        `,
      choices: [
        {
          text: `
          Червена — попадаш на 146. 
          `,
          nextPage: 146,
        },{
          text: `
          Синя — прехвърли се на 167. 
          `,
          nextPage: 167,
        },{
          text: `
          Черна — отгърни на 53. 
          `,
          nextPage: 53,
        },
      ],
    },
    102: {
      text: `
      — Е, убедихте ме — уморено казваш ти. — А сега край на празните приказки! Обяснете как стоят нещата. Нали едно време бяхте съюзници с таласъмите. Защо сега се боите от тях? 
      — Че бяхме съюзници, бяхме — признава министърът на другите работи. — Обаче като рухна техният замък, решихме да развалим съюза. 
      — И да станем честни — обажда се министър-предателят. 
      — Ти трай, предател такъв! — прекъсва го министърът на разните работи. — Туй аз щях да го кажа, честността е от моята компетенция… Станахме честни, значи, и вече не крадем. 
      — Само от време на време, колкото да не е без хич — уточнява министърът на другите работи. — И лъжем само на нечетни дати. Щото „нечетни“ звучи почти като „нечестни“. Ама иначе станахме съвсем почтени чукундурти и не вървеше да другаруваме с таласъмите. 
      — А пък сега те ни заплашват — жално се обажда министър-предателят. — Искат да им предадем всичките си хранителни запаси. 
      — И като дойде зимата, ще изпукаме от глад — проплакват в хор другите двама министри. 
      Навъсваш се. Работата става сериозна. 
      — И кога трябва да им предадете всичките си запаси? 
      — Ами че днес — бързо отговаря министърът на разните работи. — Точно по пладне. Нали затуй те открад… такова де, поканихме на гости. 
      — Обаче ти ще ни спасиш, нали? — обажда се министър-предателят с глас на професионален подмазвач. — Ти си най-великият юнак по тия земи. Потомците песни ще пеят за теб! 
      Не знаеш дали ще пеят песни за теб. Ясно е само едно: днес по пладне чукундуртите ще си имат големи неприятности. А заедно с тях и ти, след като прие да им станеш министър. 
        `,
      choices: [
        {
          text: `
          Премини на 51. 
          `,
          nextPage: 51,
        },
      ],
    },
    103: {
      text: `
      — Нямам с какво да ти докажа, добри ми таласъме — отвръщаш ти. — Имаш само честната ми дума. 
      Таласъмът се колебае още малко, после махва с ръка. 
      — Хайде, от мен да мине. Пък друг път ако имате път насам, да си носите удостоверение, че сте мирни. Надлежно подписано и подпечатано от съответните власти. Нищо де, сега си вървете по пътя. Напред става по-плитко. 
      И наистина, скоро започвате да излизате от блатото. Но накъде сте се отправили всъщност? 
        `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 144. 
          `,
          nextPage: 144,
        },{
          text: `
          Към кръстопътя — продължи на 171. 
          `,
          nextPage: 171,
        },
      ],
    },
    104: {
      text: `
      Жалко, но така и няма да узнаеш какви свойства имат вълшебните гъби. Нищо де, здраве да е… 
        `,
      choices: [
        {
          text: `
          Продължи на 220. 
          `,
          nextPage: 220,
        },
      ],
    },
    105: {
      text: `
      Тревогата ти обаче се оказва напразна. С провизиите всичко е наред.   `,
      choices: [
        {
          text: `
          Можеш спокойно да продължиш на 138.          `,
          nextPage: 138,
        },
      ],
    },
    106: {
      text: `
      Докато се колебаеш какво да направиш, върху твоя отряд се нахвърлят десетки, може би стотици таласъми и въпреки отчаяната съпротива след броени минути се озовавате в тясна и мрачна килия. 
  `,
      choices: [
        {
          text: `
          Продължи на 285.  `,
          changeCondition: { jailed: true},
          nextPage: 285,
        },
      ],
    },
    107: {
      text: `
      Отчупваш малко парченце от жълтата гъба и го поднасяш пред човката на патката. Кротката птица с удоволствие поглъща угощението… и мигновено израства до грамадни размери. 
      — Въх! — възкликва Гадолини и отскача назад. — Чудовище! 
      — Пати-пати-пати — боязливо протяга ръка напред Хухавел. — Ела при батко да те погали. 
      Патката извива глава на една страна, оглежда го внимателно и изведнъж посяга да го клъвне. С писък на ужас Хухавел хуква да бяга, сподирен от останалите чукундурти. Побягваш и ти, защото нямаш никакво желание да се превърнеш в храна за патици. 
      Когато прекратявате бягството, патката е изчезнала нейде из гората. 
      — Отиде ми горкото хайванче! — вайка се Хухавел. 
      — Я да мълчиш, че ще ти опаля един по канчето! — сопва се Бабаитко. — Хайванче! То цяла годзила… 
      — Шефе, аз спасих гъбите — обажда се Гадолини. — С риск за живота си, значи. 
      Е гъбите са налице, обаче въпросът е дали ще посмееш да ги изпробваш върху себе си. Ако поемеш този риск, мини на 136. 
      Ако предпочиташ да не го правиш, продължи на 154. 
        `,
        removeFromInventory: { item: "duck", quantity: 1 },
      choices: [
        {
          text: `
          118
          `,
          nextPage: 118,
        },
      ],
    },
    108: {
      text: `
      Изпроводени от благодарния змей, вие бодро се отправяте към кръстопътя. 
        `,
      choices: [
        {
          text: `
          Продължи на 131. 
          `,
          nextPage: 131,
        },
      ],
    },
    109: {
      text: `
      Колибата се оказва мизерна и тясна. Леглото е кораво, а завивките вехти и парцаливи, но един юнак като теб не обръща внимание на подобни дреболии. Лягаш да спиш и призори се събуждаш бодър и свеж. 
              `,
      choices: [
        {
          text: `
          Мини на 155. 
          `,
          nextPage: 155,
        },
      ],
    },
    110: {
      text: `
      Събираш кураж и повеждаш дружината си напред в мрака. Впрочем, тъмнината не е съвсем пълна — тук-там в свода на тунела са пробити отдушници и през тях проникват бледи лъчи. Бавно и предпазливо крачите по неравния под, отрупан с паднали камъни. Ала ненадейно пред вас се надига грамаден силует, който почти запълва тунела. Две огнени очи просветват в мрака и прокънтява страховит рев: 
      — Не мърдайте! Сега ще ви изям! 
      — Да бягаме, шефе! — виква Хухавел. 
      — Как тъй ще бягаме? — възразява Бабаитко. — С какво право ще ме плаши това добиче? Като му опаля един по кофата, ще види то кого ще яде! 
      Чие мнение ще послушаш? 
        `,
      choices: [
        {
          text: `
          На Хухавел — мини на 124. 
          `,
          nextPage: 124,
        },{
          text: `
          На Бабаитко — продължи на 147. 
          `,
          nextPage: 147,
        },
      ],
    },
    111: {
      text: `
      Прибираш вълшебните гъби и махваш с ръка на чукундуртите. 
      — Хайде да тръгваме, че кой знае още колко път ни чака. 
        `,
      choices: [
        {
          text: `
          Премини на 172. 
          `,
          nextPage: 172,
        },
      ],
    },
    112: {
      text: `
      Отхапваш от червената гъба със страх, но този път явно си имал късмет, защото след броени секунди си възвръщаш предишната лекота. 
        `,
      choices: [
        {
          text: `
          Ако искаш да продължиш експериментите, върни се на 136.  
          `,
          nextPage: 136,
        },{
          text: `
          Ако предпочиташ да не рискуваш повече, мини на 154.       
          `,
          nextPage: 154,
        },
      ],
    },
    113: {
      text: `
      Гадолини поема бурканчето, после подава глава от храстите и надава заплашителен вик: 
      — Предайте се! Обкръжени сте! Ако до трийсет секунди не обявите капитулация, ще ви обстрелваме с лазерно оръжие! 
      — Лъжеш! — виква в отговор едрият таласъм. 
      — Тъй ли? — озъбва се Гадолини. — Я пратете някой да види с очите си! 
      След дълго препиране таласъмите избутват към вас най-дребния. Той боязливо пристъпва напред, присвива очи и се взира в бурканчето, което Гадолини му пъхва под носа. После уплашено виква: 
      — Абе, тука нещо лази! 
      — Знаех си аз! — изпищява едрият таласъм. — Ще ни обстрелват с лазери! Бягайте да бягаме! 
      След пет секунди от таласъмите няма и следа, само откъм горския мрак долита пукотът на строшени вейки. 
      — Видяхте ли какъв номер им врътнах? — гордо се ухилва Гадолини. — Хайде сега да влизаме. 
        `,
      choices: [
        {
          text: `
          Мини на 219. 
          `,
          nextPage: 219,
        },
      ],
    },
    114: {
      text: `
      — Тихо! — решително се провикваш ти. — Тая работа няма да стане! 
      Водачът на таласъмите заплашително се изпъчва пред теб. Обзема те страх, но знаеш много добре, че не бива да отстъпваш. Трябва да ги сплашиш, иначе работите ще тръгнат зле. 
      — Ти пък кой си? — пита таласъмът. 
      Въпреки тревогата, ти намираш сили да се разсмееш. 
      — Питаш кой съм, нещастнико! Аз съм онзи, който освободи горските извори! Онзи, който победи самия Тиквеняк и разруши гнусното ви свърталище! 
      — Въх! — възкликва някой от таласъмите. 
      — Ако не се откажете незабавно от нахалните си претенции, ще ви покажа къде зимуват раците! — приключваш ти и гордо скръстваш ръце. 
      Слисаният таласъм прави крачка назад и обръща глава към подчинените си. 
      — Някой да знае къде зимуват раците? 
      — Не питай, шефе, че по-лошо ще стане! — подвиква писклив глас от задните редици. — Чини ми се, че няма да е приятно място. Я по-добре да си ходим. 
      — Млък! — яростно изревава старшият таласъм. — Тук аз заповядвам. Мирррррно! Слушай моята команда! На когото му е мила кожата — към гората бегом ма-а-а-а-арш! 
      Личи си, че таласъмите са дисциплиниран отряд. Още преди да е заглъхнал викът на командира, всички се втурват презглава към гората. Изпровождаш ги с поглед и въздъхваш от облекчение. Ала нещо ти подсказва, че събитията не са приключили. 
      И наистина. След малко от храстите се подава един таласъм. Той размахва клечка, върху която е завързана мръсна кърпа, после боязливо тръгва през ливадата. 
      — Хей, аз съм парламентьор! — подвиква таласъмът отдалече. — Нали виждате бялото знаме? 
      — На мен ми прилича на сиво, но нейсе — отвръщаш ти. — Казвай каквото имаш за казване, че ми омръзна да се разправям с таласъми. 
      — Слушай сега — намига таласъмът и леко те побутва с лакът в ребрата. — Дай да уредим далаверата, а? Ти ни пускаш да разграбим селото, а пък ние все някак ще се отблагодарим. Твоето не се губи, брато! 
      — Я да ми се губиш от очите! — ядосано възкликваш ти и вдигаш ръка. 
      Таласъмът светкавично отскача на десетина крачки и се озъбва: 
      — Тъй, а! Ще биеш парламентьор! Ние с добро, пък той… Ама ще видиш ти! Само да знаеш какво е намислил негово величество Дървеняк Първи! От тая гора и един пън няма да остане. Да те видим после какво ще правиш! 
      И понеже замахваш отново, таласъмът захвърля парцала и побягва към гората. 
      — Благодетелю наш! — изревава министърът на разните работи и се втурва да целува едната ти ръка, докато колегата му е сграбчил другата. — Ама ти наистина ги прогони! Благословена да е десницата ти! 
      — И левицата! — обажда се министърът на другите работи. 
      — И целият организъм — обобщава министър-предателят, който по липса на друго се е захванал с краката ти. 
      Скарваш им се и ги буташ настрани, но не можеш да удържиш усмивката си. Първият тур от преговорите е завършил в твоя полза. 
         `,
      choices: [
        {
          text: `
          Мини на 149.
          `,
          nextPage: 149,
        },
      ],
    },
    115: {
      text: `
      След още малко любезни приказки със стария цар ти се сбогуваш и повеждаш дружината си към отсрещния бряг. Блатото постепенно става все по-плитко и най-сетне стъпвате на твърда земя. 
        `,
      choices: [
        {
          text: `
          Ако отивате напред, където би трябвало да е замъкът на таласъмите, мини на 144. 
          `,
          nextPage: 144,
        },{
          text: `
          Ако сте се отправили обратно към кръстопътя, продължи на 171. 
          `,
          nextPage: 171,
        },
      ],
    },
    116: {
      text: `
      А какви са отношенията ви със змея? 
        `,
      choices: [
        {
          text: `
          Добри — мини на 143. 
          `,
          nextPage: 143,
        },{
          text: `
          Не твърде добри — продължи на 162. 
          `,
          nextPage: 162,
        },
      ],
    },
    117: {
      text: `
      Минавал ли си вече по този път? 
      `,
      choices: [
        {
          text: `
          Да — продължи на 152.  
          `,
          nextPage: 152,
        },{
          text: `
          Не — прехвърли се на 174. 
          `,
          nextPage: 174,
        },
      ],
    },
    118: {
      text: `
      Змеят разтваря огромната си паст и пуска облак зловонен пушек. След това с недоумение поглежда Хухавел. 
      — И какво? 
      — Как какво, как какво! — вълнува се Хухавел. — Не разбра ли какъв номер се получи? Може и да не си огнедишащ, но гледай само каква пушилка вдигаш с тая чудесия. Като я видят, всички ще бягат презглава. 
      — Вярно бе! Брей, имало умни хора… пардон, умни чукундурти на тоя свят. Да сте живи и здрави, скъпи приятели. Хайде, вървете си със здраве. Срамота ще е да ви ям след такава услуга. 
      Отбележи си, че лулата остава при змея. А след това повеждаш своята дружина… накъде впрочем? 
            `,
            removeFromInventory: { item: "pipe", quantity: 1 },
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 81. 
          `,
          nextPage: 81,
        },{
          text: `
          Към кръстопътя — продължи на 108.
          `,
          nextPage: 108,
        },
      ],
    },
    119: {
      text: `
      — Виж сега как ще уредим нещата — казва старчето. — И ти нямаш пари, и аз нямам. Обаче, за да вървят нещата, всеки ще си определи цената на стоките, пък после ще ги разменяме. 
      И след дълъг пазарлък двамата се споразумявате за следния ценоразпис: 
      ТВОИ СТОКИ: 
      ДОМАТ — 1 грош 
      КОЧАН ЦАРЕВИЦА — 2 гроша 
      ЧУКУНДУР (ЦВЕКЛО) — 3 гроша 
      САПУН — 4 гроша 
      ДИНЯ — 5 гроша 
      ЛУЛА НА МИРА — 8 гроша 
      ПАТКА (макар че Хухавел отчаяно протестира срещу нейното включване в сделката) — 12 гроша 
      СТОКИ НА СТАРЧЕТО 
      КРАТУНКА — 1 грош. 
      ОГЛЕДАЛЦЕ — 3 гроша. 
      КРИВ МАКАРОН — 2 гроша. 
      ПРЕНОСИМА ДУПКА (защото всъщност навитото килимче се оказва точно това) — 5 гроша. 
      КНИЖКА „ВЪЛШЕБНИТЕ ГЪБИ ПО НАШИТЕ ЗЕМИ“ — 2 гроша. 
      СТОНОЖКА В БУРКАНЧЕ — 1 грош. 
      ШИШЕНЦЕ С УНИВЕРСАЛЕН РАЗТВОРИТЕЛ — 2 гроша. 
      ШИШЕНЦЕ СЪС СУХА ВОДА — 2 гроша. 
      ВЕХТИ ПАНТАЛОНИ — 1 грош. 
      УСУКАНА ДЖАДЖА — 4 гроша. 
      Естествено, в зависимост от предишните събития може някои стоки да не са налице. Това знаеш най-добре самият ти. А и не е задължително да продаваш всичко, с което разполагаш — може тепърва да ти потрябва. Така или иначе, сега остава да проведеш сделката, а след като запишеш какво си придобил, ще трябва да минеш на 158, за да поведеш отряда си обратно към кръстопътя.  `,
      choices: [
        {
          text: `
          158
          `,
          nextPage: 158,
        },
      ],
    },
    120: {
      text: `
      Посещавал ли си вече тази къща? 
        `,
      choices: [
        {
          text: `
          Да — мини на 137.
          `,
          nextPage: 137,
        },{
          text: `
          Не — продължи на 150.           `,
          nextPage: 150,
        },
      ],
    },
    121: {
      text: `
      — Няма да стане тая работа! — решително заявяваш ти и пред слисаните погледи на министрите излизаш от колибата. 
      Ала отвън те чакат жалните чукундуртски тълпи. Усетили накъде отиват нещата, те надават отчаян вой: 
      — Бащице… 
      — Слънце на чукундуртския небосклон… 
      — Закъде сме без теб?… 
      — Като слънцето и въздуха… 
      — Убий ни, но не си тръгвай… 
      Май трудно ще си пробиеш път през опечаленото множество. 
        `,
      choices: [
        {
          text: `
          Ако решиш да се върнеш в колибата и да приемеш предложението, мини на 19. 
          `,
          nextPage: 19,
        },{
          text: `
          Ако държиш на всяка цена да се измъкнеш от чукундуртското село, продължи на 65.          `,
          nextPage: 65,
        },
      ],
    },
    122: {
      text: `
      — Право да ви кажа, и на мен не ми харесва тая дупка — въздъхваш ти. — Хайде да си вървим. 
      Видимо ободрени, чукундуртите поемат след теб обратно. Но накъде е това „обратно“? 
        `,
      choices: [
        {
          text: `
          Към кръстопътя — мини на 131. 
          `,
          nextPage: 131,
        }, {
          text: `
          Към бялата къща — продължи на 81. 
          `,
          nextPage: 81,
        },
      ],
    },
    123: {
      text: `
      — Ама как тъй, шефе! — изпищява Хухавел, когато узнава за решението ти. — Ще умориш горкото хайванче! 
      — Трай бе, стипца такава! — скарва му се Фърчилан. — Ама че диване! Хората живота си дават за правото дело, пък на него една патка му се свиди. 
      — Лесно ти е на теб — хленчи Хухавел. — Нали нищо не ти взимат… 
      Така или иначе съпротивата му е сломена и той мрачно сяда настрани. А сега е време да решиш каква гъба ще дадеш на патката. 
      Синя — продължи на 140. 
      Червена — попадаш на 164. 
      Зелена — прехвърли се на 176. 
      Черна — отгърни на 193.  `,
      choices: [
        {
          text: `
          Жълта — мини на 107. 
          `,
          nextPage: 118,
        },{
          text: `
          118
          `,
          nextPage: 118,
        },{
          text: `
          118
          `,
          nextPage: 118,
        },{
          text: `
          118
          `,
          nextPage: 118,
        },{
          text: `
          118
          `,
          nextPage: 118,
        },
      ],
    },
    124: {
      text: `
      Храбростта е хубаво нещо, но не и когато си изправен пред чудовищен звяр в подземие с един-единствен изход. Затова тичешком повеждаш дружината си обратно… но накъде впрочем е това „обратно“?
      `,
      choices: [
        {
          text: `
          Към бялата къща — мини на 68.
          `,
          nextPage: 68,
        },{
          text: `
          Към кръстопътя — продължи на 89.
          `,
          nextPage: 89,
        },
      ],
    },
    125: {
      text: `
      Щом хапваш парченце от синята гъба, мигновено се смаляваш като мравка и изчезваш пред смаяните погледи на чукундуртите. А резултатът от дребните размери и огромното тегло е печален — пробиваш земята и хлътваш в някаква къртичина, където слисаните чукундурти така и не успяват да те намерят. След дълго и безплодно търсене те поемат обратно към своето село. Уви, експериментите са завършили неуспешно — още дълги дни ще бродиш сред тревите, докато магията престане и постепенно си възвърнеш предишните размери. 
      Така или иначе твоето приключение завършва дотук.
      `,
      choices: [
        {
          text: `
          Към началото — мини на 1.
          `,
          nextPage: 1,
        }
      ],
    },
    126: {
      text: `
      Фърчилан поема динята и безстрашно се отправя към огъня. Щом го зърва в полумрака, едрият таласъм надава свиреп рев: 
      — Стой! Кой? 
      — Ще видиш ти кой! — отвръща Фърчилан, после вдига динята с две ръце и замахва. 
      Със звучно пращене зрелият плод се разбива в главата на таласъма и по физиономията му плъзва лепкав сок. Онзи скача на крака и изревава: 
      — Дръжте негодника! 
      Но Фърчилан вече тича презглава към закрилата на дърветата. Таласъмите хукват подир него и изчезват в мрака. 
      През следващите няколко минути от гората долитат само злобни крясъци и пукот на строшени вейки. Ала внезапно Фърчилан изниква пред вас и ви махва с ръка. 
      — По-бързо! Да влизаме! Заблудих ги, обаче няма да е задълго. 
      `,
      choices: [
        {
          text: `
          Премини на 139.
          `,
          nextPage: 139,
        }
      ],
    },
    127: {
      text: `
      С няколко скока се озоваваш пред разгневената тълпа и разперваш ръце. 
      — Стойте! Той не е виновен! 
      — Не съм, не съм! — потвърждава министър-предателят, след като се е сгушил на сигурно място зад гърба ти. — Даже напротив, сторих велико добро на целия чукундуртски народ. Открих една голяма тайна — какви са плановете на Дървеняк! 
      — Грънци си научил! — обажда се някой. — Баш на теб ли ще ти кажат такава тайна? 
      Но личи, че тълпата е разколебана. Министър-предателят използва момента, за да се хвърли в нозете ти. 
      — Чуй ме, повелителю! Чуй каква тайна научих и вярвам, че ще ме спасиш от страшната участ! 
      `,
      choices: [
        {
          text: `
          Мини на 142.
          `,
          nextPage: 142,
        }
      ],
    },
    128: {
      text: `
      — С какво мога да ви услужа, спасители мои? — бодро пита Мишемориус. — Не ми остана нищо, с което да възнаградя доблестната ви постъпка. Проклетите таласъми всичко разграбиха. 
      Забелязваш в ъгъла да се търкаля празна кратунка. Ако искаш, можеш да я вземеш, чародеят няма да има нищо против. 
      Имаш ли вълшебни гъби? 
      `,
      addToInventory: { item: "groud", quantity: 1 },
      choices: [
        {
          text: `
          Да — мини на 156.
          `,
          nextPage: 156,
        },{
          text: `
          Не — продължи на 183.
          `,
          nextPage: 183,
        }
      ],
    },
    129: {
      text: `
      — Нямам с какво да ти докажа, добри ми таласъме — отвръщаш ти. — Имаш само честната ми дума. 
      Таласъмът се навъсва. 
      — Ама че народ се е навъдил! Марш назад, като нямате доказателства! Тук не пускаме съмнителни типове като вас. Пък друг път, ако имате път насам, да си носите удостоверение, че сте мирни. Надлежно подписано и подпечатано от съответните власти. 
      Явно е, че таласъмите няма да ви пуснат.  
      `,
      choices: [
        {
          text: `
          Ако решиш, че е най-разумно да се върнете, мини на 205.          `,
          nextPage: 205,
        },{
          text: `
          Ако искаш да си пробиете път напред с бой, продължи на 41.
          `,
          nextPage: 41,
        }
      ],
    },
    130: {
      text: `
      С отчаян бяг се измъквате на твърда земя. Блатните таласъми ви изпращат с подигравателни крясъци. Нищо де, нека викат колкото си щат. Важното е, че им се изплъзнахте. 
      Няма как, не успяхте да минете блатото и трябва да поемете обратно. В коя посока е това? 
      `,
      choices: [
        {
          text: `
          Към кръстопътя — мини на 171.
          `,
          nextPage: 171,
        },{
          text: `
          Към сливането на левия и средния път — продължи на 144.
          `,
          nextPage: 144,
        }
      ],
    },
    131: {
      text: `
      Ето че отново сте на кръстопътя и оглеждате познатия надпис: 
      НАЛЯВО АКО ТРЪГНЕШ — 
      ЗА ГЪБИ ЩЕ ХОДИШ
      
      НАДЯСНО АКО ТРЪГНЕШ — 
      НИКЪДЕ НЯМА ДА СТИГНЕШ
      
      НАПРАВО АКО ТРЪГНЕШ — 
      ГЛАВАТА СИ ЩЕ ЗАГУБИШ
      Накъде ще тръгнеш сега? 
      `,
      choices: [
        {
          text: `
          Надясно — мини на 117.
          `,
          nextPage: 117,
        },{
          text: `
          Наляво — продължи на 7.
          `,
          nextPage: 7,
        }
      ],
    },
    132: {
      text: `
      — Това е положението, шефе — печално подсмръква Бабаитко. — Сега сме политически затворници. Ама, знаеш ли, има и нещо добро. Не са ни взели торбата. 
      Пристъпваш към вратата на килията и надникваш навън през тясното прозорче. Изведнъж сърцето ти трепва. На една кука, забита в отсрещната стена, виси връзка ключове. Протягаш ръка през прозорчето, но Фърчилан поклаща глава. 
      — Няма да стане, шефе. Далече е. Аз уж имам най-дълги ръце, обаче колкото и да се мъчих, нищо не излезе. 
      Фърчилан е прав. Ще трябва да си послужиш с нещо. Но какво можеш да измъкнеш от торбата сега? 
      `,
      choices: [
        {
          text: `
          Права джаджа — мини на 170.
          `,
          requiresItems: [{ item: "straigthTrinket", quantity: 1 }],
          nextPage: 170,
        },{
          text: `
          Усукана джаджа — продължи на 265.
          `,
          requiresItems: [{ item: "twistedTrinket", quantity: 1 }],
          nextPage: 265,
        },{
          text: `
          Крив макарон — прехвърли се на 278.
          `,
          requiresItems: [{ item: "macaron", quantity: 1 }],
          nextPage: 278,
        },{
          text: `
          Преносима дупка — попадаш на 286.
          `,
          requiresItems: [{ item: "hole", quantity: 1 }],
          nextPage: 286,
        },{
          text: `
          Ако нямаш нито един от изброените предмети, отгърни на 262.
          `,
          nextPage: 262,
        }
      ],
    },
    133: {
      text: `
      — Добре де — въздъхваш ти. — Щом толкова настоявате, ще ви гостувам. 
      — И ще ни помогнеш! — провиква се някой. — Ще спасиш клетия ни чукундуртски народ! Нали, благодетелю? 
      Отново се объркваш. 
      — Че как да ви помогна? 
      — Абе, ти само се съгласи, пък другото е лесно — обаждат се от задните редици. — За юнак като теб туй е фасулска работа. 
      Цялата история те смущава все повече и повече. Не стига, че са те откраднали в потайна доба, ами и трябва да ги спасяваш от нещо. Е, какво ще правиш сега? 
      `,
      choices: [
        {
          text: `
          Ако се съгласиш да помогнеш на чукундуртите, мини на 31. 
          `,
          nextPage: 31,
        },{
          text: `
          Ако откажеш, продължи на 179.
          `,
          nextPage: 179,
        }
      ],
    },
    134: {
      text: `
      Бялата къща остава зад вас. Продължавате напред през гората и не след дълго забелязвате, че с вашия път се слива още един, който води назад. Доколкото можеш да прецениш, това трябва да е лявото отклонение. 
      `,
      choices: [
        {
          text: `
          Ако решиш да се върнете по него към кръстопътя, мини на 210.           `,
          nextPage: 210,
        },{
          text: `
          Ако продължиш напред, където би трябвало да е замъкът на таласъмите, прехвърли се на 157.
          `,
          nextPage: 157,
        }
      ],
    },
    135: {
      text: `
      Когато изсипваш на масата оскъдните запаси, Мишемориус пак се разплаква — този път от благодарност. 
      — Каква доблест! — хълца нещастният чародей. — Какво благородство към един окаян клетник! Как да ти се отблагодаря, щедри човече? Проклетите таласъми всичко разграбиха. Ето, вземи поне това. 
      И той измъква измежду книгите някаква странна метална джаджа — права и гладка. 
      — Какво е това? — изненадано питаш ти. 
      — Част от машината за производство на суха вода — обяснява Мишемориус. — Друго нямам. Вземи я, все ще ти свърши работа. 
      Ако искаш да приемеш подаръка, запиши си, че вече имаш права джаджа. А имаш ли и усукана джаджа? 
      `,
      addToInventory: { item: "straigthTrinket", quantity: 1 },
      choices: [
        {
          text: `
          Да — мини на 191.
          `,
          requiresItems: [{ item: "twistedTrinket", quantity: 1 }],
          nextPage: 191,
        },{
          text: `
          Не — продължи на 212.
          `,
          nextPage: 212,
        }
      ],
    },
    136: {
      text: `
      Каква гъба ще опиташ сега? 
      `,
      choices: [
        {
          text: `
          Жълта — мини на 12.
          `,
          nextPage: 12,
        },{
          text: `
          Синя — продължи на 17.
          `,
          nextPage: 17,
        },{
          text: `
          Червена — попадаш на 29.
          `,
          nextPage: 29,
        },{
          text: `
          Зелена — прехвърли се на 42.
          `,
          nextPage: 42,
        },{
          text: `
          Черна — отгърни на 53.
          `,
          nextPage: 53,
        }
      ],
    },
    137: {
      text: `
      Премахнали ли сте охраната пред вратата? 
      `,
      choices: [
        {
          text: `
          Да — мини на 173.
          `,
          nextPage: 173,
        },{
          text: `
          Не — продължи на 201.
          `,
          nextPage: 201,
        }
      ],
    },
    138: {
      text: `
      След кратка почивка отново повеждаш чукундуртите напред и скоро забелязвате път — стар, каменист и разбит, но все пак път. Макар да не забелязваш следи, ти не се съмняваш, че таласъмите са минали по него. 
      Ала един час по-късно работата се усложнява. Достигате кръстопът с три отклонения. Наблизо се издига обрасъл с мъх камък, върху който едва успяваш да разчетеш древен надпис: 
      НАЛЯВО АКО ТРЪГНЕШ — 
      ЗА ГЪБИ ЩЕ ХОДИШ
      
      НАДЯСНО АКО ТРЪГНЕШ — 
      НИКЪДЕ НЯМА ДА СТИГНЕШ
      
      НАПРАВО АКО ТРЪГНЕШ — 
      ГЛАВАТА СИ ЩЕ ЗАГУБИШ
      — Шефе, дай да тръгнем наляво! — обажда се Бабаитко. — Гъбите са хубаво нещо. 
      — Особено печени — подкрепя го Фърчилан. 
      — Или на чорбица — добавя Хухавел. — Баба ми правеше много хубава гъбена чорбица. 
      Не им обръщаш внимание. Сега не ти е до гъбена чорба. Трябва да избереш верния път. И тъй, накъде ще тръгнеш? 
      `,
      choices: [
        {
          text: `
          Наляво — мини на 7.
          `,
          nextPage: 7,
        },{
          text: `
          Направо — продължи на 88.
          `,
          nextPage: 88,
        },{
          text: `
          Надясно — попадаш на 117.
          `,
          nextPage: 117,
        }
      ],
    },
    139: {
      text: `
      Без да губите време, вие се втурвате напред, хлътвате в пещерата и побягвате надолу по някаква стръмна каменна стълба. Но Фърчилан е бил прав — не разполагате с много време. Изведнъж зад вас се раздават тежките стъпки на едрия таласъм. Заканителните му викове отекват под свода на стълбището. 
      `,
      choices: [
        {
          text: `
          Продължи на 246.
          `,
          nextPage: 246,
        }
      ],
    },
    140: {
      text: `
      Отчупваш малко парченце от синята гъба и го поднасяш пред човката на патката. Кротката птица с удоволствие поглъща угощението… и пред очите ви се смалява до микроскопични размери. След миг тревата я поглъща. С жален писък Хухавел се хвърля по корем и почва да рови из буренаците, но напразно. Патката е изчезнала безследно. 
      — Отиде ми горкото хайванче! — вайка се Хухавел. 
      — Я да мълчиш, че ще ти опаля един по канчето! — сопва се Бабаитко. — Голяма работа, една патка! 
      Е, няма как, налага се да отбележиш, че оставате без патката на Хухавел.  
      `,
      removeFromInventory: { item: "duck", quantity: 1 },
      choices: [
        {
          text: `
          Ако искаш да разбереш действието на останалите гъби, вече няма друга възможност, освен да ги изпробваш върху себе си. За да сториш това, мини на 136.          `,
          nextPage: 136,
        },{
          text: `
          Ако предпочиташ да не го правиш, продължи на 154.
          `,
          nextPage: 154,
        }
      ],
    },
    141: {
      text: `
      Поемате по средния път и половин час по-късно забелязвате на една поляна край пътя голяма къща от бял камък.
      `,
      choices: [
        {
          text: `
          Ако искаш да я посетите, мини на 120.
          `,
          nextPage: 120,
        },{
          text: `
          В противен случай продължи на 185.
          `,
          nextPage: 185,
        }
      ],
    },
    142: {
      text: `
      — Разказвай! — кимваш ти. 
      — Ужасна е тази тайна, предводителю наш — изрича с треперещ глас министър-предателят. — Докато таласъмите тършуваха из селото, аз се разприказвах с един от тях. Нали от малък съм си общителен… 
      — Ти не разтягай локуми, ами давай по същество — провиква се някой от навалицата. — Какво научи? 
      — Гибел е надвиснала над главите ни! — театрално възкликва нещастникът и започва да скубе сплъстената си коса. — О, немилосърдна съдба, докога ще тормозиш нас, клетите чукундурти? Знайте, скъпи сънародници, че Дървеняк Първи си е осигурил подкрепата на великия чародей Мишемориус! 
      Над тълпата се разнася стон. 
      — Спукана ни е работата! 
      — По-добре да бягаме вдън гори Тилилейски! 
      — Щом и Мишемориус е срещу нас, за нула време ще ни направят на бъзе и коприва! 
      — Чакайте, чакайте! — намесва се един здравомислещ чукундурт. — Туй са само празни приказки. Ами доказателства? 
      Министър-предателят протяга ръка нагоре. В шепата му блести малко шишенце. 
      — Ето го доказателството! Задигнах го от джоба на таласъма… нали от малък съм си сръчен… Знаете ли какво е това? 
      — Откъде ще знаем, като не си ни казал? — логично отбелязва някой. 
      — Суха вода! Изобретена лично от Мишемориус! И таласъмът каза още, че Мишемориус е направил голяма машина за производство на суха вода. Сега я монтирали в замъка на Дървеняк Първи. Щом заработела тая машина, цялата гора щяла да изсъхне. 
      — Брех! Не думай! — възкликва най-близкият чукундурт. — Я дай, дай да видя! 
      И преди да се намесиш, шишенцето плъзва от ръка на ръка. Когато разблъскваш чукундуртите и успяваш да се добереш до него, на дъното са останали само няколко капки. Ала след като ги изсипваш върху дланта си, всяко съмнение изчезва. Водата наистина е съвсем суха — мирише на гнило и изобщо не мокри. 
      Наоколо чукундуртите унило обсъждат вестта. Преобладават две мнения. Първо — че цялата гора е обречена на гибел. И второ — че за всичко е виновен министър-предателят. Някой дори отново предлага да му оскубят брадата, но на другите не им е до забавления. 
      `,
      choices: [
        {
          text: `
          Ако смяташ, че трябва незабавно да предприемеш нещо срещу пъкления план на Дървеняк, мини на 5.
          `,
          nextPage: 5,
        },{
          text: `
          Ако оставиш царя на таласъмите да върши каквото си иска, продължи на 39.
          `,
          nextPage: 39,
        }
      ],
    },
    143: {
      text: `
      — Бре! — изненадва се змеят, като ви вижда. — Пак ли сте вие? Нищо де, минавайте си колкото щете, и с пръст няма да ви пипна. Ние, змейовете, помним доброто. 
      Още веднъж се сбогувате с него, прекосявате тунела и продължавате. Накъде сте се отправили? 
      `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 81.
          `,
          nextPage: 81,
        },{
          text: `
          Към кръстопътя — продължи на 108.
          `,
          nextPage: 108,
        }
      ],
    },
    144: {
      text: `
      След като стъпвате на сушата, вие изцеждате дрехите си и продължавате по пътя. Наоколо отново се простират сенчести гори. Ала внезапно пътят се слива с още един — доколкото можеш да прецениш, това е средното разклонение, което идва от кръстопътя. 
      Накъде ще се отправиш сега? 
      `,
      choices: [
        {
          text: `
          Напред, където би трябвало да е замъкът на таласъмите — мини на 157.
          `,
          nextPage: 157,
        },{
          text: `
          Обратно към кръстопътя по средния път — продължи на 141.
          `,
          nextPage: 141,
        }
      ],
    },
    145: {
      text: `
      Преди да му обясниш, че сапунът служи за лична хигиена, таласъмът го захапва и доволно кимва. 
      — М-м-м! Вкусно! Швейцарски е, нали? Хайде, наливайте си вода и изчезвайте. 
        `,
      choices: [
        {
          text: `
          Напълваш съдинката си с вода и преминаваш на 177. 
          `,
          nextPage: 177,
        },
      ],
    },
    146: {
      text: `
      Няма как, трябва да продължиш. Отхапваш от червената гъба… и с радост усещаш как чувството за тежест изчезва. Е, поне от тази неприятност се отърва. Но остават грамадните размери… и избор само между две гъби — синя и черна. Коя от тях ще изпробваш? 
      `,
      choices: [
        {
          text: `
          Синя — прехвърли се на 181.
          `,
          nextPage: 181,
        },{
          text: `
          Черна — отгърни на 53.
          `,
          nextPage: 53,
        }
      ],
    },
147: {
  text: `
  Прав е Бабаитко! От къде на къде ще ви яде този звяр? Без да показваш, че те е страх, ти пристъпваш напред и строго питаш: 
  — Кой си ти и с какво право си позволяваш да плашиш мирните пътници? Ще ни ядеш, а? Ами че това е престъпление! 
  — Не е, не е! — ухилва се чудовището и протяга покрай вас огромната си опашка, за да ви препречи пътя назад. — Аз съм змей-горянин. Обявили са ме за застрашен вид, даже в Червената книга съм записан. Тъй че в името на екологията ще трябва да се прежалите. 
  — Пусни ме, шефе! — репчи се Бабаитко. — Пусни ме да му опаля един по цафарата, че да помни кога е ял чукундурти! 
  — Не бе, шефе — плахо се моли Хухавел. — Дай с разум да действаме. Аз ще се разбера с тоя звяр. 
  Останалите двама чукундурти също претендират да оправят положението. На кого ще се довериш? 
  `,
  choices: [
    {
      text: `
      На Бабаитко — мини на 166.
      `,
      nextPage: 166,
    },{
      text: `
      На Хухавел — продължи на 180.
      `,
      nextPage: 180,
    },{
      text: `
      На Гадолини — попадаш на 198.
      `,
      nextPage: 198,
    },{
      text: `
      На Фърчилан — прехвърли се на 214.
      `,
      nextPage: 214,
    }
  ],
},
148: {
  text: `
  — Уф! — недоволно промърморва таласъмът. — Навъдили се едни подмазвачи! Я да ми се махате от кухнята, додето не съм викнал стражата! 
  Нямаш никакво желание да се срещаш със стражата, затова побързваш да напуснеш. 
  `,
  choices: [
    {
      text: `
      Мини на 255.
      `,
      nextPage: 255,
    }
  ],
},
149: {
  text: `
  При новината за твоята победа из селото избухва неописуемо ликуване. Най-напред чукундуртите се захващат да те разнасят на ръце, като пеят с все сила революционни маршове. Когато това им омръзва, организират народни песни и танци, а сетне пристъпват към импровизиран банкет. Личи си, че умеят и обичат да правят банкети — ядат, та чак ушите им пукат. 
  Привечер благодарните чукундурти предлагат да те настанят като скъп гост в най-хубавата колиба. Обещават дори да ти осигурят течаща вода и централно отопление. 
  Силно си изненадан, че в това село има такива модерни удобства, но какво ли не може да се очаква от чукундуртите. Решавай сега каква колиба ще избереш. 
  `,
  choices: [
    {
      text: `
      С течаща вода и централно отопление — мини на 26.
      `,
      nextPage: 26,
    },{
      text: `
      Само с течаща вода — продължи на 58.
      `,
      nextPage: 58,
    },{
      text: `
      Само с централно отопление — попадаш на 91.
      `,
      nextPage: 91,
    },{
      text: `
      Без такива глезотии — прехвърли се на 109.
      `,
      nextPage: 109,
    }
  ],
},
150: {
  text: `
  По твое нареждане чукундуртите се приближават към къщата бавно и безшумно. Оказва се, че тази предпазна мярка е била съвсем разумна. След малко различавате между храстите, че пред вратата са застанали на пост двама въоръжени таласъми.
  — Да ги нападнем, шефе — бързо предлага Фърчилан.
  — И аз тъй викам — подкрепя го Бабаитко. — Като им опаля един по бъклицата…
  — Абе, дайте да не си дирим белята — възразява Хухавел. — Не виждате ли, че това не е замъкът на Дървеняк? Ясно ни рекоха, че замъкът е под земята.
  Хухавел безспорно има право. Това не е замъкът на Дървеняк. Ако все пак решиш да нападнете таласъмите, мини на 178.
  Ако предпочиташ да се върнете на пътя и да продължите, реши накъде ще се отправите:
  `,
  choices: [
    {
      text: `
      Напред, където би трябвало да е замъкът на таласъмите — мини на 134.
      `,
      nextPage: 134,
    },{
      text: `
      Обратно към кръстопътя — продължи на 185.
      `,
      nextPage: 185,
    },{
      text: `
      Нападнете таласъмите — мини на 178.
      `,
      nextPage: 178,
    }
  ],
},
151: {
  text: `
  Уви, в тинестата вода таласъмите са по-бързи и след кратка, ожесточена схватка всички бивате омотани с въжета. Под строга охрана ви отвеждат при царя на блатните таласъми, където набързо бивате обвинени в тероризъм, шпионаж, идеологическа диверсия, подстрекателство и незаконно преминаване на границата.
  Като политически затворници само след час се озовавате в клетка на малко кално островче. Някой ден сигурно ще успеете да избягате, но това няма да стане скоро. За жалост твоята мисия завърши с провал.
  `,
  end: true,
  choices: []
},
152: {
  text: `
  Не знам какво си очаквал, но в малката долина не откриваш абсолютно нищо. Старчето сякаш е потънало вдън земя. Остава ти само да поведеш своята дружина обратно към кръстопътя.
  `,
  choices: [
    {
      text: `
      Мини на 187.
      `,
      nextPage: 187,
    }
  ],
},
153: {
  text: `
  Вече сте съвсем близо до пещерата, когато в нощната тишина се раздава оглушителното грачене на патката.
  — Стой! — долита откъм огъня свиреп рев. — Кой там?
  `,
  choices: [
    {
      text: `
      Продължи на 232.
      `,
      nextPage: 232,
    }
  ],
},
154: {
  text: `
  — Никакви рискове! — заявяваш ти. — Кой знае какво още може да ни се случи. Хайде да си вървим по пътя.
  Ако искаш, можеш да прибереш вълшебните гъби. А ако не знаеш какво е действието им, може би ще е по-добре да ги изхвърлиш. Впрочем, изборът е твой. Запиши си го, след това премини на 172.
  `,
  choices: [
    {
      text: `
      Мини на 172.
      `,
      nextPage: 172,
    }
  ],
},
155: {
  text: `
  Позволил ли си на таласъмите да ограбят хранителните запаси?
  `,
  choices: [
    {
      text: `
      Да — мини на 169.
      `,
      nextPage: 169,
    },{
      text: `
      Не — продължи на 190.
      `,
      nextPage: 190,
    }
  ],
},
156: {
  text: `
  А познаваш ли свойствата на вълшебните гъби?
  `,
  choices: [
    {
      text: `
      Да — мини на 183.
      `,
      nextPage: 183,
    },{
      text: `
      Не — продължи на 165.
      `,
      nextPage: 165,
    }
  ],
},
157: {
  text: `
  Отряд „Чукундуртски отмъстители“ неуморно продължава напред през гората. Слънцето вече клони към залез, когато забелязвате край пътя стар кладенец. 
  `,
  choices: [
    {
      text: `
      Ако имаш кратунка и искаш да си налееш вода — мини на 194.
      `,
      requiresItem: [{ item: "groud", quantity: 1 }],
      removeFromInventory: { item: "groud", quantity: 1 },
      nextPage: 194,
    },{
      text: `
      Ако нямаш кратунка, но имаш шишенце с универсален разтворител, може да пожертваш съдържанието и да си налееш чиста вода — мини на 194.
      `,
      requiresItem: [{ item: "bottleOfSolvent", quantity: 1 }],
      removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
      addToInventory: { item: "bottleOfWater", quantity: 1 },
      nextPage: 194,
    },,{
      text: `
      Ако нямаш кратунка, но имаш шишенце със суха вода, може да пожертваш съдържанието и да си налееш чиста вода — мини на 194.
      `,
      requiresItem: [{ item: "dryWater", quantity: 1 }],
      removeFromInventory: { item: "dryWater", quantity: 1 },
      addToInventory: { item: "bottleOfWater", quantity: 1 },
      nextPage: 194,
    },{
      text: `
      Ако нямаш никаква подходяща съдинка (или не искаш да се лишаваш от съдържанието на шишенцето) — продължи на 240.
      `,
      nextPage: 240,
    }
  ],
},
158: {
  text: `
  — Е, хайде, старче, остани си със здраве — казваш ти и се обръщаш към спътниците си. — Дружина, ходом марш към кръстопътя!
  Чукундуртите послушно поемат през клисурата. (Ако Фърчилан е избягал, след малко ще го откриете да се спотайва между камънаците с плячката си — кривия макарон.)
  `,
  choices: [
    {
      text: `
      Мини на 187.
      `,
      nextPage: 187,
    }
  ],
},

159: {
  text: `
  Гадолини измъква лулата на мира, после хваща Бабаитко за ръката и го повежда към огъня. Щом ги зърва в полумрака, едрият таласъм надава свиреп рев:
  — Стой! Кой?
  — Свой — безгрижно отвръща Гадолини.
  — Как тъй свой? — не се успокоява таласъмът. — Кои сте вие?
  — Абе ти не разбираш ли от дума? — тросва се Гадолини. — Свои сме. Хулигани. Хем от най-големите.
  Таласъмът се ухилва.
  — А стига бе! От мен по-голям хулиган няма по тия места.
  — Добре де, като си такъв хулиган, знаеш ли хулиганските номера? — пита Гадолини. — Познаваш ли ударите?
  — И още как? — гордо отвръща таласъмът. — Ей на това му се вика „традиция“.
  С едната ръка той опъва назад палеца и показалеца на другата и плясва с тях Бабаитко по челото.
  — Бива си те — съгласява се Гадолини. — Хайде сега, Бабаитко, покажи на кое му се вика „парен чук“.
  Без да чака втора покана, Бабаитко полага длан върху главата на таласъма и удря отгоре с юмрук.
  — А пък на туй му се вика „черешки“ — бодро заявява таласъмът и като подвива показалци, звънва с тях Бабаитко по ушите.
  — А пък на туй му се вика „изтребител“ — не остава по-назад Бабаитко и му нанася плъзгащ удар с длан по темето.
  — А пък на туй му се вика „тантерица“ — обявява таласъмът и го удря със свит лакът по гърба, като в следващата секунда разгъва ръка и го бухва с юмрук по тила.
  — А пак на туй му се вика гьостерица! — възкликва Гадолини и пъхва лулата в ръката на Бабаитко.
  Тежкото дърво се стоварва с глух пукот върху главата на таласъма. Две-три секунди той стои като вкаменен, после подбелва очи и рухва край огъня. Щом виждат поражението на шефа си, останалите таласъми изчезват в гората с отчаяни писъци.
  — Видяхте ли какъв номер им врътнах? — гордо се ухилва Гадолини. — Да помнят друг път, че тютюнопушенето е вредно за тяхното здраве. Хайде сега да влизаме.
  `,
  choices: [
    {
      text: `
      Мини на 219.
      `,
      nextPage: 219,
    }
  ],
},
160: {
  text: `
Страховита кашлица разтърсва чудовището. Слисан и полузадушен, змеят изригва огромен облак зловонен пушек и се търкулва край стената.
— Сега е моментът! — провиква се Фърчилан. — Да бягаме!
— Чакайте! — протестира Хухавел. — Недейте да бягате! Това е недоразумение. Всичко ще обясня.
Кого ще послушаш?
  `,
  choices: [
    {
      text: "Фърчилан — мини на 32.",
      nextPage: 32
    },
    {
      text: "Хухавел — продължи на 175.",
      nextPage: 175
    }
  ]
},
161: {
  text: `
Пред лицето на всенародния гняв министър-предателят реагира светкавично.
— Подавам оставка! — изпищява той и хуква към гората, преследван от десетки разгневени чукундурти.
Когато потерята се изгубва между дърветата, министърът на другите работи те побутва и се ухилва.
— Видя ли колко е хубаво да има министър-предател? Каквото и да стане, все той остава на топа на устата.
— Да, ама сега какво ще правим? — обажда се министърът на разните работи. — Нали го чу, подаде си оставката. Значи изпадаме в правителствена криза.
Двамата се замислят дълбоко, после едновременно се обръщат към теб.
— Слушай, почтени. Вече нямаме нужда от министър на външните работи. Тъй и тъй имаш опит в държавните дела, дай да те направим министър-предател.
  `,
  choices: [
    {
      text: "Приемеш предложението — мини на 10.",
      nextPage: 10
    },
    {
      text: "Откажеш — продължи на 73.",
      nextPage: 73
    }
  ]
},
162: {
  text: `
Повеждаш дружината си през мрака, но само след десетина крачки Хухавел заявява:
— Ти както щеш, шефе, обаче аз с оня змей повече не искам да си имам работа. Ще ни излапа с парцалите и окото му няма да мигне.
— И аз тъй мисля — подкрепя го Бабаитко.
Е, щом дори храбрият Бабаитко се бои, нямаш друг изход, освен да поемете обратно. Впрочем, накъде е това „обратно“?
  `,
  choices: [
    {
      text: "Към кръстопътя — мини на 131.",
      nextPage: 131
    },
    {
      text: "Към бялата къща — попадаш на 81.",
      nextPage: 81
    }
  ]
},
163: {
  text: `
— Какви са тия книги, като не знам да чета? — ядосва се таласъмът и запокитва подаръка в кладенеца. — Вие подигравате ли ми се? Марш веднага оттук! Никаква вода за вас!
— Дай да му опаля един, бе шефе! — моли се Бабаитко.
  `,
  choices: [
    {
      text: "Разрешиш на Бабаитко да го стори — мини на 208.",
      nextPage: 208
    },
    {
      text: "Откажеш от водата и продължиш пътешествието — мини на 177.",
      nextPage: 177
    }
  ]
},
164: {
  text: `
Отчупваш малко парченце от червената гъба и го поднасяш пред човката на патката. Кротката птица с удоволствие поглъща угощението… и мигновено започва да се възнася нагоре от ръцете на Хухавел.
— Олекна! — слисано се провиква чукундуртът. — Олеле, отиде ми хайванчето!
И той отчаяно започва да подскача с протегнати ръце. Но вече нищо не може да се направи. Патката се издига над върхарите на дърветата и лекият ветрец я понася надалеч.
Е, няма как, налага се да отбележиш, че оставате без патката на Хухавел.
  `,
  removeFromInventory: { item: "duck", quantity: 1 },
  choices: [
    {
      text: ` Ако искаш да разбереш действието на останалите гъби, вече няма друга възможност, освен да ги изпробваш върху себе си. За да сториш това, мини на 136.`,
      nextPage: 136
    },
    {
      text: "Ако предпочиташ да не го правиш, продължи на 154.",
      nextPage: 154
    }
  ]
},
165: {
  text: `
Щом изваждаш гъбите от торбата, Мишемориус се ококорва.
— Я! Вълшебни гъби! Отдавна не бях виждал, те се намират много трудно. А знаеш ли как се употребяват?
— Не — отвръщаш ти. — Тъкмо за това исках да те питам.
Чародеят присвива очи и се почесва по тила.
— Чакай да си припомня. Да, точно така… Слушай сега и запомни внимателно. Ако лапнеш от жълтата гъба, ще пораснеш неимоверно. Ама не го прави, много неудобства ще ти създаде. Синята гъба пък ще те смали като мравка. От червената гъба ще олекнеш толкова, че може да хвръкнеш като балон. А от зелената ще натежиш като олово. От черната обаче да не си посмял да хапнеш! Тя е страшно отровна!

  `,
  choices: [
    {
      text: `Благодариш му за консултацията и преминаваш на 183.`,
      nextPage: 183
    }
  ]
},
166: {
  text: `
— Ела бе, животно! — заканва се Бабаитко. — Ела да ти опаля един по фонтанелата!
Но вместо това змеят го перва с лапа по главата и Бабаитко замаяно отстъпва назад.
— Тъй, а! — обидено мърмори чукундуртът. — Като си по-голям и ще биеш! Ама аз като повикам батко, ще видиш ти!
— Батко му е по-хилав от мен — доверително ти прошепва Хухавел.
И тъй, първият опит за съпротива се провали. На кого от своите спътници ще се довериш сега?
  `,
  choices: [
    {
      text: "На Хухавел — продължи на 180.",
      nextPage: 180
    },
    {
      text: "На Гадолини — попадаш на 198.",
      nextPage: 198
    },
    {
      text: "На Фърчилан — прехвърли се на 214.",
      nextPage: 214
    }
  ]
},

167: {
  text: `
Няма как, трябва да продължиш. Отхапваш от синята гъба… и с радост усещаш как се смаляваш до предишните размери. Е, поне от тази неприятност се отърва. Но остава непоносимата тежест… и избор само между две гъби — червена и черна. Коя от тях ще изпробваш?
  `,
  choices: [
    {
      text: "Червена — прехвърли се на 195.",
      nextPage: 195
    },
    {
      text: "Черна — отгърни на 53.",
      nextPage: 53
    }
  ]
},

168: {
  text: `
— Хайде, без излишни инициативи! — скарваш се ти на Хухавел. — Тук аз командвам.
— Точно тъй, шефе — подкрепя те Бабаитко. — Като му опаля един по канчето, ще види той едни провизии!
  `,
  choices: [
    {
      text: "Продължи на 212.",
      nextPage: 212
    }
  ]
},

169: {
  text: `
Ставаш и се отправяш към средата на селото, но не откриваш жива душа. Само тук-там от колибите плахо надничат неколцина чукундурти. Както личи, няма да има наплив от доброволци за опасната мисия. Тъкмо се каниш да теглиш една ругатня по адрес на чукундуртската храброст, когато към теб се задават тримата министри, придружени от четирима млади чукундурти.
  `,
  choices: [
    {
      text: "Продължи на 184.",
      nextPage: 184
    }
  ]
},
170: {
  text: `
  Пъхваш правата джаджа през прозорчето, после протягаш ръка… и успех! След миг ключовете са в ръцете ти. Трескаво отключваш килията и кимваш на спътниците си. 
  — Да бягаме! 
  Изтичвате по къс коридор, отваряте една врата и се озовавате в нов, по-широк коридор. В едната посока той се спуска полегато към земните дълбини. От другата страна забелязваш наблизо стълбище, което води нагоре — несъмнено това е изходът. А точно срещу себе си забелязваш врата в стената на коридора. Какво ще направиш сега? 
  `,
  choices: [
    {
      text: `
      Ще провериш какво има зад вратата отсреща — мини на 225. 
      `,
      nextPage: 225,
    },{
      text: `
      Ще се измъкнеш по стълбището нагоре и ще се откажеш от опасното приключение — продължи на 39. 
      `,
      nextPage: 39,
    },{
      text: `
      Ще тръгнеш по коридора към вътрешността на подземния замък — попадаш на 30. 
      `,
      nextPage: 30,
    },
  ],
},
171: {
  text: `
  След като стъпвате на сушата, вие изцеждате дрехите си и продължавате напред. Минавал ли си вече по този път (макар и в обратната посока)? 
  `,
  choices: [
    {
      text: `
      Да — продължи на 33. 
      `,
      nextPage: 33,
    }, {
      text: `
      Не — мини на 75.  
      `,
      nextPage: 75,
    },
  ],
},
172: {
  text: `
  Трима от спътниците ти веднага се отправят напред, но Хухавел още се мотае и наднича тук-там из храсталаците. Сърдито му подвикваш: 
  — Абе, ти чу ли какво казах? 
  — Или искаш да ти опаля един по кубето? — допълва Бабаитко. 
  — Ама аз билки търся — оправдава се Хухавел. — Таквоз… за настинка… или за ухобол… Тя, баба ми, беше голяма билкарка, та от малък ги познавам… 
  `,
  choices: [
    {
      text: `
      Ако му разрешиш да потърси билки, мини на 188. 
      `,
      nextPage: 188,
    },{
      text: `
      В противен случай продължи на 207. 
      `,
      nextPage: 207,
    },
  ],
},
173: {
  text: `
  А Мишемориус още ли е пленник на стола си? 
   `,
  choices: [
    {
      text: `
      Да — мини на 229. 
      `,
      nextPage: 229,
    },{
      text: `
      Не — продължи на 256.
      `,
      nextPage: 256,
    },
  ],
},
174: {
  text: `
  — Дайте да тръгнем надясно, пък да видим какво ще стане — предлагаш ти. 
  — Ама нали пише, че доникъде няма да стигнем — обажда се Бабаитко. — Тогава за какво… 
  — Много ти разбира главата! — прекъсва го Гадолини. — Ами че това може да е номер. За заблуда на противника. 
  — Абе, не се офлянквайте, ами да вървим! — нетърпеливо възкликва Фърчилан. — Като не стигнем доникъде, можем пак да се върнем. 
  И ти решително повеждаш славния си отряд по десния път. 
  Половин час по-късно пътят навлиза в тясна клисура. Скалните стени стават все по-високи. От сянката наоколо лъха влажен хлад. 
  — Видяхте ли, бе? — мърмори Бабаитко. — Казвах ви аз, ама като не слушате… 
  Ала внезапно пред вас се появява малка долина, оградена от стръмни канари. И което е най-удивително — наблизо е седнало дрипаво старче, а на тревата пред него се валят най-различни вехтории. 
  — Добра среща, драги пътници — усмихва се старчето под мустак. — И вие, значи, рекохте да видите дали наистина няма да стигнете доникъде. Е, така си е. От тая долина има само един изход — обратно към кръстопътя. 
  Изпъшкваш от досада и се обръщаш към чукундуртите. 
  — Хайде да си вървим, отмъстители. 
  — Чакайте, чакайте малко — размахва ръка старчето. — Тъй и тъй сте дошли, защо не вземете да купите нещо? Аз съм вехтошар, ще знаете. От туй си изкарвам хляба. На един продам, от друг купя… Огледайте стоката, току-виж нещо ви влязло в работа. 
  — Ама ние нямаме пари — срамежливо признава Хухавел. 
  — Нищо де! Като нямате пари, размяна можем да направим. Вие вадите каквото носите в оная торба, пък все ще се спазарим. 
  Хвърляш поглед върху вехториите на тревата. Като че няма нищо особено: кратунка, огледалце, крив макарон, навито черно килимче, опърпана книжка, стоножка в бурканче, шишенца с бистра и мътна течност, вехти панталони и някакво криво, усукано желязо. Бабаитко любопитно наднича през рамото ти. 
  — Каква е тая усукана джаджа? — пита той. 
  — Не знам — свива рамене старчето. — Даде ми я един таласъм срещу две шепи джанки. Ама я виж това огледалце. Питай го кой е най-красив. 
  Бабаитко поема огледалцето, опулва се насреща му и неуверено изрича: 
  — Огледалце, огледалце, кой е най-красив на земята? 
  — Ти, Бабаитко, си най-красив — отговаря тъничко гласче. — Ако те види малката Снежанка, дето е при седемте джуджета, шапката ще й хвръкне! 
  — Каква е тая Снежанка? — недоумява чукундуртът. 
  Старчето махва с ръка. 
  — А, то е дълга история. Някакви семейни разправии с мащеха и прочие. Я вземи сега да надникнеш през тоя крив макарон. 
  Бабаитко надниква през макарона и ахва. 
  — Брех! Ами че туй съм аз! И са ме избрали за министър на големите работи! Каква е тая чудесия? 
  — Така е то, хубавите работи само през крив макарон се виждат — мъдро обяснява старчето, после се обръща към теб. — Е, ще търгуваме ли? 
  — Нека аз, нека аз! — провиква се Бабаитко. 
  — Да бе, ти! — презрително го поглежда Гадолини. — С тая дървена глава само си за търговец. Хитрост е необходима, хитрост! 
  — Не, ум! — възразява Хухавел. 
  — И бърза реакция — добавя Фърчилан. 
  На кого ще повериш търговските преговори? 
  `,
  choices: [
    {
      text: `
      На Бабаитко — мини на 22.
      `,
      nextPage: 22,
    },{
      text: `
      На Гадолини — продължи на 47.
      `,
      nextPage: 47,
    },{
      text: `
      На Хухавел — попадаш на 61.
      `,
      nextPage: 61,
    },{
      text: `
      На Фърчилан — прехвърли се на 94.
      `,
      nextPage: 94,
    },{
      text: `
      Сам ще водиш сделката — отгърни на 119.
      `,
      nextPage: 119,
    }
  ],
},
175: {
  text: `
Макар че сърцето ти се свива от тревога, правиш знак на останалите да изчакат. В това време Хухавел пристъпва напред.
— Ще те излапам, буболечка такава! — яростно изревава змеят. — Суров ще те излапам, та ако ще да се разболея! Да ми погодиш такъв номер!
— Ча-ча-чакай бе, н-н-няма такава работа — заеква Хухавел. — Не разбра ли к-к-какъв номер се получи? Може и да не си огнедишащ, но гледай само каква пушилка вдигаш с тая чудесия. Като я видят, всички ще бягат презглава.
Змеят зяпва от почуда.
— Вярно бе! Брей, имало умни хора… пардон, умни чукундурти на тоя свят. Да сте живи и здрави, скъпи приятели. Хайде, вървете си със здраве. Срамота ще е да ви ям след такава услуга.
Отбележи си, че лулата остава при змея. А след това повеждаш своята дружина… накъде впрочем?
  `,
  removeFromInventory: { item: "pipe", quantity: 1 },
  choices: [
    {
      text: `
      Напред, където би трябвало да е замъкът на таласъмите — мини на 81.
      `,
      nextPage: 81,
    },{
      text: `
      Към кръстопътя — продължи на 108.
      `,
      nextPage: 108,
    }
  ],
},
176: {
  text: `
Отчупваш малко парченце от зелената гъба и го поднасяш пред човката на патката. Кротката птица с удоволствие поглъща угощението… сетне моментално се изръсва от ръцете на Хухавел и рухва долу с глух тътен.
— Брех, натежа! — слисано се провиква чукундуртът. — Като олово натежа пустата му патка! Ами сега как ще я нося?
— Нищо — утешава го Гадолини. — Може пък някоя друга гъба да я оправи.
— Мислиш ли? — жално подсмръква Хухавел и се обръща към теб с надежда. — Да опитаме, а, шефе?
  `,
  choices: [
    {
      text: `
      Ако продължиш да експериментираш с патката, мини на 202.
      `,
      nextPage: 202,
    },{
      text: `
      Ако се откажеш, продължи на 218.
      `,
      nextPage: 218,
    }
  ],
},
177: {
  text: `
Обръщате гръб на кладенеца и продължавате… накъде впрочем?
  `,
  choices: [
    {
      text: `
      Напред, където би трябвало да е замъкът на таласъмите — мини на 43.
      `,
      nextPage: 43,
    },{
      text: `
      Назад, по посока кръстопътя — продължи на 251.
      `,
      nextPage: 251,
    }
  ],
},
178: {
  text: `
Очевидно единият от таласъмите е много благоразумен. Щом твоята дружина изскача от храстите с войнствени крясъци, той моментално си плюе на петите и изчезва в гората. Другият се опитва да окаже съпротива, но Бабаитко още с първия удар го праща в страната на сънищата. Таласъмът глухо ахва и се сгромолясва в нозете ви. Битката е спечелена!
Спираш пред вратата на бялата къща… и сърцето ти се свива. Отвътре долитат горчиви ридания.
Ако искаш да влезеш в къщата, мини на 209.
Ако предпочиташ да се върнеш на пътя и да продължиш, реши накъде ще се отправите:
  `,
  choices: [
    {
      text: `
      Ако искаш да влезеш в къщата, мини на 209.
      `,
      nextPage: 209,
    },{
      text: `
      Напред, където би трябвало да е замъкът на таласъмите — мини на 134.
      `,
      nextPage: 134,
    },{
      text: `
      Обратно към кръстопътя — продължи на 185.
      `,
      nextPage: 185,
    }
  ],
},
179: {
  text: `
— Никакви такива! — ядосваш се ти. — Да сте ме поканили като хората! Хайде сега, останете си със здраве, а аз се прибирам у дома.
И макар че нямаш представа накъде точно трябва да вървиш, ти се упътваш към края на селото. Но само след двайсетина крачки в нозете ти се хвърля ридаеща тълпа чукундурти, чукундуртки и малки, уплашени чукундуртчета.
— Бащице! — вият те като на погребение. — На кого ни оставяш? Как ще живеем без теб? Постой поне за няколко дни! В теб ни е цялата надежда!
Неволно ти става жал за тия окаяни сиромаси. 
  `,
  choices: [
    {
      text: `
      Ако решиш да отстъпиш пред молбите им, мини на 31.
      `,
      nextPage: 31,
    },{
      text: `
      Ако си непреклонен, продължи на 65.
      `,
      nextPage: 65,
    }
  ],
},
180: {
  text: `
Макар че трепери като лист, Хухавел храбро пристъпва напред и строго оглежда змея.
— Слушай сега, драги! Не може то така! Как тъй ще ни ядеш сурови? Знаеш ли колко болести се хващат от сурова храна? Според както казва науката…
— Няма такава работа — ухилва се змеят. — Запалил съм си огънче и ще ви опека.
При тия думи той ви придърпва с опашката си зад близкия завой на тунела, където наистина гори огън.
Работата май съвсем се обърка! Ще оставиш ли Хухавел да продължава умните си ходове?
  `,
  choices: [
    {
      text: `
      Да — мини на 222.
      `,
      nextPage: 222,
    },{
      text: `
      Не — продължи на 236.
      `,
      nextPage: 236,
    }
  ],
},
181: {
  text: `
Успех! Парченце от синята гъба те смалява до предишните размери и ти най-сетне въздъхваш от облекчение. 
  `,
  choices: [
    {
      text: `
      Ако все още имаш смелостта да експериментираш с вълшебните гъби, върни се на 136.
      `,
      nextPage: 136,
    },{
      text: `
      Ако не желаеш повече да рискуваш, продължи на 154.
      `,
      nextPage: 154,
    }
  ],
},

182: {
  text: `
— Уплашихме ли те, шефе? — изхилва се Гадолини. — Не бой се, туй беше само за майтап. Пием по още една глътка и тръгваме.
Ала в този момент вратата в дъното се отваря и насреща ви изникват четирима грамадни таласъми.
— Тия пък кои са? — възкликва най-едрият. — Бас държа, че са шпиони.
— Да бе! — присмива му се вторият по големина. — На теб все шпиони ти се привиждат. Ако бяха шпиони, щяха да се спотайват, а не да пият, все едно са си у дома.
— Точно така — потвърдил Гадолини. — Никакви шпиони не сме, а дегустатори, поканени да проверим качеството на виното. Гледайте, не пием нито с чаши, нито с паници, а със специални мерки. Да знаем, един вид, колко сме изпили.
— Ама кой ви е поканил? — недоумява едрият таласъм.
Другият го перва по главата.
— Ама че си прост! Отговорникът по вината ги е поканил, кой друг?
— Точно така — кимва Гадолини.
— Ами добре — промърморва едрият. — Тъкмо го видях преди малко да идва насам. Той ще потвърди, че ги е поканил и всичко е наред. Пък докато дойде… я да си пийнем и ние.
Прехапваш устни. Положението става крайно неприятно. Ако дойде отговорникът по вината, ще бъдете разобличени незабавно. Имаш ли билка-кандилка?
  `,
  choices: [
    {
      text: `
      Имаш ли билка-кандилка? Ако да, мини на 264.
      `,
      requiresItem: { item: "herb", quantity: 1 },
      removeFromInventory: { item: "herb", quantity: 1 },
      nextPage: 264,
    },{
      text: `
      Не — продължи на 279.
      `,
      nextPage: 279,
    }
  ],
},

183: {
  text: `
— Ама какво да ви дам за спомен, бе? — мърмори чародеят и рови между книгите по масата. — Какво да ви дам? Всичко разграбиха тия пусти таласъми! А! Ето, вземи поне това.
И той измъква измежду книгите някаква странна метална джаджа — права и гладка.
— Какво е това? — изненадано питаш ти.
— Част от машината за производство на суха вода — обяснява Мишемориус. — Друго нямам. Вземи я, все ще ти свърши работа.
Ако искаш да приемеш подаръка, запиши си, че вече имаш права джаджа. А имаш ли и усукана джаджа?
  `,
  addToInventory: { item: "straightTrinket", quantity: 1 },
  choices: [
    {
      text: `
      Ако да, мини на 216.
      `,
      requiresItem: { item: "twistedTrinket", quantity: 1 },
      nextPage: 216,
    },{
      text: `
      Ако не, продължи на 237.
      `,
      nextPage: 237,
    }
  ],
},

184: {
  text: `
— Ето! — гордо възкликва министърът на разните работи. — Виж само какви левенти ти намерихме! Цветът на чукундуртската младеж! Доброволци и половина!
— Да-да! Лесно ти е на теб! — обажда се един от доброволците, дребен чукундурт с черен плащ и мрачна физиономия. — Само знаеш да плямпаш. Доброволци, ама друг път! Изобщо нямаше да тръгнем, ако не беше заплашил, че ще ни отлюспиш от племето.
— Не го слушай, спасителю наш! — ухилва се министърът на другите работи. — Той само така си приказва. А пък всъщност изгаря от нетърпение да тръгне срещу врага. Бой последен е този, дето се вика… Свястно момче, от мен да го знаеш. Казва се Гадолини и е майстор на гадните трикове. Такъв номер може да ти врътне, че свят ще ти се завие.
— Е, Гадолини, добре дошъл в екипа — казваш ти. — Ами останалите?
— Аз съм Бабаитко — пристъпва напред един едър чукундурт, който стърчи с две глави над останалите. — Може и да не ме бива по гадните номера, ама когото цапардосам, свитки ще му изхвръкнат от очите.
— То не може така — обажда се до него хилав чукундурт, гушнал под мишница проскубана бяла патка. — Насилието не решава нещата. Ум трябва, ум! Аз, драги ни предводителю, се казвам Хухавел и съм най-умният чукундурт в цялото село.
— Затова те пратиха да пасеш патките, нали? — ехидно се обажда Гадолини.
— Че какво? — обижда се Хухавел. — То и за тая работа ум трябва. Какво като са патки, и те душа носят…
— Добре де, не се препирайте — прекъсваш ги ти и се обръщаш към последния доброволец, който е строен и дългокрак. — А ти, младежо, с какво можеш да се похвалиш?
— Аз съм Фърчилан — представя се той. — С ум и сила не мога да се похваля, ама умея да бягам. И това е важно, нали така?
— Тъй, тъй — подкрепя го Гадолини. — Като стане напечено, той пръв ще си плюе на петите.
— Тихо! — подвикваш ти. — Добре, приемам ви за командоси от бойния отряд „Чукундуртски отмъстители“. Потегляме след малко. Остава само още една дребна подробност. За из пътя ще ни трябват провизии.
При тия думи обръщаш поглед към министъра на разните работи, но той се свива и почва да мънка:
— Ама… спасителю наш… нали разбираш… нищо не е останало в селото…
— Не ме интересува! — повишаваш глас ти. — Заповядвам да преровите цялото село! Все някъде ще е останало нещо за ядене.
Стреснати от твоята строгост, министрите и доброволците се втурват между колибите. Когато след четвърт час се завръщат, резултатът е печален. А именно:
Хухавел носи празна торба.
Фърчилан стиска три кочана царевица.
Бабаитко мъкне под мишница едра, напращяла диня.
Гадолини крепи в шепи два домата.
Министърът на разните работи носи голямо цвекло.
— Това е свещеният чукундур — шепнешком обяснява той. — Задигнах го от селския храм. Голям грях си турих на душата, ама какво да се прави — делото иска жертви.
Министърът на другите работи е нарамил нещо като издълбан пън, от който стърчи кух израстък.
— Това пък какво е? — изненадваш се ти.
— Лулата на мира — гордо отвръща той. — Нали си министър на външните работи. Ако решиш да водиш мирни преговори, ще се нуждаеш от нещо такова.
Последен пристига министър-предателят с парче домашен сапун. Поглеждаш го строго.
— И това ли се води към провизиите?
— Като ни засвирят коремите от глад, няма къде да се дяваме. И сапун ще жвакаме — обажда се Бабаитко.
— Не си прави майтап с хигиената! — скарва му се Хухавел. — Без сапун закъде сме? Нали трябва да си мием ръцете преди ядене.
— Ако има какво да ядем — ухилва се Гадолини.
Е, това е положението. Запиши си наличните провизии и след това премини на 197.
  `,
  addToInventory: [{ item: "bag", quantity: 1 }, { item: "duck", quantity: 1 }, {item: "corn", quantity: 3 }, { item: "watermelon", quantity: 1 }, {item: "tomato", quantity: 2 }, { item: "beetroot", quantity: 1 }, {item: "pipe", quantity: 1 }, {item: "soap", quantity: 1 }],

  choices: [
    {
      text: `
      Запиши си наличните провизии и след това премини на 197.
      `,
      nextPage: 197,
    }
  ],
},

185: {
  text: `
Около половин час вървите през вековна гора, но ненадейно пътят започва да слиза надолу. След малко пред вас се появява входът на мрачен тунел. Гората наоколо е непроходимо гъста, тъй че подземието е единственият път напред.
Влизали ли сте вече в това подземие?
  `,
  choices: [
    {
      text: `
       Ако да, мини на 116.
      `,
      nextPage: 116,
    },{
      text: `
      Не — продължи на 97.
      `,
      nextPage: 97,
    }
  ],
},
186: {
  text: `
— Каква е тая гадна буболечка? — ядосва се таласъмът и запокитва подаръка в кладенеца. — Вие подигравате ли ми се? Марш веднага оттук! Никаква вода за вас!
— Дай да му опаля един, бе шефе! — моли се Бабаитко.
  `,
  choices: [
    {
      text: `
      Ако му разрешиш да го стори, мини на 208.
      `,
      nextPage: 208,
    },{
      text: `
      Ако се откажеш от водата и продължиш пътешествието, мини на 177.
      `,
      nextPage: 177,
    }
  ],
},
187: {
  text: `
Половин час по-късно отново спирате на кръстопътя и оглеждате познатия надпис.

НАЛЯВО АКО ТРЪГНЕШ — 
ЗА ГЪБИ ЩЕ ХОДИШ 
 
НАДЯСНО АКО ТРЪГНЕШ — 
НИКЪДЕ НЯМА ДА СТИГНЕШ 
 
НАПРАВО АКО ТРЪГНЕШ — 
ГЛАВАТА СИ ЩЕ ЗАГУБИШ 

Накъде ще тръгнеш сега?
  `,
  choices: [
    {
      text: `
      Наляво — мини на 7.
      `,
      nextPage: 7,
    },{
      text: `
      Направо — продължи на 88.
      `,
      nextPage: 88,
    }
  ],
},

188: {
  text: `
Хухавел дълго лази на четири крака и най-сетне победоносно се завръща с някакво стръкче.
— Уф! — ядосва се Фърчилан. — Толкова време изгубихме заради една тревичка.
— Ама това е полезна билка! — защитава се Хухавел. — Викат й билка-кандилка. Ако я сложиш на някого във виното, или в ракията да речем, моментално пада кьоркютук пиян.
  `,
  addToInventory: { item: "herb", quantity: 1 },
  choices: [
    {
      text: `
      Ако решиш, можеш да прибереш тази билка. След това продължи на 220.
      `,
      nextPage: 220,
    }
  ],
},
189: {
  text: `
Вече сте съвсем близо до пещерата, когато усещаш ужасен сърбеж в носа. След миг кихавицата ти отеква в нощната тишина като топовен гърмеж.
— Стой! — долита откъм огъня свиреп рев. — Кой там?
  `,
  choices: [
    {
      text: `
      Продължи на 232.
      `,
      nextPage: 232,
    }
  ],
},

190: {
  text: `
Ставаш и тръгваш към изхода на колибата, но още преди да си излязъл, чуваш ужасни писъци. Гласът ти се струва познат — май принадлежи на министър-предателя. Изтичваш навън и откриваш, че не си се излъгал. Цялото село се е струпало около нещастния министър. Неколцина по-яки чукундурти го държат притиснат на земята, а наоколо се раздават гневни викове:
— Предател!
— Той е виновен!
— Дайте пинсети да му оскубем брадата!
— И да го нашарим с коприва! На голо!
— Милост, братя чукундурти! — дере се клетникът. — Не съм виновен! Те другите министри го направиха!
— Стойте! — намесваш се ти. — Каква е тая саморазправа?
— Той е виновен! — обажда се един чукундурт. — Заради него тая зима ще изпукаме от глад.
— Как тъй ще изпукате? — изненадваш се ти. — Нали вчера прогоних таласъмите!
Тълпата избутва към теб министъра на разните работи. Той забива поглед в земята, пристъпва от крак на крак и започва да мънка.
— Ами, такова… Ние, значи, с колегата по другите работи… тъй да се каже… предприехме една брилянтна дипломатическа акция.
— Каква акция? — питаш ти и те обзема лошо предчувствие.
— То… таквоз… рекохме да се помирим с таласъмите. През нощта ги пуснахме да оберат запасите, а пък те обещаха да не ни закачат.
— Тиквеници! — избухваш ти. — Дървета с дървета! Чукундури! Защо не ме събудихте?
— А, не сме чукундури — намесва се министърът на другите работи. — Чукундурти сме, има едно „т“ към края. Пък не те събудихме, щото… ами… щото се уплашихме. Знаеш ли като дойдоха по тъмно, какви страхотии разправяха? — Изведнъж той започва да скубе брадата си и да хленчи с тъничък глас: — Гибел е надвиснала над главите ни! О, немилосърдна съдба, докога ще тормозиш нас, клетите чукундурти? Знайте, скъпи сънародници, че Дървеняк Първи си е осигурил подкрепата на великия чародей Мишемориус!
Над тълпата се разнася стон.
— Спукана ни е работата!
— По-добре да бягаме вдън гори Тилилейски!
— Щом и Мишемориус е срещу нас, за нула време ще ни направят на бъзе и коприва!
— Чакайте, чакайте! — намесва се един здравомислещ чукундурт. — Туй са само празни приказки. Ами доказателства?
Министърът протяга ръка напред. В шепата му блести малко шишенце.
— Ето го доказателството! Задигнах го от джоба на старшия таласъм… нали от малък съм си сръчен… Знаете ли какво е това?
— Откъде ще знаем, като не си ни казал? — логично отбелязва някой.
— Суха вода! Изобретена лично от Мишемориус! И таласъмите казаха още, че Мишемориус е направил голяма машина за производство на суха вода. Сега я монтирали в замъка на Дървеняк Първи. Щом заработела тая машина, цялата гора щяла да изсъхне.
— Брех! Не думай! — възкликва най-близкият чукундурт. — Я дай, дай да видя!
И преди да се намесиш, шишенцето плъзва от ръка на ръка. Когато разблъскваш чукундуртите и успяваш да се добереш до него, на дъното са останали само няколко капки. Ала след като ги изсипваш върху дланта си, всяко съмнение изчезва. Водата наистина е съвсем суха — мирише на гнило и изобщо не мокри.
Наоколо чукундуртите унило обсъждат вестта. Преобладават две мнения. Първо — че цялата гора е обречена на гибел. И второ — че за всичко е виновен министър-предателят. Някой дори отново предлага да му оскубят брадата, но на другите не им е до забавления. 
  `,
  choices: [
    {
      text: `
      Ако смяташ, че трябва незабавно да предприемеш нещо срещу пъкления план на Дървеняк, мини на 55.
      `,
      nextPage: 55,
    },{
      text: `
      Ако оставиш царя на таласъмите да върши каквото си иска, продължи на 39.
      `,
      nextPage: 39,
    }
  ],
},
191: {
  text: `
— Я чакай малко! — трепваш ти и измъкваш от торбата усуканата джаджа. — Ами това знаеш ли какво е?
— Знам, как да не знам — отвръща Мишемориус. — И това е част от машината, само че се оказа сбъркана. Като я монтирах, машината произвеждаше само обикновена вода. Затова я махнах и изработих другата. Сигурно някой от таласъмите я е отмъкнал, когато разграбиха дома ми и ме оставиха на моята клета съдба… О, нещастен ази…
Чародеят отново се разплаква и повече не успяваш да изкопчиш от него нито дума.
  `,
  choices: [
    {
      text: `
      Продължи на 226.
      `,
      nextPage: 226,
    }
  ],
},
192: {
  text: `
Гадолини поема царевицата и безстрашно се отправя към огъня. Щом го зърва в полумрака, едрият таласъм надава свиреп рев:
— Стой! Кой?
— Свой — безгрижно отвръща Гадолини.
— Как тъй свой? — не се успокоява таласъмът. — Кой си ти?
— Не питай кой съм, а какво ви нося — отвръща Гадолини и размахва царевицата. — Ето ви тука нещо за хапване.
Таласъмите почват да се облизват, но Гадолини им се скарва:
— Ехей, закъде сте се разбързали? Първо туй нещо трябва да се изпече. Ето, като го сложим в жаравата и ще стане една вкусотия, пръстите да си оближете.
Продължавайки да се облизват, таласъмите се надвесват над огъня. Ала само след две-три минути радостта им отстъпва място на ужас, защото изведнъж царевичните зърна се превръщат в пуканки с оглушителен трясък.
— Вражеско нападение! — изпищява Гадолини. — Обстрелват ни! Спасявайте се, братя!
След пет секунди от таласъмите няма и следа, само откъм горския мрак долита пукотът на строшени вейки.
— Видяхте ли какъв номер им врътнах? — гордо се ухилва Гадолини. — Хайде сега да влизаме.
  `,
  choices: [
    {
      text: `
      Мини на 219.
      `,
      nextPage: 219,
    }
  ],
},
193: {
  text: `
Отчупваш малко парченце от черната гъба и го поднасяш пред човката на патката. Кротката птица с удоволствие поглъща угощението… и след по-малко от минута се катурва мъртва. Хухавел надава отчаян рев.
Е, няма какво да се прави. Отбележи си, че вече не разполагате с патка и реши какво ще правиш сега.
  `,
  removeFromInventory: { item: "duck", quantity: 1 },
  choices: [
    {
      text: `
      Ще експериментираш с останалите гъби върху себе си — мини на 136.
      `,
      nextPage: 136,
    },{
      text: `
      Отказваш се от рискованите опити — продължи на 154.
      `,
      nextPage: 154,
    }
  ],
},
194: {
  text: `
Приближавате се до кладенеца и Бабаитко като най-як започва да върти колелото. Обаче работата се оказва по-трудна, отколкото е предполагал.
— Абе, много тежи тая пуста кофа! — пъхти чукундуртът. — С камъни ли са я напълнили?
Не с камъни, а със съвсем друго, както се оказва. Когато най-сетне кофата достига ръба на кладенеца, в нея седи… таласъм.
— По заповед на негово величество Дървеняк Първи употребата на мокра вода е забранена в цялата област! — строго изрича той. — Марш оттук!
— Шефе, нека му опаля един по цафарата — предлага Бабаитко. — Да види той как се забранява!
— Не, шефе! — прекъсва го Хухавел. — Да не почваме с насилие още отсега. Дай да го подкупим, а?
Кого ще послушаш?
  `,
  choices: [
    {
      text: `
      Бабаитко — мини на 208.
      `,
      nextPage: 208,
    },{
      text: `
      Хухавел — продължи на 234.
      `,
      nextPage: 234,
    },{
      text: `
      Ако се откажеш от водата и продължиш пътешествието, мини на 177.
      `,
      nextPage: 177,
    }
  ],
},
195: {
  text: `
Успех! Парченце от червената гъба прогонва ужасната тежест и ти най-сетне въздъхваш от облекчение. 
  `,
  choices: [
    {
      text: `
      Ако все още имаш смелостта да експериментираш с вълшебните гъби, върни се на 136.
      `,
      nextPage: 136,
    },{
      text: `
      Ако не желаеш повече да рискуваш, продължи на 154.
      `,
      nextPage: 154,
    }
  ],
},
196: {
  text: `
— Ваше величество! — пронизително се провиква един от таласъмите. — Тъкмо такава джаджа ни трябваше за машината!
— Аха! — ухилва се Дървеняк. — Значи сам ми донесе инструмента за моето дело, нещастнико! Е сега ще станеш свидетел на триумфа ми. Дръжте го!
Преди да сторите каквото и да било, върху вас се нахвърля цяла тълпа таласъми. Стиснати здраво от десетки ръце, вече не можете и да помръднете. Майсторите сръчно монтират усуканата джаджа в грамадната машина и след малко шефът им козирува пред Дървеняк.
— Готово, ваше величество. Машината за производство на суха вода е в пълна изправност.
Дървеняк ти хвърля злобна усмивка, после пристъпва към машината и дръпва един голям лост. След миг отвътре бликва воняща суха вода.
— А сега ги затворете в тъмницата! — заповядва царят на таласъмите.
  `,
  choices: [
    {
      text: `
      Премини на 285.
      `,
      nextPage: 285,
    }
  ],
},
197: {
  text: `
Първите разногласия в отряд „Чукундуртски отмъстители“ избухват още преди да сте тръгнали. Всеки от четирите ти спътници претендира за честта да носи торбата с провизиите.
— Ум трябва за тая работа! — заявява категорично Хухавел. — Затова аз съм най-подходящ.
— Не се ли виждаш, че си слаботелесен, бе нещастнико? — перва го по главата Бабаитко. — Аз трябва да нося торбата, защото съм най-як.
Гадолини и Фърчилан също излагат солидни аргументи в своя полза. Чудиш се кого да избереш за тази важна задача. Дали пък сам да не носиш торбата? Но пък от друга страна… някак не върви да се превиваш под товара, а твоите подчинени да вървят с ръце в джобовете.
Така или иначе, трябва да избереш. Отбележи кого си назначил да носи торбата и продължи на 211.
  `,
  choices: [
            { text: "Хухавел ", nextPage: 211,  bagCarrier: "Хухавел"},
            { text: "Бабаитко", nextPage: 211,   bagCarrier: "Бабаитко"},
            { text: "Фърчилан ", nextPage: 211,  bagCarrier: "Фърчилан"},
            { text: "Гадолини ", nextPage: 211,   bagCarrier: "Гадолини"},
            { text: "Самият ти ", nextPage: 211,   bagCarrier: "самият ти"},
  ],
},
198: {
  text: `
Гадолини пристъпва напред и жално поглежда змея.
— Слушай, няма ли да размислиш, а? Не е човешко да ни ядеш.
— А човешко ли е да стоя гладен? — изръмжава змеят. — Хич не ми се молете, ще ви ям!
— Добре де — въздъхва Гадолини. — Щом е тъй, аз съм съгласен.
Бре, каква стана тя! Предателство в собствените ви редици! 
  `,
  choices: [
    {
      text: `
      Ако незабавно отнемеш думата на Гадолини, мини на 223.
      `,
      nextPage: 223,
    },{
      text: `
      Ако го оставиш да говори, продължи на 241.
      `,
      nextPage: 241,
    }
  ],
},
199: {
  text: `
— Имам си вече, драги! — ухилва се таласъмът и посочва дрипавите си панталони. — Предложи нещо друго!
— Да ти пеем? — предлага Бабаитко.
— Не! — отвръща таласъмът. — Не ми се пее.
`,
  choices: [
    {
      text: `
      Върни се на 234 и направи нов избор.
      `,
      nextPage: 234,
    }
  ],
},
200: {
  text: `
С храбростта на отчаянието отхапваш от зелената гъба. Тутакси те изпълва чувство на непоносима тежест и ти се сгромолясваш пред слисаните чукундурти.
— Ама какви ги правиш, бе шефе? — вайка се Хухавел. — Ти май съвсем обърка конците!
Не ти остава друг избор, освен да продължиш с експериментите. Каква гъба ще изпробваш сега?
  `,
  choices: [
    {
      text: `
      Червена — попадаш на 146.
      `,
      nextPage: 146,
    },{
      text: `
      Синя — прехвърли се на 167.
      `,
      nextPage: 167,
    },{
      text: `
      Черна — отгърни на 53.
      `,
      nextPage: 53,
    }
  ],
},


  },
};
