export const bookData = {
    pages: {
      1: {
        text: `
        Става ти съвестно. Горките чукундурти са останали без хранителни запаси и през зимата наистина току-виж изпукали от глад. Очевидно това беше бедата, от която искаха да ги спасиш. И ти се струва, че ако беше останал при тях, таласъмите нямаше да ги ограбят. 
  — Добре — кимваш ти. — Злодеянията на Дървеняк не бива да останат безнаказани. Тръгвам с вас. Но най-напред дайте да се запознаем. 
  — Казвам се Гадолини и съм майстор на гадните трикове — покланя се мрачният чукундурт. — Такъв номер мога да врътна всекиму, че свят да му се завие. 
  — Аз съм Бабаитко — пристъпва до него едрият чукундурт, който стърчи с две глави над останалите. — Може и да не ме бива по гадните номера, ама когото цапардосам, свитки ще му изхвръкнат от очите. 
  — То не може така — обажда се до него хилав чукундурт, гушнал под мишница проскубана бяла патка. — Насилието не решава нещата. Ум трябва, ум! Аз, драги ни предводителю, се казвам Хухавел и съм най-умният чукундурт в цялото село. 
  — Затова те пратиха да пасеш патките, нали? — ехидно се обажда Гадолини. 
  — Че какво? — обижда се Хухавел. — То и за тая работа ум трябва. Какво като са патки, и те душа носят… 
  — Добре де, не се препирайте — прекъсваш ги ти и се обръщаш към четвъртия чукундурт, който е строен и дългокрак. — А ти, младежо, с какво можеш да се похвалиш? 
  — Аз съм Фърчилан — представя се той. — С ум и сила не мога да се похваля, ама умея да бягам. И това е важно, нали така? 
  — Тъй, тъй — подкрепя го Гадолини. — Като стане напечено, той пръв ще си плюе на петите. 
  — Тихо! — подвикваш ти. — Значи отсега нататък ние петимата сме група командоси под кодовото название „Чукундуртски отмъстители“. Обаче сигурно не сте се сетили, че за из пътя ще ни трябват провизии. 
  — Абе, то… за сещане сетихме се — промърморва Фърчилан. — Ама нали таласъмите ометоха всичко. Ето с какво разполагаме. 
  И той ти показва три кочана царевица. 
  Бабаитко на свой ред измъква от грамадния си джоб едно цвекло. 
  — Това е свещеният чукундур — шепнешком обяснява той. — Задигнах го от селския храм. Голям грях си турих на душата, ама какво да се прави — делото иска жертви. 
  Кимваш и се обръщаш към другите, но Бабаитко те хваща за рамото. 
  — Чакай, има и още нещо. Я гледай тук. 
   
  С тия думи той измъква от другия си джоб нещо като издълбан пън, от който стърчи кух израстък. 
  — Това пък какво е? — изненадваш се ти. 
  — Лулата на мира — гордо отвръща той. — Знае ли човек накъде могат да избият работите? Ако решим да водим мирни преговори, ще ни трябва нещо такова. 
  Сетне той се отдръпва, за да стори място на Гадолини, който измъква изпод плаща си два зрели домата. 
  И накрая Хухавел триумфално ти показва вехта торба, в която е скътал едра, напращяла диня и калъп домашен сапун. 
  — И сапуна ли броите към провизиите? — изненадваш се ти. 
  — Като ни засвирят коремите от глад, няма къде да се дяваме. И сапун ще жвакаме — обажда се Бабаитко. 
  — Не си прави майтап с хигиената! — скарва му се Хухавел. — Без сапун закъде сме? Нали трябва да си мием ръцете преди ядене. 
  — Ако има какво да ядем — ухилва се Гадолини. 
  — Ама и вие сте едни чукундурти! — скарваш им се ти. — Нямате никаква организация на работата. Съберете всички запаси в торбата и един да ги носи. 
  Идеята обаче поражда първите разногласия в отряд „Чукундуртски отмъстители“. Всеки от четиримата ти спътници претендира за честта да носи торбата с провизиите. 
  — Ум трябва за тая работа! — заявява категорично Хухавел. — Затова аз съм най-подходящ. 
  — Не се ли виждаш, че си слаботелесен, бе нещастнико? — перва го по главата Бабаитко. — Аз трябва да нося торбата, защото съм най-як. 
  Гадолини и Фърчилан също излагат солидни аргументи в своя полза. Чудиш се кого да избереш за тази важна задача. Дали пък сам да не носиш торбата? Но пък от друга страна… някак не върви да се превиваш под товара, а твоите подчинени да вървят с ръце в джобовете. 
  Така или иначе, трябва да избереш. Отбележи кого си назначил да носи торбата, запиши подробно всички налични запаси и продължи на 244. 
  — Кой ще носи торбата?
    `,
        addToInventory: [
          { item: "bag", quantity: 1 },
          { item: "duck", quantity: 1 },
          { item: "corn", quantity: 3 },
          { item: "watermelon", quantity: 1 },
          { item: "tomato", quantity: 2 },
          { item: "beetroot", quantity: 1 },
          { item: "pipe", quantity: 1 },
          { item: "soap", quantity: 1 },
        ],
        choices: [
          { text: "Хухавел ", nextPage: 244, bagCarrier: "Хухавел" },
          { text: "Бабаитко", nextPage: 244, bagCarrier: "Бабаитко" },
          { text: "Фърчилан ", nextPage: 244, bagCarrier: "Фърчилан" },
          { text: "Гадолини ", nextPage: 244, bagCarrier: "Гадолини" },
          { text: "Самият ти ", nextPage: 244, bagCarrier: "самият ти" },
        ],
      },

      244: {
        text: `
  През цялото утро неуморно вървите напред през ливади, горички, пущинаци, поточета и долчинки. Тук-там различавате дирята на таласъмите, но когато наближава пладне, почвата става камениста и следите изчезват. Продължавате в същата посока, макар че вече нищо не ви подсказва дали сте на прав път или не.
  — Уф, изморих се — промърморва по някое време Бабаитко. — Дайте да спрем за почивка и да хапнем по нещо.
  — Никакви такива! — строго възразяваш ти. — Ако искате, ще спрем да починем. Обаче съдържанието на торбата ще пазим за краен случай.
  При тия думи те обзема лека тревога. Трябва да провериш какво става с торбата. На кого си поверил да я носи?
    `,
        choices: [
          {
            text: `
        На Хухавел — мини на 15.
        `,
            nextPage: 15,
          },
          {
            text: `
        На Бабаитко — продължи на 36.
        `,
            nextPage: 36,
          },
          {
            text: `
        На Фърчилан — прехвърли се на 69.
        `,
            nextPage: 69,
          },
          {
            text: `
        На Гадолини — попадаш на 80.
        `,
            nextPage: 80,
          },
          {
            text: `
        Сам носиш торбата — отгърни на 105.
        `,
            nextPage: 105,
          },
        ],
      },
  
      3: {
        text: `— Кой носи торбата?`,
        choices: [
            { text: "Хухавел — прехвърли се на 15. ", nextPage: 15, requiresBagCarrier: "Хухавел"},
            { text: "Бабаитко — прехвърли се на 16. ", nextPage: 2, requiresBagCarrier: "Бабаитко"},
            { text: "Фърчилан — прехвърли се на 77. ", nextPage: 7, requiresBagCarrier: "Фърчилан"},
            { text: "Гадолини — прехвърли се на 13. ", nextPage: 13, requiresBagCarrier: "Гадолини"},
            { text: "Самият ти — прехвърли се на 18. ", nextPage: 8, requiresBagCarrier: "самият ти"},
        ],
        },
      4: {
        text: `— Бях огнедишащ, обаче вече не съм — въздъхва змеят. — Остарях, изнемощях… На, гледай!
          
          Той разтваря широко грамадната си паст и почва да съска като кипнал чайник, но въпреки всички усилия от гърлото му излитат само две-три облачета пушек.
          
          — А пък бях страшен звяр — тъжно клати глава змеят. — Ако ме видят сега, за смях ще стана. Затуй съм се заврял под земята — да не ми гледат срама.
          
          — Това е защото не гледаш научно на нещата! — упреква го Хухавел и се обръща към теб. — Шефе, дай една царевица!`,
        choices: [
          {
            text: "Ако имаш царевица и се съгласиш да я дадеш на Хухавел, мини на 23. ",
            requiresItem: { item: "corn", quantity: 1 },
            removeFromInventory: { item: "corn", quantity: 1 },
            nextPage: 7,
          },
          { text: "В противен случай продължи на 15. ", nextPage: 15 },
        ],
      },
      5: {
        text: `— Кой ще носи торбата?`,
        choices: [
            { text: "Хухавел ", nextPage: 3,  bagCarrier: "Хухавел"},
            { text: "Бабаитко", nextPage: 3,   bagCarrier: "Бабаитко"},
            { text: "Фърчилан ", nextPage: 3,  bagCarrier: "Фърчилан"},
            { text: "Гадолини ", nextPage: 3,   bagCarrier: "Гадолини"},
            { text: "Самият ти ", nextPage: 3,   bagCarrier: "самият ти"},
        ],
        
        },
      6: {
        text: `Имал ли си нещастието преди малко да бъдеш ранен с вилица в ръката?`,
        choices: [
          {
            text: "Да — мини на 25. ",
            nextPage: 25,
            requiresCondition: { condition: "injuredWithFork" },
          },
          {
            text: "Не — продължи на 21. ",
            nextPage: 21,
            requiresCondition: { condition: "healthy" },
          },
        ],
      },
      7: {
        text: `Минавал ли си вече по този път?`,
        choices: [
          { text: "Да — продължи на 4. ", nextPage: 4, visitedPages: 8 },
          { text: "Не — прехвърли се на 8. ", nextPage: 8 },
        ],
      },
      8: {
        text: `Изненеада! `,
        choices: [
          {
            text: "Ранен с вилица, мини на 6. ",
            changeCondition: { injuredWithFork: true,  healthy: false},
            nextPage: 6,
          },
          {
            text: "Неуспешна атака от таласъм, мини на 6. ",
            nextPage: 6,
          },
        ],
      },
      10: {
        text: `О, любезний читателю! С това свое решение ти показа, че наистина в гърдите ти бие сърце на чукундурт. Не ще и дума, очаква те трудна, но славна съдба. Тепърва ще бъдеш оплюван всекидневно от целокупния чукундуртски народ. Ако издържиш на изпитанията достатъчно дълго, подир време току-виж си станал министър на простите работи. Но така или иначе това вече е съвсем друга история. Твоето приключение привършва дотук.`,
        choices: [],
        end: true,
      },
      11: {
        text: `Добре, но как да му помогнеш? Сега е моментът да провериш с какво разполагаш.`,
        choices: [
          {
            text: "Ако имаш чифт вехти панталони и искаш да ги дадеш на Мишемориус, мини на 13. ",
            nextPage: 13,
            requiresItem: "oldTrousers",
            removeFromInventory: { item: "oldTrousers", quantity: 1 },
          },
          {
            text: "Ако имаш шишенце с универсален разтворител и го използваш, за да отлепиш панталоните му от стола, продължи на 48. ",
            nextPage: 48,
            requiresItem: "bottleOfSolvent",
            removeFromInventory: { item: "bottleOfSolvent", quantity: 1 },
          },
          {
            text: "А ако нямаш нито едното, нито другото, прехвърли се на 87. ",
            nextPage: 1,
          },
        ],
      },
  
  
      // throw dice ???
      13: {
        text: `— Хвърляй царевицата, шефе! — отчаяно се провиква Гадолини.
          Разбираш гениалната му идея и незабавно хвърляш царевицата на стъпалата, сетне продължаваш да бягаш надолу.
          Колко кочана царевица си хвърлил? `,
        choices: [
          {
            text: "Един — мини по свой избор на 217, 227 или 242.",
            nextPage: [3, 4, 8],
            requiresItem: { item: "corn", quantity: 1 },
            removeFromInventory: { item: "corn", quantity: 1 },
          },
          {
            text: "Два — продължи на 206 или 259.",
            nextPage: [1, 2],
            requiresItem: { item: "corn", quantity: 2 },
            removeFromInventory: { item: "corn", quantity: 2 },
          },
          {
            text: "Три — прехвърли се на 250.",
            nextPage: 25,
            requiresItem: { item: "corn", quantity: 3 },
            removeFromInventory: { item: "corn", quantity: 3 },
          },
        ],
      },
  
  
  
  
  

      15: {
        text: `Щом отваряш торбата, отвътре добродушно те поглежда патката на Хухавел.
  
          — Къш, птицо проклета! — крясваш ти, после се обръщаш към чукундуртите и свирепо питаш: — Какво търси тук това животно?
  
          — Не е животно, а птица, сам го каза преди малко — поправя те Хухавел. — Турнах я вътре, щото иначе е много неудобно. Нали разбираш, шефе, патката под мишница и торбата на другото рамо. Хич не върви, значи.
  
          Да, но се оказва, че патката не разбира от дисциплина. Изкълвала е двата домата и тъкмо се готви да начене царевицата.
  
          — И най-умният чукундурт пак си остава чукундурт — въздъхваш ти. — Стига толкова! Отсега нататък аз ще нося торбата.`,
        choices: [
          {
            text: "Отбележи си загубата на двата домата и премини на 138.",
            nextPage: 16,
            removeFromInventory: { item: "tomato", quantity: 2 },
          },
        ],
      },
      16: {
        text: `— Чакай сега да видим с какво разполагаме — промърморва Фърчилан и започва да рови из торбата.`,
        choices: [
          {
            text: "Ако имаш домат, мини на 4.",
            nextPage: 4,
            requiresItem: { item: "tomato", quantity: 1 },
            removeFromInventory: { item: "tomato", quantity: 1 },
          },
          {
            text: "Ако имаш диня, продължи на 18.",
            nextPage: 18,
            requiresItem: { item: "watermelon", quantity: 1 },
            removeFromInventory: { item: "watermelon", quantity: 1 },
          },
          {
            text: "Ако нямаш нищо от изброеното, попадаш на 21.",
            nextPage: 21,
          },
        ],
        moreText:
          "А ако имаш и двете, избери с кое си готов да се разделиш и премини на съответния епизод.",
      },
      18: {
        text: `След доста усилия импровизираната манерка е готова.`,
        choices: [
          {
            text: "Отбележи си, че нямаш вече диня и премини на 25.",
            nextPage: 25,
            removeFromInventory: { item: "watermelon", quantity: 1 },
            addToInventory: [{ item: "watermelonBottleWithWater", quantity: 1 }]
          },
        ],
      },
      21: {
        text: `Когато се свестяваш, лежиш в тясна килия, а около теб седят унило четиримата чукундурти. Попадал ли си вече в затвора?`,
        choices: [
          {
            text: "Да — мини на 10.",
            nextPage: 10,
            requiresCondition: "jailed",
          },
          { text: "Не — продължи на 7.", nextPage: 7 },
        ],
      },
      25: {
        text: `
              Когато огледалцето му казва, че е най-красив на земята, таласъмът изпада във възторг. Без повече да ви обръща внимание, той се отдръпва настрани с безценната придобивка.  
              `,
        choices: [
          {
            text: "Напълваш съдинката си с вода и преминаваш на 15. ",
            addToInventory: [{ item: "water", quantity: 1 }],
            nextPage: 15,
          },
        ],
      },
      116: {
        text: `
        А какви са отношенията ви със змея? 
          `,
        choices: [
          {
            text: `
            Добри — мини на 143. 
            `,
            nextPage: 1,
          },{
            text: `
            Не твърде добри — продължи на 162. 
            `,
            nextPage: 2,
          },
        ],
      },
    
    },
  };
  
