const bookData = {
    pages: {
      1: {
        text: `Нещо не е наред...
        Да, нещо не е наред — усещаш го още преди да си се събудил напълно. Сякаш вместо върху познатия сламеник в горската си колиба сега лежиш някъде другаде. Но това е невъзможно, казваш си ти. Как бих могъл да се пренеса на друго място? По вълшебство ли?
  
        И отваряш очи.
        
        В следващия миг скачаш от разхвърляното легло и се оглеждаш смаяно. Този път предчувствието не те е излъгало. Наистина си попаднал другаде — в някаква непозната схлупена колиба с едно-единствено зацапано прозорче, през което едва се процеждат утринните лъчи.
        
        Що за дяволия? Как си се озовал тук?`,
        choices: [
          { text: "Почесваш се озадачено по тила, после излизаш от колибата и попадаш на 85. ", nextPage: 85 }
        ],
      },
      2: {
        text: `— Чакай сега да видим с какво разполагаме — промърморва Гадолини и започва да рови из торбата.`,
        choices: [
          { text: "Ако имаш стоножка в бурканче, мини на 113. ", nextPage: 113 },
          { text: "Ако имаш лула на мира, продължи на 159. ", nextPage: 159 },
          { text: "Ако имаш царевица, прехвърли се на 192. ", nextPage: 192 },
          { text: "Ако нямаш нищо от изброеното, попадаш на 203. ", nextPage: 203 },
        ],
        moreText: "А ако имаш два или три от тези предмети, избери с кой си готов да се разделиш и премини на съответния епизод."
      },
      3: {
        text: `— Абе, ще ни излапат с парцалите, като не се вслушвате в гласа на разума — мърмори Хухавел и с усилие гази напред.

        А наоколо главите на блатните таласъми идват все по-близо. Внезапно един от тях отваря уста и изрича с квакащ глас:
        
        — Какви сте вие, добри хора, и по каква работа минавате през нашето блато?
        
        Какво ще му отговориш? `,
        choices: [
          { text: "Че сте търговци — мини на 20.  ", nextPage: 20 },
          { text: "Че сте мирни пътници — продължи на 35. ", nextPage: 35 },
          { text: "Че сте отряд командоси, тръгнали на тайна акция срещу таласъмите на Дървеняк Първи — попадаш на 50. ", nextPage: 50 },
          { text: "Че не е тяхна работа — прехвърли се на 66. ", nextPage: 66 },
        ],
      },
      4: {
        text: `— Бях огнедишащ, обаче вече не съм — въздъхва змеят. — Остарях, изнемощях… На, гледай!
        
        Той разтваря широко грамадната си паст и почва да съска като кипнал чайник, но въпреки всички усилия от гърлото му излитат само две-три облачета пушек.
        
        — А пък бях страшен звяр — тъжно клати глава змеят. — Ако ме видят сега, за смях ще стана. Затуй съм се заврял под земята — да не ми гледат срама.
        
        — Това е защото не гледаш научно на нещата! — упреква го Хухавел и се обръща към теб. — Шефе, дай една царевица!`,
        choices: [
          { text: "Ако имаш царевица и се съгласиш да я дадеш на Хухавел, мини на 23. ", nextPage: 23 },
          { text: "В противен случай продължи на 45. ", nextPage: 45 }
        ],
      },
      5: {
        text: `— Тишина! — извикваш ти. — След като сте ме избрали за външен министър, чуйте какво ще ви кажа. Сатанинските планове на Дървеняк не бива да се осъществят в никакъв случай. И с това ще се заема лично аз. Още утре потеглям към новия замък на таласъмите. Искам в ранни зори насред селото да се явят всички доброволци за участие в тази опасна, но почетна мисия.
        
        Чукундуртите изревават възторжено.
        
        — Жална им майка на таласъмите! — коментира някой до теб. — Ще се оталасъмчат набързо.
        
        Друг перва министър-предателя по главата.
        
        — Видя ли бе? Това се казва министър, а не предател като тебе. Ако не беше той, как щяхме да разкрием плановете на Дървеняк?
        
        През целия следобед настроението в селото е тържествено. Чукундуртите те разнасят на ръце и пеят революционни песни. Привечер предлагат да те настанят като скъп гост в най-хубавата колиба. Обещават дори да ти осигурят течаща вода и централно отопление.
        
        Силно си изненадан, че в това село има такива модерни удобства, но какво ли не може да се очаква от чукундуртите. Решавай сега каква колиба ще избереш.`,
        choices: [
          { text: "С течаща вода и централно отопление — мини на 26. ", nextPage: 26 },
          { text: "Само с течаща вода — продължи на 58. ", nextPage: 58 },
          { text: "Само с централно отопление — попадаш на 91. ", nextPage: 91 },
          { text: "Без такива глезотии — прехвърли се на 109. ", nextPage: 109 }
        ],
      },
      6: {
        text: `Имал ли си нещастието преди малко да бъдеш ранен с вилица в ръката?`,
        choices: [
          { text: "Да — мини на 230. ", nextPage: 230 },
          { text: "Не — продължи на 284. ", nextPage: 284 }
        ],
      },
      7: {
        text: `Минавал ли си вече по този път?`,
        choices: [
          { text: "Да — продължи на 33. ", nextPage: 33 },
          { text: "Не — прехвърли се на 8. ", nextPage: 8 }
        ],
      },
      8: {
        text: `Без колебание повеждаш дружината си по лявото разклонение. Може и да са прави чукундуртите — все пак гъбената чорбица е хубаво нещо. Скоро пътят започва постепенно да завива надясно и навлиза в рядка горичка.
        
        — По такива места растат най-хубавите гъби — развълнувано обявява Бабаитко. — Пък и камъкът сигурно не лъжеше. Слушай, шефе, дай да потърсим. Тя работата, няма да избяга.`,
        choices: [
          { text: "Ако се съгласиш да потърсите гъби, мини на 24. ", nextPage: 24 },
          { text: "Ако не искаш да губиш време за подобни глупости, продължи на 49. ", nextPage: 49 }
        ],
      },
      9: {
        text: `— Аман от суха вода! — ядосва се таласъмът и запокитва шишенцето в кладенеца. — Вие подигравате ли ми се? Марш веднага оттук! Никаква вода за вас!
        
        — Дай да му опаля един, бе шефе! — моли се Бабаитко.`,
        choices: [
          { text: "Ако му разрешиш да го стори, мини на 208. ", nextPage: 208 },
          { text: "Ако се откажеш от водата и продължиш пътешествието, мини на 177. ", nextPage: 177 }
        ],
      },
      10: {
        text: `О, любезний читателю! С това свое решение ти показа, че наистина в гърдите ти бие сърце на чукундурт. Не ще и дума, очаква те трудна, но славна съдба. Тепърва ще бъдеш оплюван всекидневно от целокупния чукундуртски народ. Ако издържиш на изпитанията достатъчно дълго, подир време току-виж си станал министър на простите работи. Но така или иначе това вече е съвсем друга история. Твоето приключение привършва дотук.`,
        choices: [],
      },
      11: {
        text: `Добре, но как да му помогнеш? Сега е моментът да провериш с какво разполагаш.`,
        choices: [
          { text: "Ако имаш чифт вехти панталони и искаш да ги дадеш на Мишемориус, мини на 34. ", nextPage: 34 },
          { text: "Ако имаш шишенце с универсален разтворител и го използваш, за да отлепиш панталоните му от стола, продължи на 48. ", nextPage: 48 },
          { text: "А ако нямаш нито едното, нито другото, прехвърли се на 87. ", nextPage: 87 }
        ],
      },
      12: {
        text: `Щом отхапваш парченце от жълтата гъба, по цялото ти тяло пробягва непоносим сърбеж и виждаш как короните на дърветата стремително падат насреща ти. Не! Дърветата са неподвижни, но самият ти си израснал невероятно, тъй че сега главата ти се подава над върхарите им.
        
        — Леле, шефе! — уплашено подвиква Фърчилан. — Какво стана? Ами че в тоя вид хич не ставаш за тайна мисия! Ще те зърнат отдалече.`,
        choices: [
          { text: "Синя — продължи на 57. ", nextPage: 57 },
          { text: "Червена — попадаш на 29. ", nextPage: 29 },
          { text: "Зелена — прехвърли се на 200. ", nextPage: 200 },
          { text: "Черна — отгърни на 53. ", nextPage: 53 }
        ],
      },
    },
  };
  
  export default bookData;
